{
  "title": {
    "title": "BALI LEMPUYANG TOUR",
    "href": "https://www.baligoldentour.com/bali-lempuyang-tour.php",
    "src": null,
    "text": "BALI LEMPUYANG TOUR",
    "html": "BALI LEMPUYANG TOUR"
  },
  "tagline": {
    "title": "BALI LEMPUYANG TOUR IS ONE DAY TRIP TO VISIT LEMPUYANG TEMPLE OR MOST KNOWN AS GATE OF HEAVEN AND VISIT OTHER INTERESTING SITE IN EAST BALI",
    "href": "https://www.baligoldentour.com/bali-lempuyang-tour.php",
    "src": null,
    "text": "BALI LEMPUYANG TOUR IS ONE DAY TRIP TO VISIT LEMPUYANG TEMPLE OR MOST KNOWN AS GATE OF HEAVEN AND VISIT OTHER INTERESTING SITE IN EAST BALI",
    "html": "BALI LEMPUYANG TOUR IS ONE DAY TRIP TO VISIT LEMPUYANG TEMPLE OR MOST KNOWN AS GATE OF HEAVEN AND VISIT OTHER INTERESTING SITE IN EAST BALI"
  },
  "description": {
    "title": null,
    "href": null,
    "src": null,
    "text": "Bali Lempuyang Tour is a Bali Full Day Tour Packages to visit Lempuyang temple or most known as Gate of Heaven and visit other interesting site in East Bali islands. Lempuyang temple is one of the biggest temple in Bali islands, located in high land with fascination view of Mount Agung. From the gate of the lempuyang temple we can see an amazing view of mount Agung. Our tour driver will pick up you at hotel in morning and then we go to lempuyang temple directly, the trip bit long due lempuyang temple located bit far in the east Bali. After arrive at there we will directly go to visit gate of heaven with fascinating view, then we will go to Tirta gangga park is water palace recreation for enjoy the view and then we go to restaurant for having lunch Indonesian food, after lunch finish we continue this Lempuyang tour to visit last site which is Tukad cepung waterfall is beautiful waterfall with amazing scenery, if you want to swim here, please don’t forget to bring towel, due we didn’t provide towel. After that we will go back to hotel with bring an awesome memory featured in this Bali Lempuyang Tour. Below is the explanation if the lempuyang tour, if you have any question about this tour, please drop us a messages, we will be happy to answer your question.",
    "html": "<strong><a href=\"https://www.baligoldentour.com/bali-lempuyang-tour.php\" title=\"Bali Lempuyang Tour\">Bali Lempuyang Tour</a></strong> is a <a href=\"https://www.baligoldentour.com/bali-full-day-tour.php\" title=\"Bali Full Day Tour Packages\"><strong>Bali Full Day Tour Packages</strong></a> to visit Lempuyang temple or most known as <strong>Gate of Heaven</strong> and visit other interesting site in East Bali islands. Lempuyang temple is one of the biggest temple in Bali islands, located in high land with fascination view of Mount Agung. From the gate of the lempuyang temple we can see an amazing view of mount Agung. Our tour driver will pick up you at hotel in morning and then we go to lempuyang temple directly, the trip bit long due lempuyang temple located bit far in the east Bali. After arrive at there we will directly go to visit gate of heaven with fascinating view, then we will go to Tirta gangga park is water palace recreation for enjoy the view and then we go to restaurant for having lunch Indonesian food, after lunch finish we continue this Lempuyang tour to visit last site which is Tukad cepung waterfall is beautiful waterfall with amazing scenery, if you want to swim here, please don’t forget to bring towel, due we didn’t provide towel. After that we will go back to hotel with bring an awesome memory featured in this Bali Lempuyang Tour. Below is the explanation if the lempuyang tour, if you have any question about this tour, please drop us a messages, we will be happy to answer your question."
  },
  "placeLinks": [
    "Lempuyang Temple",
    "Tirta Gangga Water Palace",
    "Tukad Cepung Waterfall",
    "Bali Lempuyang Tour Itinerary",
    "Bali Lempuyang Tour Price and Inclusion"
  ],
  "placeDetails": [],
  "tourDetails": {
    "price": null,
    "itinerary": null,
    "inclusion": []
  }
}