[
  "<h1><a href=\"https://www.baligoldentour.com/alas-kedaton.php\" title=\"BALI ALAS KEDATON TEMPLE\">BALI ALAS KEDATON TEMPLE</a> </h1>\n<h2><a href=\"https://www.baligoldentour.com/alas-kedaton.php\" title=\"BALI ALAS KEDATON TEMPLE LOCATED INSIDE SMALL FOREST WITH NATURAL MONKEY HABITAT\">BALI ALAS KEDATON TEMPLE LOCATED INSIDE SMALL FOREST WITH NATURAL MONKEY HABITAT</a></h2>\n<a href=\"https://www.baligoldentour.com/alas-kedaton.php\"><img src=\"images/bali-interest-place/alas-kedaton-temple-bali-golden-tour.jpg\" alt=\"ALAS KEDATON TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1000\" height=\"500\" class=\"auto-width mb-3\" title=\"ALAS KEDATON TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n\n<p class=\"text-justify\"><strong><a href=\"https://www.baligoldentour.com/alas-kedaton.php\" title=\"Bali Kedaton Temple\">Bali Alas Kedaton Temple </a></strong>is a small forest with the width about 6-7ha located in the middle of the rice field in Tabanan regency, west part of Bali. The total size of Kedaton forest, temple and its supporter facility is about 12 ha. In this forest, there is a temple called Alas Kedaton Temple and owns the natural environments that is looked green with its fresh air and create the calm, quite and holy atmosphere. Alas Kedaton tourist attraction is a natural tourist attraction to see the beauty of the forest with an unspoiled atmosphere and also see a lot of monkey populations here with their funny behavior.</p>\n<p class=\"text-justify mb-2\"><strong>All you need to know Alas Kedaton Temple</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#monkey-alas-kedaton\">Monkey at Alas Kedaton</a></li>\n<li><a href=\"#location-alas-kedaton\">Location Alas Kedaton</a></li>\n<li><a href=\"#temple-festival-alas-kedaton\">Temple Festival at Alas Kedaton</a></li>\n<li><a href=\"#tourist-destination\">Tourist Destination Alas Kedaton</a></li>\n<li><a href=\"#interesting-alas-kedaton\">Interesting Thing at Alas Kedaton</a></li>\n<li><a href=\"#attraction-alas-kedaton\">Atraction at Alas Kedaton Temple</a></li>\n<li><a href=\"#how-get-to-alas kedaton\">How get to Alas Kedaton Temple</a></li>\n</ul>\n<span id=\"monkey-alas-kedaton\">\n<h3 class=\"font-small\"><strong>Monkey at Alas Kedaton Temple</strong></h3>\n<p class=\"text-justify\">The monkeys in Alas Kedaton Temple are very tame and free gallivanting in temple yard, so that the calm atmosphere is sometime solved by noise voice of the monkey, which are playing around and scrambling of food. The monkeys who dwell in Alas Kedaton Temple, there are jump up and down in temple wall, take a bath in moat or there is also hang out in few leaves representing impression view. The monkey like as custodian of temple, which are always ready to greet all visitor who are paying a visit to Alas Kedaton Temple. Beside monkeys, in Kedaton forest also can be met the bats and some other animals. At least 24 types of grove plant have been identified in Alas Kedaton Temple.</p>\n</span>\n<span id=\"location-alas-kedaton\">\n<h3 class=\"font-small\">Location Alas Kedaton</h3>\n<p class=\"text-justify\">Alas Kedaton Temple is located in Kukuh countryside, Marga Sub district Tabanan Regency. The journey go to Alas Kedaton Temple can be done easily by using motor vehicle follow the major roadway from Denpasar to Tabanan. On the way go to Alas Kedaton Temple, we will  see the beautiful nature view where in front of us will meet the carpet of rice field and irrigation voice at the side of road to bear the impression/peaceful atmosphere. Alas Kedaton Temple have three yard that are external yard, middle and center yard. In the center and middle yard are encircled by wall and the outside yard is representing a open yard. The interesting point of this Alas Kedaton Temple is the inside yard representing holy yard, its situation lower than the middle yard. This thing is different compare with the general temples in Bali that are more goes to inside the temple, the  more higher the place will be. Beside of that another interesting point of this temple owns four entrances.</p>\n</span>\n<span id=\"temple-festival-alas-kedaton\">\n<h3 class=\"font-small\"> Temple Festival at Alas Kedaton Temple </h3>\n<p class=\"text-justify\">The Alas Kedaton Temple ceremony is carried out every 210 days a year. It is on Anggarakasih Medangsia (Balinese Hindu calendar) or on every Tuesday where on that time the society do the worship or pray to request the safety and prosperity. The unique in this ceremony at Alas Kedaton Temple is do not use the fire and do not hence Penjor and also finished before the sunset or before the night is come.</p>\n<span id=\"tourist-destination\">\n<div class=\"row\">\n<div class=\"col-md-4\"> <a href=\"https://www.baligoldentour.com/alas-kedaton.php\"><img src=\"images/bali-interest-place/alas-kedaton-temple-bali-golden-tour-2.jpg\" alt=\"INSIDE ALAS KEDATON TEMPLE\" width=\"300\" height=\"200\" class=\"full-width mb-2\" title=\"INSIDE ALAS KEDATON TEMPLE\"></a> </div>\n<div class=\"col-md-8\">\n<h3 class=\"font-small\">Alas Kedaton Temple is Tourist Destination in Bali Islands</h3>\n<p class=\"text-justify\">In growth of handling of this tourist destination, Alas Kedaton Temple has several become a training location about tourism nature, environmental handling and agro tourism. Alas Kedaton is many visited by the tourist from local and foreign countries which are generally a lot of paying a visit on August, December until January, while the local tourist generally pay a visit on holiday season and feast day of Ramadan (Moslem holiday) and Alas Kedaton Temple is good to be visited in the day time. In front of Alas Kedaton temple there are quite a lot small shops selling the handicraft as souvenir, for example clothes, pants and other handicrafts. Others, there are some shops booth selling food and beverage, toilet and park area which is wide enough. </p>\n</div>\n</div>\n</span>\n<span id=\"interesting-alas-kedaton\">\n<h3 class=\"font-small\">Interesting Things at Alas Kedaton Temple</h3>\n<p class=\"text-justify mb-0\">Visiting Alas Kedaton Temple Bali, at least there are 3 interesting things we can see. </p>\n<ol>\n<li>First is the funny of the monkeys around the trees, Is free from charge of taking picture of monkey</li>\n<li>The second one is bat show, must paid in order to enjoy the bat show at Alas Kedaton Temple</li>\n<li>The third one is take some pictures with the snake. must paid to take picture with the snake. is good expereince especially for the children,can bring a very interesting experience  related to the animals</li>\n</ol>\n<p class=\"text-justify\">  In Alas Kedaton Temple, there are about 2.000 monkeys. They are the most attractive magnet for the visitors. The visitors can give some foods to  the monkeys directly. Just put some nuts or cookies on your hand and&nbsp;those  monkey will be happy to eat. With only some nuts on the hand, some brave visitors can take some pictures while the monkeys eating the nuts on their  head, or hand. When doing this activity it is very advised to not wearing your  hat, or glasses. The monkey have a bad attiture: they will steal your hat or glasses when ever they have a chance.</p>\n</span>\n<span id=\"attraction-alas-kedaton\">\n<h3 class=\"font-small\">Atraction at Alas Kedaton Temple</h3>\n<p class=\"text-justify\">  The authorities of Alas Kedaton Forest, Desa Adat Kukuh, Marga, Tabanan has designed the forest full with the monkeys, to interact with the  visitors directly. Of course, all of the monkey is gentle. They are not bad, as  long as the visitor does not doing some bad thing, like hit them.<br>\nAnother attraction is a bat show. It is not ordinary bat, but a giant bat. Very big. You will not see this kind of bat in daily life. So in Alas Kedaton Temple this could be the only one experience taking picture with a giant  bat. <br>\nLast attraction at Alas Kedaton Temple is taking the picture with the snake. Not only for adults, kids is also very happy with the attraction. Again, this is not a wild snake like we often see in National  Geographic. Although the snake is very big and long, but this creature is a gentle one. Some photograph with the snake in Alas Kedaton can be good here.</p>\n</span>\n<span id=\"how-get-to-alas kedaton\">\n<h3 class=\"font-small\"><strong>How get to Alas Kedaton Temple</strong></h3>\n<p class=\"text-justify\"> Alas Kedaton Bali can be reached from Kuta in about 30-45 minutes drive. You  can go there, commonly by a car rental. The best time to visit this place of interest is around noon time. Alas Kedaton is at the same route with <a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\" title=\"Tanah Lot Temple\" target=\"_blank\">Tanah Lot Temple</a>. So,  if you put Tanah Lot Temple on one of your itinerary, then <a href=\"https://www.baligoldentour.com/bali-tanah-lot-tour.php\" title=\"Bali Tanah Lot Tour\" target=\"_blank\">Bali Tanah Lot Tour</a> is best choices. If you want to visit only certain attractions, we <strong><a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a></strong> also provide car and driver rental services in Bali at affordable prices and for the itinerary according to your wishes. With a private car and an experienced driver will make the trip even more enjoyable</p>\n</span>\n</span>"
]