[
  "<h1><a href=\"https://www.baligoldentour.com/bajra-sandhi-monument.php\" title=\"BALI BAJRA SANDHI MONUMENT\">BALI BAJRA SANDHI MONUMENT</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/bajra-sandhi-monument.php\" title=\"BALI BAJRA SANDHI MONUMENT IS A MONUMENT OF BALINESE PEOPLE STRUGGLE\">BALI BAJRA SANDHI MONUMENT IS A MONUMENT OF BALINESE PEOPLE STRUGGLE</a></h2>\n<a href=\"https://www.baligoldentour.com/bajra-sandhi-monument.php\"><img src=\"images/bali-interest-place/bajra-sandhi-monument.jpg\" alt=\"Bajra Sandhi Monument | Bali Interest Place | Bali Golden Tour\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"Bajra Sandhi Monument | Bali Interest Place | Bali Golden Tour\"></a>\n\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/bajra-sandhi-monument.php\" title=\"Bajra Sandhi Monument\"><strong>Bajra Sandhi Monument</strong></a> is monument of Balinese People Struggle . This Monument is recognized by the name of Bajra Sandhi because it's form is looking like Bajra or Genta or bell used by all Hindu Priest in reading off Weda holy sentence (mantra) at religious ceremony. Bajra Sandhi Monument is built in the year 1987 and it is opened by president of Megawati Sukarno Putri on 14 June 2003. Since its inauguration, this monument has always been crowded with visitors, where besides its very strategic location in the city center and in the Renon Denpasar field, where this field is often used by the public for sports, with the grandeur of the building, from a design that is very characteristic of Bali, where There are many carvings in every corner of this Bajra Sandhi monument building. With a large garden surrounding it, making this monument one of the tourist attractions in Denpasar, it is always crowded with foreign and domestic visitors who want to see the uniqueness of this monument.</p>\n<p class=\"text-justify mb-2\"><strong>If you visit Bajra Sandhi Monument, Here all you need to know</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#purpose\">Purpose Monument</a></li>\n<li><a href=\"#beginning\">The Beginning </a></li>\n<li><a href=\"#philosophy\">The Philosophy</a></li>\n<li><a href=\"#building\">The Building</a></li>\n<li><a href=\"#facilities\">Facilities</a></li>\n<li><a href=\"#3d-museum\">I Am Bali 3D Museum</a></li>\n</ul>\n<span id=\"purpose\">\n<h3 class=\"font-small\">The Purpose of Building Bajra Sandhi Monument</h3>\n<p class=\"text-justify\">If we talk about the purpose of building this Bajra Sandhi monument, then we will tell you earlier about the struggles of the Balinese people in the past. Where in the past during the colonial period by foreigners in Indonesia, especially in Bali, as heroes of I Gusti Ngurah Rai and I Gusti Ketut Pudja who became pioneers in the struggle against the invaders, fought relentlessly and without giving up to uphold justice where the battle was called the Puputan Jagaraga in 1848 - 1849, followed by the Banjar people's resistance in 1868, and the Puputan Badung war in 1906, the Klungkung war in 1908 and the Puputan Margarana war in 1946. So that this history is not forgotten by the next generations to preserve the history of the struggle of the Balinese people and remember the services of the heroes who died for the independence of Indonesia, the government gives awards by put the names of roads, airports and others so that future generations will not forget the struggle. of these heroes. This appreciation is also a place for the younger generation to learn and emulate the form of self-sacrifice, love for the homeland, and love for unity and integrity carried out by the leaders in carrying the name of Indonesia to achieve independence. And one of the biggest ones to be immortalized is by building the Bajra Sandhi monument which is located in the Renon field with the term Monument of the Struggle of the Balinese People. The purpose of Bajra Sandhi Monument is to immortalize the soul and spirit of Balinese People struggle, at one blow dig, looking after, developing and also preserve the culture of Bali to be bequeathed to a router generation as advancing capital stroke tread a world of loaded progressively with the challenge and resistance.</p>\n<a href=\"https://www.baligoldentour.com/bajra-sandhi-monument.php\"><img src=\"images/bali-interest-place/bajra-sandhi-monument-1.jpg\" alt=\"Bajra Sandhi Monument | Bali Interest Place | Bali Golden Tour\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"Bajra Sandhi Monument | Bali Interest Place | Bali Golden Tour\"></a>\n</span>\n<span id=\"beginning\">\n<h3 class=\"font-small\">The beginning of the monument Bajra Sandhi</h3>\n<p class=\"text-justify\">Starting from a contest that was discussed by Prof. Ida Bagus Mantra, who at that time served as the Governor of Bali, gave a competition about the idea of ​​building a monument and a competition about the design of the monument, and the winner of the design was Ida Bagus Yadnya, who at that time had the status of as a student at Udayana University. And in August 1988 the groundbreaking was carried out as a sign of the start of the construction of this monument, as for the construction of this monument it took a long time because there were many obstacles in terms of budget due to the monetary crisis that year and construction was stopped and continued again, until in 2003 this building completed and inaugurated by President Megawati Soekarno Putri, since then many have admired the design of this bajra sandhi monument and used it as a place for selfies, recreation and gatherings with relatives or family, with a strategic position you can see this building from the highway what is in this puputan field, from a distance it looks so majestic</p>\n</span>\n<span id=\"philosophy\">\n<h3 class=\"font-small\">Philosophy of Bajra Sandhi Monument : </h3>\n<p class=\"text-justify\">Many philosophies describe the reasons for the construction of the Bali People's Struggle Monument. Linga-Yoni philosophy which symbolizes fertility and prosperity, where the meeting between Linga which means the symbol of Purusa (male) and Yoni which means the symbol of Pradana (woman). Mr. Nyoman Subawa said that this monument was also set in the philosophy of the Adi Parwa Book, namely the story of Mandara Giri (Mount Mandara) screening in Ksirarnama (Ocean of Milk). This story tells that the Gods and Giants/Daitya seek Tirta Amertha (water of eternal life) by going around Mount Mandara. The Mount Mandara screening is not easy. The gods hold the tail of the dragon Besuki which is a parable of the ropes and twists of the mountain, while the Daityas hold the head. To maintain the base of Mount Mandara which is an Akupa (tortoise), Lord Shiva holds back by occupying the top of the mountain. The obstacles traversed in turning Mount Mandara finally paid off. Successively came out Ardha Candra (Crescent Moon), Dewi Sri and Laksmi, Kuda Uchaisrawah (Flying Horse), Kastuba, Mani (Tree of Happiness), and finally came out Dewi Dhanwantari who brought Tirta Amertha. Philosophically, this story reflects the message for the younger generation to always work hard, be tenacious, diligent, and work together to achieve success. Not only has the value of Hindu philosophy, the Bajra Sandhi monument is also full of symbols of independence. There are 17 steps at the main entrance of the monument. There are 8 majestic pillars inside the monument which have a height of 45 meters. The figures are the date of Indonesian independence 17 August 1945</p>\n\n<a href=\"https://www.baligoldentour.com/bajra-sandhi-monument.php\"><img src=\"images/bali-interest-place/bajra-sandhi-monument-2.jpg\" alt=\"Bajra Sandhi Monument | Bali Interest Place | Bali Golden Tour\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"Bajra Sandhi Monument | Bali Interest Place | Bali Golden Tour\"></a>\n</span>\n<span id=\"building\">\n<h3 class=\"font-small\">The Building of Bajra Sandhi Monument</h3>\n<p class=\"text-justify mb-1\">The shape of the monument of Bajra Sandhi is made similar to the shape of the Bajra (clapper) or sacred bell (sandhi) used by Hindu priests in chanting sacred mantras when leading religious ceremonies in Bali, because with a similar shape it is called the Bajra. Sandhi Monument. We think this name is very unique and very suitable to be given, because this monument gives a very majestic impression when people see this building for the first time. And it is also explained about the dioramas contained in this bajra sandhi monument, where there are 33 diorama units placed sequentially according to the stories of the Balinese people from Bali since the Prehistoric Period, Historical Period, Ancient Bali Period, Middle Bali Period, Colonial Period, to the Old Age. Struggle for Independence. And all of the depictions of this diorama are explained in three-dimensional form complete with statues of humans, animals and others that explain the history of Bali. This diorama is intended so that visitors to the Bajra Sandhi Monument can understand and learn about the nature, situation, and atmosphere of Bali at that time. It is expected the tighten of the spirit and cultural to increase Bali tourism. The existence of physical building is strongly relating to the meaning of Hinduism philosophy, namely Yoni colossus. Bajra Sandhi Monument is likely colossus device meanwhile the building base as yoni. From other side, the Yoni colossus is also describing the story of twiddling Mandhara Giri at Ksirarnawa which is taken away from passage of Adi Parwa (Hindu's Book). Bajra Sandhi Monument Building  consisted of : </p>\n<ul class=\"mb-3\">\n<li>Jar of Amertha symbol by Kumba (a kind of pot) what is seen on the top monument</li>\n<li>The Dragon Basuki tail exists near by Swamba and its head at entrance gate</li>\n<li>The body of Bedawang Akupa realized at its base of monument and the head at entrance gate</li>\n<li>Mount of Mandara Giri realized by the high of monument boosting</li>\n<li>Pool encircle the monument is supposing as Ksirarnawa (milk ocean) </li>\n</ul>\n</span>\n<span id=\"facilities\">\n<h3 class=\"font-small\">Facilities at Bajra Sandhi Monument</h3>\n<p class=\"text-justify\">The facilities at Bajra Sandhi Monument are very complete, where the location of Bajra Sandhi is located in the Niti Mandala Renon field, very strategically in the city center, there is a large parking area around the field, a very large field which is often used for exercise by the community. around. Many food and beverage vendors sell here, there are toilets for visitors. Very complete, so if you come here you don't need to hesitate anymore. Bajra Sandhi Monument in its development, it has been opened for visitor and to be places of interest or tourist destination in Bali in particular when visiting Denpasar town. You may also join <a href=\"https://www.baligoldentour.com/bali-denpasar-city-tour.php\" title=\"Bali Denpasar City Tour Package\" target=\"_blank\">Bali Denpasar City Tour Package</a> to visit this beautiful place.  With very complete facilities, making the Bajra Sandhi monument one of the tourist attractions in this Denpasar city, with all the uniqueness and splendor of the building, it is very worthy for you to visit if you happen to be in Denpasar or heading to Ubud.</p>\n</span>\n<span id=\"3d-museum\">\n<h3 class=\"font-small\">I Am Bali 3D Museum at Bajra Sandhi Monument</h3>\n<p class=\"text-justify\">There is one thing that is very interesting if you visit here, where on the bottom floor of the Bajra Sandhi Monument there is a 3D museum called <strong>I Am Bali 3D Museum</strong>, here there is a three-dimensional museum that you might be able to visit if you finish walking around the Bajra Sandhi Monument. 3 dimensional photos here with all kinds of design forms such as human figures, nature, animals, buildings, birds and others, which will definitely make you feel at home to linger here. Enjoy taking pictures here with a 3D sensation. When you enter the three dimensions you will need socks to keep the floors in this museum clean, don't worry because the museum has socks that you can buy, if you don't bring them. A very interesting experience when visiting the monument to the struggle of the Balinese people and seeing its history followed by visiting a fantastic three-dimensional museum with all forms of 3-dimensional photo spots that are here</p>\n</span>"
]