[
  "<h1 class=\"text-uppercase\"><a href=\"https://www.baligoldentour.com/bali-museum.php\" title=\"Bali Museum\">Bali Museum</a></h1>\n<h2 class=\"text-uppercase\"><a href=\"https://www.baligoldentour.com/bali-museum.php\" title=\"Bali Museum is Heritage Balinese Museum for Maintain and preserve the history of Balinese Culture in The Past\">Bali Museum is Heritage Balinese Museum for Maintain and preserve the history of Balinese Culture in The Past</a></h2>\n<a href=\"https://www.baligoldentour.com/bali-museum.php\"><img src=\"images/bali-interest-place/bali-museum-bali-golden-tour.jpg\" alt=\"Bali Museum | Balinese heritage culture Museum | Bali Interest Place\" width=\"1200\" height=\"500\" class=\"auto-width mb-3\" title=\"Bali Museum | Balinese heritage culture Museum | Bali Interest Place\"></a>\n\n<p class=\"text-justify\"><strong><a href=\"https://www.baligoldentour.com/bali-museum.php\" title=\"Bali Museum\">Bali Museum</a></strong> is strategically located in Major Wisnu Street in Denpasar Baliand it is find it due to the location is in the heart town. In the north side there are glorious temple of Jagatnatha, meanwhile in front of it the Puputan Badung (Badung Courtyard) and four face statue (Catur Muka Statue) are located. The development of Bali Museum is begun by the existence of initiative how to vitally the heritage of Balinese culture and taking care of, preserve and maintaining. The initiative is based on the existence of feeling to worry, that there is symptom a kind of culture erosion, so that the cultural heritage become totally disappeared, lose, what omit only photograph and documentations. An extraordinary experience in knowing about the life and culture of the Balinese people in the past here, enjoy information about Bali from the past to the present at the Bali Museum</p>\n  <p class=\"text-justify mb-2\"><strong>If you visit Bali Museum, here all you need to know</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#location\">Bali Museum Location</a></li>\n<li><a href=\"#history\">Bali Museum History</a></li>\n<li><a href=\"#purpose\">Noble Purpose of Bali Museum</a></li>\n<li><a href=\"#geography\">Bali Museum Geography</a></li>\n<li><a href=\"#can-see\">What You Can See at Bali Museum</a></li>\n<li><a href=\"#facilities\">Facilities at Bali Museum</a></li>\n</ul>\n<span id=\"location\">\n  <h3 class=\"font-small\">Bali Museum Location</h3>\n  <p class=\"text-justify\">The location of the Bali Museum is located in the center of Denpasar city with all the hustle and bustle of social activities in the city center and next to the Jagatnatha Temple which is a public temple for the people of Bali and also close to the Puputan Badung field which is a place of recreation for residents of the city of Denpasar. It's not so difficult to find this place, by relying on google maps and being able to reach the location of the Bali Museum, it has become one of the museum tours in Denpasar. If you are confused about finding the location of this bali museum, you can use <a href=\"https://www.baligoldentour.com/bali-car-charter.php\" title=\"Hire Car and Driver\">Hire Car and Driver</a> services that offer <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a> to get around Denpasar city and visit the Bali Museum and also other tourist destinations that are no less interesting. With a very cheap price and also satisfying service, it will make the trip to the Bali Museum very enjoyable. An opportunity that rarely exists where you know the uniqueness and beauty of this tourist destination in the city of Denpasar</p>\n</span>\n<span id=\"history\">\n<h3 class=\"font-small\">Bali Museum History</h3>\n<p class=\"text-justify\">The fall of the Kingdom of Klungkung into the hands of the Dutch colonialists on April 28, 1908 has signaled the change of power in Bali into the territory of the Dutch colonial government. This situation made a change in governance in Bali from being somewhat closed to outsiders to becoming more open to Europeans, especially the Dutch during the European colonial period in Indonesia. All other foreign nations became more and more free to come to Bali. They consist of various layers of society who often bring Balinese souvenirs as souvenirs when they return to their country. This condition made the existence of Balinese cultural heritage threatened, thus causing Dutch scientists and culturalists as well as artists to try to prevent this and to preserve Balinese cultural heritage.</p>\n<p class=\"text-justify\">The initial idea for the establishment of the Bali Museum was initiated by architect W.FJ Kroon (1909-1913) who was also an assistant resident of southern Bali in Denpasar. The idea was realized with the establishment of a building called Gedung Arca in 1910, while the architects who built the Bali Museum were I Gusti Gede Putu Kandel from Banjar Abasan and I Gusti Ketut Rai from Banjar Belong together with a German architect, Curt Grundler. for funds and materials provided by the Kings of Buleleng, Tabanan, Badung and Karangasem. The chairman of the antiquities service at that time was W.F Stturterhim who continued efforts to complete the ethnographic treasury in 1930 and to facilitate the management of the museum, a foundation was formed, chaired by H.R Ha'ak with its members and the foundation's personnel. 1932 and at the same time the Bali Museum was opened to the public which became a museum for storing relics of the human past and ethnography. The museum collection consists of ethnographic objects including tools and equipment for life, art, religion, written language, and others that reflect the life and development of Balinese culture in the past.</p>\n</span>\n  <span id=\"purpose\">\n<h3 class=\"font-small\">Noble Purpose of Bali Museum</h3>\n<p class=\"text-justify\">The purpose of building the Bali Museum is to maintain and preserve the history of Balinese culture in the past, because times are increasingly advanced and it is hoped that the history and discoveries of past relics that tell the history of Bali will not go extinct, and can be remembered and studied by future generations of Balinese people.. The construction of Bali Museum is begun from the idea how does the important to keep, maintain and sustainable the Balinese culture heritages. This initiative was based on sense of worry that there are symptoms such culture erosion, hence the culture heritages have become extinct, lose and leave the photos only.  To save the Balinese culture heritages, come the plan to establish a museum which is now ell know as Bali Museum. This is a very noble goal, so that even though times are advancing, we must not forget our identity as Balinese people and at least maintain and preserve the results of our ancestral heritage which is one of the characteristics of the island of Bali which is famous for its local wisdom, customs and variety traditions</p>\n</span>\n<div class=\"row\">\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/tirta-gangga.php\"><img src=\"images/bali-interest-place/bali-museum-1.jpg\" alt=\"Bali Museum | Denpasar Places of Interest\" title=\"Bali Museum | Denpasar Places of Interest\" width=\"300\" height=\"225\" class=\"full-width mb-2\"></a></div>\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/tirta-gangga.php\"><img src=\"images/bali-interest-place/bali-museum-2.jpg\" alt=\"Bali Museum | Denpasar Places of Interest\" title=\"Bali Museum | Denpasar Places of Interest\" width=\"300\" height=\"225\" class=\"full-width mb-2\"></a></div>\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/tirta-gangga.php\"><img src=\"images/bali-interest-place/bali-museum-3.jpg\" alt=\"Bali Museum | Denpasar Places of Interest\" title=\"Bali Museum | Denpasar Places of Interest\" width=\"300\" height=\"225\" class=\"full-width mb-2\"></a></div>\n</div>\n<span id=\"geography\">\n<h3 class=\"font-small\">Bali Museum Geography </h3>\n<p class=\"text-justify mb-1\">The museum building is designed in a typical puri or royal style in Denpasar, which has a museum complex pavilion representing various regencies on the island of Bali. So you can visit the Bali museum and see various historical relics of each district with the uniqueness and beauty of each district will make your insight increase, So in one place you can find out the history of the island of Bali as a whole, a museum place that is very suitable for tourists. students who want to know more about the island of Bali, the geography of the Bali Museum is as follows</p>\n<ol class=\"mb-2\">\n<li class=\"text-justify mb-2\">Tabanan Pavilion: Located in the north and stores collections - keloksi such as dance equipment, dance costumes, all kinds of masks for dance, wayang kulit, keris (traditional Balinese sword) for Calonarang as well as some ancient statues from ancient times in tabanan district</li>\n<li class=\"text-justify mb-2\">Buleleng Pavilion: Located in the center of the building has a typical temple style in North Bali and stores various kinds of collections such as Balinese clothing from Buleleng and also traditional fans made in Buleleng long ago and also some other important relics found</li>\n<li class=\"text-justify mb-2\">Badung Pavilion: Located at the entrance with a high bale kulkul and stores various kinds of prehistoric collections used by humans during hunting and farming, cultivation and metallic periods in antiquity and also displays a collection of fine arts in Bali</li>\n<li class=\"text-justify mb-2\">Karangasem Pavilion: Located in the eastern part and holds a depiction of traditional building art from the eastern part of Bali. This building contains several exhibitions of paintings, fine arts, archeology and several objects from pre-historic times which are very full of history</li>\n</ol>\n<p class=\"text-justify\">The building area of ​​​​the <a href=\"https://www.baligoldentour.com/bali-museum.php\" title=\"Bali Museum\">Bali Museum</a> is 2600 square meters with three pages, namely the outer courtyard (jaba), the middle courtyard (jaba Tengah) and the inner courtyard (offal) which are bordered by walls and gates. The gate here is named Candi Bentar and Candi Kurung serves as the entrance, and there is a Kulkul Hall (wooden bell) which is located to the south of Central Jaba. Meanwhile, in the northwest corner stands the Bengong Hall which was used during the royal era as a place for the King's family to rest if they want to observe the atmosphere outside the palace. In addition, there is also a beji, which is a bath for the royal family placed in front of the Tabanan Building. The roof of the fibers is only used for the roof of the temple building.</p>\n</span>\n\n  <span id=\"can-see\">\n<h3 class=\"font-small\">What You Can See at Bali Museum</h3>\n<p class=\"text-justify\">As one of the museums in Denpasar which is very complete with historical stories from culture in Bali which has several collections of ancient civilizations found in Bali, which will add to your full insight about this beloved and very unique island of Bali. The object collections or ancient tools kept at Bali Museum can be classified into prehistoric object collections such as tomb stone (sarkopag), the object collection from the historical era such as Stupika clay containing mantra 'Ye te', bronze statues (Arca Perunggu), and ethnographic objects such as the collection of Kris, Endek material, religious ceremony equipment and Sidakarya Mask. can be classified become the prehistoric object collection like: the Grave Petrify (sarkopag), the object collection coming from history era like: stupika clay containing superstitious formula Ye Te, the bronze statues (Hindu andBudha statues) and ethnography object collection like Keris, Endek Cloth, and religious ceremony equipments (Sangku, Cecepan and Sidakarya mask) and also some unique collections that are no less interesting. Those are some pre-historic collections that you can see here, very suitable for those of you who like history and want to know about the history of the development of Bali from the past to the present and know the developments from era to era to the present day.</p>\n</span>\n\n<span id=\"facilities\">\n<h3 class=\"font-small\">Facilities at Bali Museum</h3>\n<p class=\"text-justify\">The facilities at the <a href=\"https://www.baligoldentour.com/bali-museum.php\" title=\"Bali Museum\">Bali Museum</a> are very complete so that it will make you feel at home for a long time at the museum location, with a very good layout that will make the atmosphere of visiting very pleasant. There is a parking lot located around the Puputan Badung field which is quite spacious, so you don't have to worry about finding a parking space, there are people selling drinks and snacks that you can buy if you are thirsty and take a rest in the Puputan field and see the social activities of the community here. often used as a place for jogging and recreation, there are clean toilets in the Bali museum that you can use, so you don't have to worry about this toilet problem. A very capable supporting facility that will make tourists feel very comfortable visiting the Bali Museum while adding insight into the history of traditional culture in Bali which is very full of uniqueness and diversity of customs and customs.</p>\n</span>"
]