[
  "<h1><a href=\"https://www.baligoldentour.com/bali-bird-park-tour.php\" title=\"BALI BIRD PARK\">BALI BIRD PARK</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/bali-bird-park-tour.php\" title=\"BALI BIRD PARK TOUR IS TO WITNESS AND GET CLOSED WITH THE LARGEST AND FINEST COLLECTION OF INDONESIAN, AFRICA AND SOUTH AFRICA BIRDS IN THE BEST PARK IN BALI ISLANDS\">BALI BIRD PARK TOUR IS TO WITNESS AND GET CLOSED WITH THE LARGEST AND FINEST COLLECTION OF INDONESIAN, AFRICA AND SOUTH AFRICA BIRDS IN THE BEST PARK IN BALI ISLANDS</a></h2>\n<a href=\"https://www.baligoldentour.com/bali-bird-park-tour.php\"><img src=\"images/bali-activities-tour/bali-bird-park-tour.jpg\" alt=\"BALI BIRD PARK | BALI ACTIVITIES TOUR | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"full-width mb-3\" title=\"BALI BIRD PARK | BALI ACTIVITIES TOUR | BALI GOLDEN TOUR\"></a>\n<p class=\"text-justify\"><strong><a href=\"https://www.baligoldentour.com/bali-bird-park-tour.php\" title=\"Bali Bird Park\">Bali Bird Park</a></strong> Tour&nbsp;is a <a href=\"https://www.baligoldentour.com/bali-activities-tour.php\" title=\"Bali Activities Tour\">Bali Activities Tour</a> to enjoy experience visiting the best Bird Park in Bali islands with many kinds collection of Birds and Fantastic birds from Africa and South Africa. Feel this excitement get closed with Birds from many kind species  and make this holiday is memorable one for you and family. Bali Bird Park is a park that is used as a conservation area for endangered birds and also as a place of entertainment for children and also as a place of learning for children who want to know more about bird life and hunting species. Here there are many bird species and there are also very rare birds here. And there is also a typical Balinese worker, the Bali Starling, which is often called the bird of paradise. Enjoy walking around the Bali Bird Park and see the unique and beautiful birds here</p>\n<span id=\"bird\">\n<h3 class=\"font-small\">Bird Collection at Bali Bird Park</h3>\n<p class=\"text-justify\">Find yourself at the <strong>Bali Bird Park</strong> to witness the largest and finest collection of Indonesian birds in the world plus fantastic birds from Africa &amp; South America. Encompassing two hectares of botanical landscape, the park provides sanctuary to almost 1000 birds of 250 different species. Our innovative approach towards the display of rare and tropical birds has progressed from traditional exhibits to that of showcasing mixed species in their natural habitats &amp; in large walk in Aviaries and free range throughout the park. With the vast area of ​​land, this place can preserve many endangered birds and animals here, enjoy, see the various types of birds found here and increase your knowledge about bird species from exotic to very rare. With the complete collection of birds here, it will add to the excitement in this Bali Bird Park tour</p>\n</span>\n<span id=\"plants\">\n<h3 class=\"font-small\">Plants Collection at Bali Bird Park</h3>\n<p class=\"text-justify\">In addition to birds of various species that are here, here are also provided a variety of rare plants and plants that are so beautiful, so besides seeing birds you can also see plants of various types that are here. And in every place it is designed so beautifully with plants on display and planted so that it feels like we are in a small forest with lots of birds chirping as if to add a very natural impression. <a href=\"https://www.baligoldentour.com/bali-bird-park-tour.php\" title=\"Bali Bird Park\"><strong>Bali Bird Park</strong></a> accommodates an amazing display of flora with more then 2000 tropical plants including 50 varieties of palms alone and attracting numerous butterflies. Incorporating a breeding, research and veterinary facility within the complex, the park has a high success rate in the captive reproduction of exotic birds such as the Bird. of Paradise and Hornbill. \nSo in addition to increasing your knowledge about the various species of birds found in this world, you can also find out the various species of plants found here, very suitable for children as information for learning to know all kinds of birds and plants.</p>\n</span>",
  "<h3 class=\"font-small mb-2\"><strong>Details of Bali Bird Park Tour</strong> :</h3>\n<ul class=\"mb-2\">\n<li><a href=\"#bird\">Bird Collection at Bali Bird Park</a></li>\n<li><a href=\"#plants\">Plants Collection at Bali Bird Park</a></li>\n<li><a href=\"#species\">Bird species in Bali Bird Park</a></li>\n<li><a href=\"#see\">What You Can See at Bali Bird Park</a></li>\n<li><a href=\"#you-can-do\">What You Can Do at Bali Bird Park</a></li>\n<li><a href=\"#conservation\">Conservations Program at Bali Bird Park</a></li>\n<li><a href=\"#species\">Bird Species in Bali Bird Park</a></li>\n<li><a href=\"#price\">Bali Bird Park Tour Itineray and Price</a></li>\n</ul>",
  "<div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><img src=\"images/bali-activities-tour/bali-bird-park-1.jpg\" alt=\"Bali Bird Park | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width mb-3\" title=\"Bali Bird Park | Bali Golden Tour\"></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><img src=\"images/bali-activities-tour/bali-bird-park-2.jpg\" alt=\"Bali Bird Park | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width mb-3\" title=\"Bali Bird Park | Bali Golden Tour\"></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><img src=\"images/bali-activities-tour/bali-bird-park-3.jpg\" alt=\"Bali Bird Park | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width mb-3\" title=\"Bali Bird Park | Bali Golden Tour\"></div>\n</div>\n<span id=\"species\">\n<h3>Bird species in Bali Bird Park</h3>\n<p class=\"text-justify\">Bali Bird Park has a large collection of birds to enjoy, as for this collection of birds from various parts of the continent which were brought here for conservation and protection, while the collection ranges from 1000 birds of 250 different species, you can see the details of the collection of birds contained here. at this Bali Bird Park</p>\n<ol>\n<li class=\"text-justify mb-2\"><strong>South America :</strong> View an array of South American exotics such as the Scarlet Macaw and the largest parrot in the world, the magnificent Hyacinth Macaw.<br>\n    <strong>Bird you can See :</strong> Scarlet Ibis, Purple Swamphen, Glossy Ibis, Green Winged Macaw, Hyacinth Macaw, Buffon Macaw, Blue and Gold Macaw, Love Bird, Orange-Winged Amazon, Hans Macaw, Red-fronted Macaw, Swainson's Toucan.</li>\n<li class=\"text-justify mb-2\"><strong>South Africa :</strong> Observe the African Grey Parrots, known for the ability to mimic the human voice, and other birds of the African Savannah. Visit the Flamingo pool and see our bright-pink wading birds – often standing on just one of their very long legs.<br>\n    <strong>Bird you can See :</strong> Violet Turaco, Congo African Grey Parrot, African Crowned Crane, Von der Decken's Hornbill, Ground Hornbill, Purple Glossy Starling, Amethys Starling, Senegal Parrot, Laughing Kookabura.</li>\n<li class=\"text-justify mb-2\"><strong>Sumatra :</strong> Visit the deep jungle of Sumatra for rare and strange endemic birds such as the Eagle Owl, with its sideways pointing ear tufts and powerful talons.<br>\n    <strong>Bird you can See :</strong> Senegal Parrot, Chrinsom Wing Parakeet, White Crested Hornbill, Bar-pouched Wreathed hornbill, Lesser Coucal, Black Indian Hawk Eagle</li>\n<li class=\"text-justify mb-2\"><strong>Borneo :</strong> Borneo has a huge variety of ecosystems - including some of the world's tallest lowland rainforests and misty cloud forest - and an incredible diversity of birds. View the birds of Borneo in our mixed species aviaries<br>\n    <strong>Bird you can See :</strong> Nicobar Pigeon, Bulwer Wattled Pheasant, Great Argus Pheasant, Javan Great Rhinoceros Hornbill, Flying Fox/Fruit Bat, Crested Serpent Eagle and many more</li>\n<li class=\"text-justify mb-2\"><strong>Papua :</strong> Discover the exotic birds of Papua in the magnificent walk-in aviary and one of the world’s most comprehensive collections of birds-of-paradise. Discover the large, flightless Cassowary that lives in the dense lowland forests and the Western Crowned Pigeon one of the most beautiful members of the pigeon family, with delicate blue lacy crests around<br>\n    <strong>Bird you can See :</strong> Golden-necked Cassowary, Double wanttled Cassowary, Golden Pheasant, Green Jungle Fowl, Amboina King Parrot, Western Crowned Pigeon, Emerald Ground Dove, Southern-pied Hornbill, Cinnamon Ground Dove, Black Lory, Black-capped Lory, Salvadori's Black-capped Lory, Rainbow lorikeet, White-bellied Imperial Pigeon, Racket-tailed Black Drongo, Southern Crowned Pigeon, New Guinea Bronzewing, Chattering lory, African Crowned Crane, Javan Green Peafowl, Indian-blue Peafowl, Yellow napped lory, Ornate Lory, Yellow Streaked Lory, Red Bird of Paradise, Yellow Streaked Lory, Pesquet's Parrot, Red Bird of Paradise, Twelve-wired Bird of Paradise</li>\n<li class=\"text-justify mb-2\"><strong>Java :</strong> See the fantastic Javan Hawk and Serpent Eagles and listen to the sweet sounds of Java's song birds echoing through the foliage.<br>\n    <strong>Bird you can See :</strong>  Banded pita, Asian Fairy-Bluebird, Asian Pied Starling, Black-naped Oriole, Javan Hawk Eagle, Southern-pied Hornbill, Magpie Robin, Sunda Scops Owl, Fire-tufted Barbet, Purple-backed Starling, Java Sparrow, Moustached parakeet</li>\n<li class=\"text-justify mb-2\"><strong>Bali :</strong> Experience the original Jungle birds of Bali and encounter the world's rarest bird, the Bali Starling. Bali’s highly endangered national bird is now regularly bred within the Park as part of conservation program<br>\n   <strong>Bird you can See :</strong> Bali Starling, Brown-billed Cuckoo Dove, Bronze-tailed Peacock Pheasant, New Guinea Bronzewing, Peaceful/Zebra Dove, Emerald Ground Dove, Flying Fox/Fruit Bat, Black-naped Oriole, Purple Swamphen, Ringneck White Dove, Pied Imperial Pigeon, Orange-breasted Green Pigeon, Glossy Ibis, Cattle Egret, Black-naped Fruit Dove, Little Green Pigeon, Spotted Dove, Common Myna, Javan Green Peafowl, Night pond Heron, Asian Pied Starling, Javan myna, Yellow vented bulbul, Australian Pelican, Bali Starling, Nias Hill Myna.</li>\n<li class=\"text-justify mb-2\"><strong>Owl House</strong> : Our stunning collection of nocturnal owls live quietly in a specially-adapted traditional Toraja house, which you can't mis as you enter the park. Make sure you see the Barred Eagle Owl with its side-ways pointing ear tufts.</li>\n\t</ol>\n</span>",
  "<span id=\"see\">\n<div class=\"row\">\n\n<div class=\"col-lg-4 col-sm-12\">\n<img src=\"images/bali-activities-tours/bali-bird-park-what-can-i-see.jpg\" alt=\"Bali Bird Park | Bali Activities Tour | Bali Golden Tour\" width=\"350\" height=\"200\" class=\"full-width mb-3\" title=\"Bali Bird Park | Bali Activities Tour | Bali Golden Tour\">\n</div>\n<div class=\"col-lg-8 col-sm-12\">\n<h3 class=\"font-small\"><strong>What You Can See at Bali Bird Park</strong></h3>\n<p class=\"text-justify\">\nJoin us for an adventure that has no boundaries as we take you on a journey across the Indonesian archipelago, Latin America and South Africa. The <strong>Bali Bird Park</strong> is divided into regions that recreate the natural habitats of our birds, complete with indigenous plant life and traditional artefacts for authenticity. Experience the original Jungle birds of Bali and encounter the world's rarest bird, the Bali Starling. Discover the exotic birds of Papua and one of the most comprehensive collections of Bird of Paradise in the whole world. Travel to Far East Indonesia, home to an amazing array of birds as well as the extraordinary Komodo Dragon</p>\n</div>\n\n</div>\n</span>",
  "<span id=\"you-can-do\">\n<div class=\"row\">\n\n<div class=\"col-lg-4 col-sm-12\">\n<img src=\"images/bali-activities-tours/bali-bird-park-what-can-i-do.jpg\" alt=\"Bali Bird Park | Bali Activities Tour | Bali Golden Tour\" width=\"350\" height=\"200\" class=\"full-width mb-3\" title=\"Bali Bird Park | Bali Activities Tour | Bali Golden Tour\">\n</div>\n<div class=\"col-lg-8 col-sm-12\">\n<h3 class=\"font-small\"><strong>What You Can Do at Bali Bird Park</strong></h3>\n<p class=\"text-justify\">Stroll within the boundaries of our giant walk-through aviaries that replicate the natural eco-systems of the Bali Jungle and Papuan Rainforest. Pathways and bridges are carved through the dense foliage where only filtered sunlight manages to penetrate the canopy of greenery overhead. Several vantage points have been strategically positioned to catch glimpses of free flying birds as they follow their survival instincts of foraging for food, nesting and mating. These protected enclosures safeguard rare species from outside predators, whilst still exposing them to the various aspects of living in the wild. Enjoy get closed with many kind of species Bird from all a part at <strong>Bali Bird Park</strong>.</p>\n</div>\n\n</div>\n</span>",
  "<span id=\"conservation\">\n<div class=\"row\">\n\n<div class=\"col-lg-4 col-sm-12\">\n<img src=\"images/bali-activities-tours/bali-bird-park-conservations.jpg\" alt=\"Bali Bird Park | Bali Activities Tour | Bali Golden Tour\" width=\"350\" height=\"200\" class=\"full-width mb-3\" title=\"Bali Bird Park | Bali Activities Tour | Bali Golden Tour\">\n</div>\n<div class=\"col-lg-8 col-sm-12\">\n<h3 class=\"font-small\"><strong>Conservations Program at Bali Bird Park</strong></h3>\n<p class=\"text-justify\"><strong>Bali Bird Park</strong> plays a key role in protecting and conserving Indonesia's endangered wildlife.\nThe <strong>Bali Bird Park</strong> have successfully bred many species, including the rare Pesquet's Parrot and numerous Bali Starlings. We accommodate more than 40 species of protected Indonesian birds in the park, a growing number of which are now breeding successfully under the care of our staff. The staff are proud of their new additions some of which can be seen in their incubators through the observation windows of the laboratory &amp; nursery building. By visiting the Bali Bird Park, you have supported the conservation program of saving the birds here, besides visiting to see birds, you are also helping them in their survival.</p>\n</div>\n\n</div>\n</span>",
  "<div class=\"row mb-3\">\n<div class=\"col-md-4\">\n<span id=\"price\">\n<h3 class=\"font-small\"><strong>Bali Bird Park Tour Itinerary</strong></h3>\n<ul class=\"mb-3\">\n<li>08.30 - Pick up at hotel</li>\n<li>10.00 - Visit Bali Bird Park</li>\n<li>16.00 - Back to hotel</li>\n<li>17.30 - Arrive at your Hotel</li>\n</ul>\n</span>\n</div>\n<div class=\"col-md-4\">\n<h3 class=\"font-small\"><strong>Bali Bird Park Price :</strong></h3>\n<ul class=\"mb-3\">\n<li>Adult : IDR 675.000/adults</li>\n<li>Children (2 - 12 years): IDR 525.000/children</li>\n<li>Infant : under 2 years of age are free of charge</li>\n</ul>\n</div>\n<div class=\"col-md-4\">\n<h3 class=\"font-small\"><strong>Bali Bird Park Price Include :</strong></h3> \n<ul class=\"mb-3\">\n<li>Private Car with Good A/C</li>\n<li>English Speaking Driver</li>\n<li>Petrol</li>\n<li>Entrance tickets.</li>\n<li>All bird shows</li>\n<li>Government tax and service charge.</li>\n</ul>\n\n</div>\n</div>"
]