[
  "<h1><a href=\"https://www.baligoldentour.com/lempuyang-temple.php\" title=\"BALI LEMPUYANG TEMPLE\">BALI LEMPUYANG TEMPLE</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/lempuyang-temple.php\" title=\"BALI LEMPUYANG TEMPLE IS ONE OF THE BIGGEST TEMPLE IN EAST BALI AND ALSO KNOWN AS GATE OF HEAVEN\">BALI LEMPUYANG TEMPLE IS ONE OF THE BIGGEST TEMPLE IN EAST BALI AND ALSO KNOWN AS GATE OF HEAVEN</a></h2>\n<a href=\"https://www.baligoldentour.com/lempuyang-temple.php\"><img src=\"images/bali-interest-place/lempuyang-temple-bali-golden-tour.jpg\" alt=\"LEMPUYANG TEMPLE | GATE OF HEAVEN | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"900\" height=\"500\" class=\"auto-width mb-3\" title=\"LEMPUYANG TEMPLE | GATE OF HEAVEN | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n\n\n<p class=\"text-justify\"><strong><a href=\"https://www.baligoldentour.com/lempuyang-temple.php\" title=\"Bali Lempuyang Temple\">Bali Lempuyang Temple</a></strong> is Hindu holy temple dedicated to worship Ida Sang Hyang Widi Wasa which manifests as the god Icwara, located in the top of Bisbis Hill in the east of Bali islands, from here can see the amazing view of the biggest mount agung in Bali. The temple most know by tourist with name Gate of Heaven Lempuyang temple. Lempuyang temple located in East Bali islands at Karangasem city, sub-district Abang, Tribuana village. Situated in the top of Bisbis Hill, the temple facing to the mount agung, from this temple you can see the amazing view of mount agung. The temple is a holy place for worship Ida Sanghyang Widhi Wasa in its manifestation as Icwara. This temple has status as one of the \"Sad Kahyangan Jagad\" so that it is clear that this temple is a sanctuary of the universe located in the east of the island of Bali. Thus viewed in terms of location, it can be explained that the function of this temple as a symbol to maintain the balance of the universe.</p>\n<p class=\"text-justify mb-2\"><strong>All you need to know Lempuyang Temple</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#location-lempuyang\">Location of Lempuyang Temple</a></li>\n<li><a href=\"#history-lempuyang\">History of Lempuyang Temple</a></li>\n<li><a href=\"#name-lempuyang\">Meaning Name Lempuyang</a></li>\n<li><a href=\"#7-temple\">7 Temple in Lempuyang Temple</a></li><a href=\"#7-temple\">\n</a><li><a href=\"#7-temple\"></a><a href=\"#gate-of-heaven\">Why is Called Gate of Heaven</a></li>\n<li><a href=\"#gate-of-heaven-effect\">Gate of Heaven Photo Effect</a></li>\n<li><a href=\"#spot-photo-lempuyang\">Spot Photo at Lempuyang Temple</a></li>\n<li><a href=\"#facilities-lempuyang\">Facilities at Lempuyang Temple</a></li>\n</ul>\n\n<h3 class=\"font-small\">Location of Lempuyang Temple</h3>\n<div class=\"row\">\n  <div class=\"col-md-8\">\n<span id=\"location-lempuyang\">\n\n<p class=\"text-justify\">The location of the <a href=\"https://www.baligoldentour.com/lempuyang-temple.php\" title=\"Lempuyang Temple\">Lempuyang Temple</a> is located in the eastern area of the island of Bali, namely in the village of Tribuana, Abang District, Karangasem. Precisely located on Bisbis Hill, where on this hill the scenery is very beautiful, you can see the view of Mount Agung very clearly. If you drive from Kuta it will take about 2 hours 30 minutes to reach this location, if you want to explore it yourself you can use Google Map to find the location of this Lempuyang Temple. A very good sensation to travel alone and see the beauty of this lempuyang temple. And if you don't want to be busy traveling alone, here we offer several tour packages that you can buy to visit this place, such as the <a href=\"https://www.baligoldentour.com/bali-lempuyang-tour.php\" title=\"Bali Lempuyang Tour\">Bali Lempuyang Tour</a> which also includes other attractions that are no less interesting, at prices that are certainly cheap and without losing service. which is very satisfying and will definitely make your day in visiting this Gate of Heaven</p>\n</span>\n</div>\n<div class=\"col-md-4\">\n<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d452.4383801258432!2d115.63119977736599!3d-8.391791863844333!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x2dd2071753222893%3A0x40a0fd58fe779263!2sPura%20Penataran%20Agung%20Lempuyang!5e0!3m2!1sen!2sid!4v1660357410737!5m2!1sen!2sid\" class=\"full-width\" width=\"400\" height=\"225\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>\n  </div>\n  </div>\n<span id=\"history-lempuyang\">\n<h3 class=\"font-small\">History of Lempuyang Temple</h3>\n<p class=\"text-justify mb-2\">Lempuyang Luhur Temple and other Sad Pura Sad Kahyangan were founded in the 11th century AD when Mpu Kuturan accompanied King Udayana to rule Bali with his queen. Pura Sad Kahyangan was established to protect Bali so that people continue to do things that are justified according to religious teachings. The establishment of the Lempuyang Luhur temple can’t be separated from the event of the downfall of \"Bhatara Tiga\" in ancient times from Semeru Mountain in Bali and events after the event. Of so many sources, it is worth citing three of them, namely :</p>\n<ol class=\"text-justify\">\n<li class=\"mb-2\">In Lontar Kutara Kanda Dewa Purana Bangsul was declared Sang Hyang Parameswara carrying mountains in Bali from Jambhudwipa (India), from Mount Mahameru. The piece of Mount Mahameru was brought to Bali and divided into three major parts and also small parts. The center is made of Mount Batur and Mount Rinjani, while the peak is Mount Agung. The smaller fragments become the mountain slopes in Bali that are related to each other. The mountains include Mount Tapsahi, Pengelengan, Siladnyana, Beratan, Batukaru, Nagaloka, Pulaki, Sangkur Peak, Rangda Hill, Trate Bang, Padang Dawa, Andhakasa, Uluwatu, Sraya and Gunung Lempuhyang. In the Old Javanese language Lempuh which means \"gamongan\". He brought this mountain range that surrounded Bali Island by Sang Hyang Parameswara as the location of God's manifestation gods to guard Bali.</li>\n<li class=\"mb-2\">In Lontar Kutara Kanda the Purana God of Bangsul also stated that the Parameswara assigned his son Sang Hyang Agnijayasakti down to Bali and preserved the welfare of Bali and located on Mount Lempuhyang or Gunung Gamorangan along with other gods.</li>\n<li class=\"mb-2\">In the inscription Sading C year 1072 Saka stated that Gunung Lempuhyang also called Gunung Adri Karang. At Mount Adri Karang this is the King of Jayasakti, because that is the mountain also called Karangsemadi. King Jayasakti was instructed by his father Sang Hyang Guru to go down to Bali to build the temple to become a safe and prosperous area. King Jayasakti invites his priests and his helpers and people to realize the order of Sang Hyang Guru to build Bali by initiating the construction of the temple at Mount Lempuhyang as the statues of God as Sang Hyang Iswara. Previously, Raja Jayasakti did as a first step in building a peaceful life in Bali.</li>\n</ol>\n<p class=\"text-justify\">Priest from the Lempuyang Temple are always held by one offspring traditionally according to the purusa (patrilinial) line, while the \"pengangge\" used in Lempuyang Luhur Temple is always white and yellow. When the aci or piodalan ceremony is held, all ingredients of the ingredients are provided by the \"Truna\" (youth), while those who work are \"\" Daha \"(krandan) are teenage women. This is so that all of them are sacred, because they are spiritual, although sometimes this cannot yet be a guarantee of the sanctity.</p>\n</span>\n<a href=\"https://www.baligoldentour.com/lempuyang-temple.php\"><img src=\"images/bali-interest-place/lempuyang-temple-1.jpg\" alt=\"LEMPUYANG TEMPLE | GATE OF HEAVEN | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"900\" height=\"500\" class=\"auto-width mb-3\" title=\"LEMPUYANG TEMPLE | GATE OF HEAVEN | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n<span id=\"name-lempuyang\">\n<h3 class=\"font-small\">Meaning Name Lempuyang</h3>\n<p class=\"text-justify\">When talking about the meaning of the word lempuyang, here there are many versions of the meaning of the name lempuyang, because there has been no research that has detailed the meaning of the name lempuyang, so based on several inscriptions, community stories and historical interrelationships, it can be said that there are 3 versions of the meaning of the word lempuyang that has been circulating in the community, here we try to explain some of the meanings of the word lempuyang based on 3 versions</p>\n<ol class=\"text-justify\">\n<li class=\"mb-2\">The first version explains that the origin of the name lempuyang is based on a cultural book, where it is explained that the word lempuyang comes from the word \"lampu\" which means \"light\" and \"hyang\" means \"god\", so lempuyang can be interpreted as a holy light from a bright god. Lempuyang Temple is the palace of Hyang Gni Jaya or Dewa Isawara.</li>\n<li class=\"mb-2\">The second version explains that the word lempuyang stands alone where in Java the word lempuyang refers to a type of plant for bamboo. It is also associated with the existence of banjars around lempuyang named bangle and gamongan. These two banjar names are the names of a type of plant commonly used as medicine or seasoning</li>\n<li class=\"mb-2\">The third version explains that the word lempuyang comes from the word \"empu\" or \"emong\" which means guarding, where Bhatra Hyang Pasupati sent his three sons and daughters to carry out the task of maintaining the stability of Bali from various shocks from natural disasters. The three sons and daughters, namely Bathara Hyang Putra Jaya resided in Tohlangkir (Mount) Agung with Parahyangan at Besakih Temple, Batari Dewi Danuh resided at Ulun Danu Batur Temple and Batara Hyang Gni Jaya on Mount Lempuyang</li>\n</ol>\n\n<p class=\"text-justify\">However, whatever the version of the meaning of the name lempuyang, Lempuyang Temple itself has a very large status, just like <a href=\"https://www.baligoldentour.com/besakih-temple.php\" title=\"Besakih Temple\">Besakih Temple</a> as the largest temple on the island of Bali. Great status both in the application of the concept of lotus buwana, chess loka nutmeg or even Dewata nawa sanga. As for the lontar or ancient inscriptions, there are three large temples that are often referred to, namely <a href=\"https://www.baligoldentour.com/besakih-temple.php\" title=\"Besakih Temple\">Besakih Temple</a> and <a href=\"https://www.baligoldentour.com/batur-temple.php\" title=\"Besakih Temple\">Ulun Danu Batur Temple</a> and <a href=\"https://www.baligoldentour.com/lempuyang-temple.php\" title=\"Lempuyang Temple\">Lempuyang Temple</a>. So these three temples already had a very large status in ancient times and as very important temples for ancient Hindus</p>\n</span>\n\n<span id=\"7-temple\">\n<h3 class=\"font-small\">7 Temple in Lempuyang Temple</h3>\n<p class=\"text-justify\">Lempuyang Temple was built for a worship of Ida Sang Hyang Widhi Wasa in his manifestation as Dewa Iswara who is known as the protector of the east. This temple, which is located at an altitude of 1,175 meters above sea level, is known to have one of the most beautiful views in Bali with the iconic Mount Agung as a backdrop. Lempuyang Temple is located in the bisbis hill area and Lempuyang Temple also consists of seven temples located at various heights, usually Hindus before going to the top, they will pray in the temples on the route to Lempuyang Luhur Temple. The peak of the seven temples is as follows</p>\n<ol class=\"text-justify\">\n<li class=\"mb-2\"><strong>Penataran Agung Temple (Gate of Heaven)</strong>: Penataran Agung Lempuyang Temple is located on a hillside, access is not that difficult to reach and you don't need to climb the 1700 stairs, because to climb the 1700 stairs is only to get to the existing Lempuyang Luhur Temple at the top of the hill. The first temple you will visit is Penataran Agung Lempuyang Temple, this place is most often visited by tourists because there is a gate with a very beautiful view of Mount Agung. This place is often known as the Gate of Heaven, where many tourists take photos at the gate with a photo service. services that take photos with a very instagrammable mirror effect. Because there are so many tourists enthusiastic about taking photos, the queue here is very long, it is recommended to come in the morning where there are not so many queues. Above the gate there is the Penataran Agung Temple where Hindus will pray here before heading to the next until they reach the Lempuyang Luhur Temple which is located at the top of Bisbis Hill.</li>\n<li class=\"mb-2\"><strong>Telaga Emas Lempuyang Temple</strong>: The second temple to visit, the Telaga Emas Temple, is a Beji Temple of Ida Batara Lempuyang Luhur. This temple functions as a place for healing or self-purification for devotees who want to go to Lempuyang Luhur Temple. It is a fountain where the water comes from water seepage at the top of Mount Lempuyang and the water is stored in a lake, where in this place there is a lake which is inhabited by thousands of gold colored frogs, these frogs can only be found in this place and are not spread to other areas, The uniqueness of this frog is that when it sounds at the same time it is similar to the sound of a bird chirping, you will be confused about distinguishing between a frog's voice and a bird's voice. The name gold is taken from the golden frogs found in this lake.</li>\n<li class=\"mb-2\"><strong>Telaga Sawang Lempuyang Temple</strong>: The third temple which is mentioned is the Telaga Swang Lempuyang Temple which is the beji or petitan temple of Ida Batara Mpu Genijaya which is located in Lempuyang Madya Temple, the Telaga Swang Temple is a water fountain that comes from water seepage from the top of Mount Lempuyang which towards the south, where the water seepage is collected in a lake which is used as a place for water bathing or bathing. Where this place functions as a place to clean oneself or purify oneself before heading to Lempuyang Madya Temple. The unique thing about this place is that the lake water never dries up even in the dry season, and in this lake there are ponds and frogs, where the frogs here are black, almost the same size as the golden frogs found in the Telaga Emas temple, the only difference here is that the color is black.</li>\n<li class=\"mb-2\"><strong>Lempuyang Madya Temple</strong>: The fourth temple to visit is Lempuyang Madya Temple, this temple is included in the category of Dang Kahyangan Temple. Regarding the status of those who are worshiped (worshipped) by Hindus at the temple, they are convinced that they are Ida Batara, Empu Agenijaya and Empu Manik Geni. Where, Empu Agenijaya had seven brothers, including Mpu Kuturan, Mpu Baradah and Mpu Semeru. Meanwhile, the existing mostgih include the mostgih bebaturan linggih Batara Empu Agenijaya and Empu Manikgeni, Gedong Tumpang Siki (one), two and three, Manjangan Saluang, Sanggar Agung, Bale Pawedaan, and Bale Pesandekan.</li>\n<li class=\"mb-2\"><strong>Puncak Bisbis Lempuyang</strong>: The fifth temple to visit is Puncak Bisbis Lempuyang Temple, which is a temple located in the Bisbis hill area, and Hindus pray here before heading to the top of Lempuyang Luhur, this place is often used as a resting place for Hindus, they will rest here for a moment while enjoying the very beautiful view with expanse of green forest, cool air and cool atmosphere making this place ideal for resting before continuing to the next temple.</li>\n<li class=\"mb-2\"><strong>Pasar Agung Lempuyang Temple</strong>: The sixth temple to visit is Pasar Agung Lempuyang Temple which is located in the middle of Bisbis Hill or precisely under Lempuyang Luhur Temple. It is a holy area where many Hindus will pray here before heading to Lempuyang Luhur Temple. With very beautiful and natural views around it, the atmosphere is very cool.</li>\n<li class=\"mb-2\"><strong>Lempuyang Luhur Temple</strong>: The seventh or last temple to visit is Lempuyang Luhur Temple. This temple is the most sacred and is located at the top of Bisbis Hill at an altitude of 1,174 meters above sea level. To reach this place you need very good stamina because you will climbing 1700 steps, along the way you can enjoy the natural, cool views and see several groups of monkeys in this place. Hindus believe that the one who resides at Lempuyang Luhur Temple is Dewa Iswara, namely the manifestation of Ida Sang Hyang Widhi Wasa as the ruler of the east.</li>\n\n</ol>\n\n<p class=\"text-justify mb-3\">These are some of the temples in the Lempuyang Temple area where Hindus who want to pray at Lempuyang Luhur Temple will pray at several temples on the way to the top, while some go straight to the top if they have urgent needs. To get to the top you are required to have very good stamina, because you will go through a lot of stairs calculated at around 1700 steps to reach the top. <strong>But if you just want to take photos at the gate of heaven, you don't need to climb the 1700 steps, because the location of the gate of heaven is at Penataran Agung Lempuyang Temple, where access is very easy and doesn't take many stairs</strong>, where you will take a shuttle bus to get there. Go to Penataran Agung Lempuyang Temple and walk a little to get to the location. Here you will see many tourists queuing to take photos at the Gate of Heaven, so it is recommended to come early if you don't want to queue for a long time.</p>\n</span>\n\n<span id=\"gate-of-heaven\">\n<h3 class=\"font-small\">Why is Called Gate of Heaven</h3>\n<p class=\"text-justify\">Regarding <a href=\"https://www.baligoldentour.com/lempuyang-temple.php\" title=\"Lempuyang Temple\">Lempuyang Temple</a>, which is said to be the gate of heaven, it is from the tourists who come here and take pictures at the gate with the background of Mount Agung, and the resulting photos are so beautiful and very instagrammable, and the tourists say that this is the Gate of Heaven, where the mountain in Bali has a high status and is purified. Take pictures at the gate with Balinese carvings that are very beautiful, and if the weather is very clear you can see Mount Agung as the largest mountain on the island of Bali very clearly and the resulting photos will also be very beautiful. The photos are booming on social media and many tourists flock here and are curious about the gate at this lempuyang temple. No wonder this Lempuyang Temple deserves the nickname as the Gate of Heaven, and also until now Lempuyang Temple is always crowded with tourists who are curious about this heaven's gate and want to capture this rare moment when visiting Lempuyang Temple. if you want to visit this place, can take our tour packages of <a href=\"https://www.baligoldentour.com/bali-lempuyang-tour.php\" title=\"Bali Lempuyang Tour\">Bali Lempuyang Tour</a> with cheap price and amazing services.</p>\n</span>\n<span id=\"gate-of-heaven-effect\">\n<h3 class=\"font-small\">Gate of Heaven Photo Effect</h3>\n<p class=\"text-justify\">As for the Lempuyang Temple, when taking pictures at the gates of heaven, the photos are very beautiful with shadows making the photos very fantastic. If you think this is a pool of water reflecting shadows when photographed, you are mistaken, it is actually a dark colored mirror affixed under your camera, and when you are photographed it produces a very nice effect. Because this photo effect makes the photos so fantastic, it's not wrong to call it Heaven's Gate. Because there is only one heaven gate, so to take pictures you have to queue, because every day tourists are always full in this place, if you come here we suggest leaving in the morning and in the morning this place is not so crowded with tourists, so you can quickly get a turn to take pictures at the gates of paradise which is phenomenal in eastern Bali</p>\n</span>\n<span id=\"spot-photo-lempuyang\">\n<h3 class=\"font-small\">Spot Photo at Lempuyang Temple</h3>\n<p class=\"text-justify\">Lempuyang Temple famous with the amazing view of mount agung, lot of tourist take picture in the gate of lempuyang temple with background mount agung view. Is really spectacular view offered in <a href=\"https://www.baligoldentour.com/lempuyang-temple.php\" title=\"Lempuyang Temple\">Lempuyang Temple</a>. The name of Gate of Heaven is come from the tourist that taking picture in the gate of lempuyang temple with beauty mount agung view as background. because of the beautiful scenery, guests call it a view of heaven and a place to take photos at the gate of the temple of Tempuyang. So most guests call this place the gate of heaven. The photo spots found in lempuyang are, taking pictures at the gates of heaven which are located in the Penataran Agung of lempuyang Temple, and with a very beautiful mount agung background, here there is a photo service using your cellphone using a mirror placed under the cellphone, so it looks like there is a water effect in the photo, the location of the photo spot is a circle made of rattan, where you can sit in the middle of the circle and with the same background, namely Mount Agung which is very charming and will certainly make the photos very instagrammable, the location of the lotus photo spot, where there is a pond and in the middle there is a lotus made of concrete and there are statues left and right with a beautiful majestic mountain background, you can sit on the lotus and take pictures with a beautiful background. This photo spot makes lempuyang which is very often visited because the photos are very instagramable</p>\n<div class=\"row\">\n<div class=\"col-md-4\"><img src=\"images/bali-tours-packages/bali-lempuyang-1.jpg\" alt=\"Lempuyang Temple | Gate of Heaven | Bali Golden Tour\" width=\"370\" height=\"250\" class=\"full-width mb-3\" title=\"Lempuyang Temple | Gate of Heaven | Bali Golden Tour\"></div>\n<div class=\"col-md-4\"><img src=\"images/bali-tours-packages/bali-lempuyang-2.jpg\" alt=\"Lempuyang Temple | Lempuyang Temple Spot Photo | Bali Golden Tour\" width=\"370\" height=\"250\" class=\"full-width mb-3\" title=\"Lempuyang Temple | Lempuyang Temple Spot Photo | Bali Golden Tour\"></div>\n<div class=\"col-md-4\"><img src=\"images/bali-tours-packages/bali-lempuyang-3.jpg\" alt=\"Lempuyang Temple | Lempuyang Temple Spot Photo | Bali Golden Tour\" width=\"370\" height=\"250\" class=\"full-width mb-3\" title=\"Lempuyang Temple | Lempuyang Temple Spot Photo | Bali Golden Tour\"> </div>\n</div>\n</span>\n\n\n<span id=\"facilities-lempuyang\">\n<h3 class=\"font-small\">Facilities at Lempuyang Temple</h3>\n<p class=\"text-justify\">As a very famous tourist attraction in eastern Bali, Lempuyang Temple has very complete facilities, from the toilet, the provision of free sarong which is included in the entrance ticket, there is a snack and beverage shop near Lempuyang Temple. In addition, from the parking area you cannot go directly to the Penataran Lempuyang Temple, but you have to take the shuttle bus provided here, because the road to Lempuyang Temple is very steep and winding, so to avoid accidents due to the heavy traffic flow on the road to Lempuyang, there is a parking area and a shuttle bus that you can use, of course there are costs incurred if you use this shuttle bus. If you vacation on the island of Bali can take our <a href=\"https://www.baligoldentour.com/bali-lempuyang-tour.php\" title=\"Bali Gate of Heaven Tour\">Bali Gate of Heaven Tour</a>, it's incomplete if you don't visit this lempuyang temple which is <strong>the Gate of Heaven on the island of Bali</strong></p>\n</span>"
]