[
  "<h1><a href=\"https://www.baligoldentour.com/barong-dance.php\" title=\"BARONG AND KERIS DANCE\">BARONG AND KERIS DANCE</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/barong-dance.php\" title=\"BARONG AND KRIS DANCE IS BALINESE DANCE STORY ABOUT THE FIGHT BETWEEN BARONG AS A GOOD SPIRIT WITH RANGDA AS A BAD SPIRIT\">BARONG AND KERIS  DANCE IS BALINESE DANCE STORY ABOUT THE FIGHT BETWEEN BARONG AS A GOOD SPIRIT WITH RANGDA AS A BAD SPIRIT</a></h2>\n<a href=\"https://www.baligoldentour.com/barong-dance.php\"><img src=\"images/bali-information-site/barong-dance-bali-golden-tour.jpg\" alt=\"BARONG DANCE | KRIS DANCE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"BARONG DANCE | KRIS DANCE | BALI GOLDEN TOUR\"></a>\n\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/barong-dance.php\" title=\"Barong and Keris Dance\"><strong>Barong and Keris Dance</strong></a> is a traditional Balinese dance performance that tells the story of an endless battle where the fight between Barong who represents the good character and Rangda who represents the evil character, where in this story the barong wins the battle. In addition, in this dance performance there is a trance dance attraction where the dancer will stab a dagger in his body and uniquely his body is not injured at all. A dance performance that is full of meaning and inspires our lives where we are taught to behave well to fellow human beings in order to create harmony in living this life. <strong>Barong</strong> is a character in the mythology of Bali. He is the king of the spirits, leader of the hosts of good, and enemy of Rangda in the mythological traditions of Bali. Banas Pati Rajah is the fourth brotheror spirit child that accompanies a child throughout life. Banas Pati Rajah is the spirit which animates Barong. A protector spirit, he is often represented by a lion, and traditional performances of his struggles against Rangda are popular parts of Balinese culture. The Barong Dance is often portraited with two monkeys</p>\n  <p class=\"text-justify mb-2\"><strong>Here all you need to know about Barong and Keris Dance</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#what-is-barong\">What is Barong?</a></li>\n<li><a href=\"#types-barong\">Types of Barong</a></li>\n<li><a href=\"#barong-keket\">Barong Keket</a></li>\n<li><a href=\"#what-is-rangda\">What is Rangda?</a></li>\n<li><a href=\"#barong-keris-dance\">Barong and Keris Dance</a></li>\n<li><a href=\"#dance-story\">Dance Story of Barong and Kris Dance</a></li>\n<li><a href=\"#reflection\">Dance Story Reflection of Daily Life</a></li>\n<li><a href=\"#location\">Location of Barong and Keris Dance</a></li>\n</ul>\n<span id=\"what-is-barong\">\n<h3 class=\"font-small\">What is Barong?</h3>\n<p class=\"text-justify\">Barong is a mythological character whose aim is to protect Bali from all kinds of evil disturbances that threaten the island of Bali. The barong is depicted in various forms of worshiped animal guises such as lions, tigers, wild boars, buffalo, elephants, or dogs. Barong has emerged as part of Javanese and Balinese culture since people still believe in animistic beliefs. And in Bali the shape of the barong character is like a mixed animal face with a scary but good character. Made in such a way that it can create a religious feel when you see it. Barong bali originated as a development of barong ponorogo or Reog, which King Airlangga brought when he fled to the island of Bali to save himself. Besides Barong Ponorogo, Airlangga also brought other forms of literary art, Javanese script, and religious rituals. This influence can be seen from the shape of the ponorogo barong when it appears without using a peacock crown.</p>\n</span>\n<span id=\"types-barong\">\n<h3 class=\"font-small\">Types of Barong</h3>\n<p class=\"text-justify\">The types of barong in Bali are very diverse with different looks and functions, and not just any dancer is performed because it takes enough practice to be able to perform this barong dance professionally. The types of barong found in Bali are Barong Ket, Barong Bangkal, Barong Landung, Barong Macan, Barong Gajah, Barong Asu, Barong Brutuk, Barong Lembu, Barong Kedingkling, Barong Kambing and Barong Gagombrangan. The types of barong take the form of animals such as elephants, dogs, goats, oxen and others with four legs. Where the barong is performed by two people, one person holds the head and one person holds the tail, if you have ever seen the Barong Sai dance from China, then the barong dance in Bali is somewhat similar to that, the only difference is that Balinese dance is performed with a typical dance technique. Bali is more prominent without doing attractions like those in barong sai. The type of barong that we often see in <a href=\"https://www.baligoldentour.com/barong-dance.php\" title=\"Barong and Keris Dance\">Barong and Keris Dance</a> is the type of <strong>Barong Ketket</strong>. This show is performed by dancers who have been trained and performed very well with a comedy spice, making the audience of this barong dance happy and carried away by the storyline that was delivered.</p>\n  </span>\n  <span id=\"barong-keket\">\n  <h3 class=\"font-small\">Barong Keket</h3>\n  <p class=\"text-justify\">Barong Ket or Barong keket which is played in this <a href=\"https://www.baligoldentour.com/barong-dance.php\" title=\"Barong and Keris Dance Performance\">Barong and Keris Dance Performance</a>, which takes the form of a combination of lion, tiger, cow and dragon that produces the barong face that you can see today, with a touch of traditional Balinese carvings that creates a mystical and mystical atmosphere. full of spiritual aura when he saw it. As a good character which in mythology is symbolized as Banaspati the king who is the king of all spirits. The mask of this barong keket does not arbitrarily take wood to be used as a barong mask, but rather chooses certain trees such as the Pule tree that grows in the grave area because it is believed that the Pule tree is considered easy to invite demons. And if you take material from the grave, it is believed that it will bring a mystical aura inside this barong mask. In the barong keket dance performance, two people in the front, named Juru Saluk, hold the head and dance, and those in the tail, named Juru Bapang and dancers, must be in harmony so that they can create a very beautiful movement when seen. The feathers of this barong keket are made from perasok (leaf fiber of a type of pandanus and palm fiber), and some replace the feathers with crow feathers. Barong keket as a mythological creature from the island of Bali who is good at protecting the island of Bali from all threats of negative things</p>\n    </span>\n    <span id=\"what-is-rangda\">\n    <h3 class=\"font-small\"> What is Rangda?</h3>\n    <p class=\"text-justify\">Rangda is a mythological creature from Bali which has an evil character which is told with a frightening appearance and often kidnaps and eats small children and is considered to be the embodiment of Goddess Durga. The name Rangda comes from the ancient Javanese language which means \"widow\" and in the past the name Widow was found in the Vaisya, Kshatriya and Brahmin castes, while from the lower caste, the Sudra caste, it was not called the Widow but by the name Balu. So it can be concluded that Rangda came from a caste and most likely Rangda came from queen Mahendradatta who lived on the island of Java in the 11th century. He was exiled by the king of Dharmodayana because he was accused of committing witchcraft against the consort of the two kings. According to legend he took revenge by killing half the kingdom, which later became his and the property of Dharmodayana's son, Erlangga. Then he was replaced by a wise man. The form of Rangda is manifested in a very scary form as a woman with long disheveled hair and has long nails, a long protruding tongue, and long breasts. His face was terrifying and had long, sharp fangs.</p>\n    </span>\n    <div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/barong-dance.php\"><img src=\"images/bali-information-site/barong-dance-1.jpg\" alt=\"Barong Keket | Bali Travel Information | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width\" title=\"Barong Keket | Bali Travel Information | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Barong Keket</p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/barong-dance.php\"><img src=\"images/bali-information-site/barong-dance-2.jpg\" alt=\"Rangda | Bali Travel Information | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width\" title=\"Rangda | Bali Travel Information | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Rangda</p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/barong-dance.php\"><img src=\"images/bali-information-site/barong-dance-3.jpg\" alt=\"Dancer | Bali Travel Information | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width\" title=\"Dancer | Bali Travel Information | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Dancer</p></div>\n</div>\n    <span id=\"barong-keris-dance\">\n    <h3 class=\"font-small\">Barong and Keris Dance</h3>\n    <p class=\"text-justify\">The barong and keris dances are traditional Balinese dances that depict the battle between Barong as a good character and Rangda as an evil character, which is often shown to tourists as one of the cultural attractions that always amazes us. At first the barong and keris dance was a dance in a religious ceremony known as Calonarang, which was performed only on the day the ceremony was held and also performed in various religious rituals. Over time, making this barong and keris dance began to be performed as a cultural attraction, from the first stage the appreciation from tourists was very good, so many dance studios opened this barong dance performance in various strategic places, most of which you can see here at Batubulan area. A dance show that is very famous and is only performed in the morning. With a storyline that is narrated from the story of the barong and rangda battles taken from the Calonarang story, which used to be often staged when there were religious ceremonies. Barong and Kris dance like the <a href=\"https://www.baligoldentour.com/kecak-dance.php\" title=\"Kecak Dance\">Kecak Dance</a> the <strong>Barong and Kris dance is a battle between good and evil spirit</strong>. Barong can take various forms but in this dance he takes the form of the dance Barong Keket, the most holy of the Barongs. The Barong Keket is a strange creature, half shaggy dog, half lion and is played by two men in much    the same way as a circus clown-horse. His opponent is the witch Rangda. </p>\n      </span>\n\n      <span id=\"dance-story\">\n<h3 class=\"font-small\">Dance Story of Barong and Kris Dance</h3>\n<p class=\"text-justify\">The fight between Barong and Rangda is also the topic of traditional narratives, usually performed in the temple of the dead. The most famous is the story of Calonarang, a widow from Jirah who is furious because she cannot find a suitable husband for her daughter Ratna Manggali. All the eligible young men are scared of her black magic, so she gets revenge by wreaking havoc over the kingdom of Daha. The king, Erlangga, tries to punish her, but all his attempts fail. She kills all the soldiers he sends to destroy her. Then Rangda decides to destroy Daha. She summons all her disciples and in the still of night they go to the Setra Gendrainayu cemetery, to present offerings of dead flesh to Durga, the goddess of death. Durga agrees to the destruction, although she warns the witch not to enter the city of Daha. But the witch does not heed Durga's advice and the kingdom is soon hit by grubug (a plague) and the villages quickly become cemeteries, people dying even before they can bury their dead. </p>\n<p class=\"text-justify\">Corpses are scattered everywhere and the stench is unbearable.The only person who can defeat the witch is Mpu Bharadah. At the king's request, Bharadah sends his disciple Bahula to steal Calonarang's magic weapon.images/banaspati.jpg&gt;Bahula pretends to ask for Ratna Manggali's hand in marriage, and while the witch is away, Bahula steals the magic weapon with the help of Ratna Manggali. Then he gives the stolen weapon to his teacher Bharadah. The weapon turns out to be a manuscript containing the key to ultimate release (mokswhich has been used upside-down by Calonarang. Bharadah goes to Daha to challenge the witch. With the help of the Barong, she is defeated. Before being killed, she asks to be released from her curse and purified. The story goes that Rangda, the mother of Erlangga, the King of Bali in the tenth century, was condemned by Erlangga's father because she practiced black magic. After she became a widow, she summoned all the evil spirits in the jungle, the leaks and the demons, to come after Erlangga. A fight occurred, but she and her black magic troops were too strong that Erlangga had to ask for the help of Barong. Barong came with Erlangga's soldiers, and fight ensued. Rangda casted a spell that made Erlangga soldiers all wanted to kill themselves, pointing their poisoned keris into their own stomachs and chests. Barong casted a spell that turned their body resistant to the sharp keris. At the end, Barong won, and Rangda ran away.</p>\n</span>\n<span id=\"reflection\">\n<h3 class=\"font-small\">Dance Story Reflection of Daily Life</h3>\n<p class=\"text-justify\">Barong Dance is one of the distinctive arts community of Bali, where Barong it self is symbolic of goodness with shape like a lion. in Barong dance it tells the story about battle between Barong and Rangda, Rangda is a symbolic of badness with shape like a giant with a big canine. Both of them is a <strong>reflection of human action in daily life with the good and bad behavior</strong>, or in Balinese it's call Dharma and Adharma. Barong is like a doll which being moved by person inside it, Barong is very heavy, this dance usually performed by two big mans that lift and moving the barong from the inside. Somebody can die or get seriously injured in a Barong dance. It is said that if Rangda's spell is too strong, a weak soldier may not be able to resist it, even with the help of Barong. He may end up hurting himself with his own keris. The masks of Barong and Rangda are considered sacred items, and before they are brought out, a priest must be present to offer blessings by sprinkling them with holy water taken from Mount Agung, and offerrings must be presented. Barong is probably the most well known dance. It is also another story telling dance, narrating the fight between good and evil. This dance is the classic example of Balinese way of acting out mythology, resulting in myth and history being blended into one reality.</p>\n</span>\n<span id=\"location\">\n<h3 class=\"font-small\">Location of Barong and Keris Dance</h3>\n<p class=\"text-justify\">As for the location of the barong dance performances, most of them are located in Batubulan Village, Gianyar Bali. It is very easy to find because it is located on the main road to Ubud village. One of the famous and popular barong and keris performances is Sahadewa Barong &amp; Kecak Fire Dance which is located on Jl. Puseh Temple, Batubulan, Kec. Sukawati, Gianyar Regency, Bali 80582. You can use google map to get to this place, if from Kuta it will take about 60 minutes drive and if from Ubud about 30 minutes drive. You can take the <a href=\"https://www.baligoldentour.com/bali-ubud-tours.php\" title=\"Full Day Ubud Tour\">Full Day Ubud Tour</a> package which focuses on visiting tourist attractions in Ubud and you can also take the <a href=\"https://www.baligoldentour.com/bali-ubud-kintamani-tour.php\" title=\"Ubud and Kintamani Tour\">Ubud and Kintamani Tour</a> packages that combine tourist attractions in Ubud and Kintamani in one day. If you want to be flexible you can rent a driver and a car for a day at a low price and the service is very satisfying, accompanied by a friendly and experienced driver will make the trip to <a href=\"https://www.baligoldentour.com/barong-dance.php\" title=\"Barong and Keris Dance Performance\">Barong and Keris Dance Performance</a> very enjoyable  </p>\n</span>"
]