[
  "<h1><a href=\"https://www.baligoldentour.com/besakih-temple.php\" title=\"BALI BESAKIH TEMPLE\">BALI BESAKIH TEMPLE</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/besakih-temple.php\" title=\"BALI BESAKIH TEMPLE IS A MOTHER TEMPLES IN THE ISLAND OF BALI\">BALI BESAKIH TEMPLE IS THE BIGGEST HINDU TEMPLE AND ALSO AS A MOTHER TEMPLES IN THE ISLAND OF BALI</a></h2>\n<a href=\"https://www.baligoldentour.com/besakih-temple.php\"><img src=\"images/bali-interest-place/besakih-temple-bali-golden-tour.jpg\" alt=\"BESAKIH TEMPLE | BALI MOTHER TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"BESAKIH TEMPLE | BALI MOTHER TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n\n<p class=\"text-justify\"><strong><a href=\"https://www.baligoldentour.com/besakih-temple.php\" title=\"Bali Besakih Temple\">Bali Besakih Temple</a></strong> is the biggest Hindu temple in Bali which the local people call <strong>Pura Besakih</strong><em>.</em> It owns beautiful view from the top of temple area where we can see the wide nature panorama until to  the ocean so that way this temple is many visited by tourists from all over the  world. Besakih Temple is located in Besakih countryside, Rendang sub district, Karangasem regency, east part of the island. It is located in southwest side  bevel of mount Agung, the biggest mounts in Bali. It is because pursuant to Agung Mount confidence is holiest and highest mount in Bali Island. The very largest temple on the island of Bali and always crowded by tourists who want to see the uniqueness and majesty of the largest temple on the island of Bali. If you like religious tourism, then visiting Besakih Temple is the right thing, where here you make sense to see a row of temples that are never deserted by pilgrims who want to pray here.</p>\n<p class=\"text-justify mb-2\"><strong>All you need to know about Besakih Temple</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#mother-temple\">Mother Temple of Bali</a></li>\n<li><a href=\"#history-besakih\">Besakih Temple History</a></li>\n<li><a href=\"#meaning-name-besakih\">Meaning Name of Besakih</a></li>\n<li><a href=\"#center-temple-besakih\">Besakih is Center of Temple in Bali</a></li>\n<li><a href=\"#basukihan\">Basukihan Temple at Besakih Temple</a></li>\n<li><a href=\"#panca-dewata-besakih\">Panca Dewata Besakih Temple</a></li>\n<li><a href=\"#besakih-geograhically\">Besakih Temple Geographically</a></li>\n<li><a href=\"#location-besakih\">Besakih Temple Location</a></li>\n<li><a href=\"#dress-code\">Besakih Temple Dress Code</a></li>\n<li><a href=\"#facilities\">Besakih Temple Facilities</a></li>\n</ul>\n<span id=\"mother-temple\">\n<h3 class=\"font-small\">Mother Temple of Bali</h3>\n<p class=\"text-justify\">Why is it called the mother of temples in Bali, because the complex of the Besakih temple is very large and very wide and there are many small temples in it, being one of the largest temples and the most temples in it, so it can be said to be the mother of the temple. on the island of Bali. Bali’s “mother temple”, Besakih temple, is over 900 metres up the slopes of Gunung Agung. It has been regarded as a holy place  since pre-historic times in Bali. The first recorded mention of its existence is from an inscription that dates from 1007 A.D. Since the Gelgel dynasty of  the fifteenth century it has been regarded as a central, holy temple for the entire island. All the allegiances of the Balinese people  come together at Besakih. Each regency has its own temple within the over-all compound, as do each of the caste groups. There is a total of 18 separate  sanctuaries. The three main temples are : Pura Penataran Agung, Dedicated to Sang Hyang Widi Wasa : Pura Kiduling Kreteg, dedicated to Brahma; and Pura Batu  Madeg, dedicated to Wisnu. To the Balinese a visit to the temple  sanctuaries at Besakih temple is a special pilgrimage. Each temple has its own odalan, or anniversary celebration, and on the full moon of the Balinese month “Kedasa” the entire compound of Besakih celebrates the visit of the gods, with an  enormous throng of visiting pilgrims.</p>\n</span>\n\n<h3 class=\"font-small\">Besakih Temple History</h3>\n<p class=\"text-justify\">Regarding the history of the Besakih Temple, there are several versions that tell about the history of this Besakih Temple, because the Besakih Temple is classified as very old, so research must still be carried out for history. Because in the Besakih Temple complex there are many relics of the megalithic era, such as menhirs, stone thrones, and pyramid terrace structures. These relics show that Pura Besakih comes from a very old age, long before the influence of Hinduism. Based on the stories circulating in the community and existing research, it can be explained about the history of besakih from several versions, including the following:</p>\n<ol class=\"mb-4\">\n<li><h3 class=\"font-small\">Besakih Temple History Based on Rsi Markandeya</h3>\n<p class=\"text-justify\">History Besakih Temple based on Rsi Markandeya : It started in 1284 where there was a rsi of Indian Hindu with name Rsi Markandeya descent who was a religious leader of Indian descent. Once he was meditating in the Dieng plateau and then he received a revelation to build the Besakih Temple. Then Rsi Markandeya went to the island of Bali through the forest in Java. According to the revelation heard and seen, Rsi Markandeya came to Bali by crossing the Segara Rupek (Bali Strait), the Rsi was accompanied by 8000 followers, the journey went straight to Mount Toh Langkir (now Mount Agung), to the slopes of the mountain which was still forested. In the wilderness, the sage and his followers began clearing the forest to clear land for agriculture. But his mission failed because many of his followers died of illness, mysterious events and were eaten by wild animals. As a yogi and ascetic, he knew that there was a mysterious power or aura that ruled the island. Finally he returned to Mount Dieng to meditate and ask for directions <br>\nThen he got a revelation by bringing 400 people from the village of Aga who are residents of the foot of Mount Raung. But before starting the work, he performs ritual ceremonies such as mecaru and plants 5 metal elements or five Datu including gold, silver, copper, bronze, iron, and is accompanied by Mirah Adi (main gem), so that they are safe in doing their work in the forest on the slopes. Holy mountain. And it turns out that in carrying out the work of encroaching on the forest there are no more disasters. Perhaps this is the basis of Hindus today, always perform a yadnya ceremony before opening a new land, be it for a house, rice field or moor, and for a temple to plant the five elements of Panca Datu metal.<br>\nAfter that he distributed land to his followers to be used as rice fields, plantations and houses. When Rsi Markandeya was on Mount Toh langkir (mountain agung) he saw that the island of Dawa (now the island of Bali) was not that big, so he replaced it with the name Wali Island which is now the island of Bali, where the word \"wali\" (Palawa language) from South India) which means sacred offerings, then at present the offerings or sacred ceremonies are known in the form of offerings which are brought by the people to the temple when they pray.<br>\nFurthermore, the Toh Langkir area was developed by him and was given the name Besuki which later changed to the name Basuki which means safe. Meanwhile, the place where Rsi Markandeya performed the offering ceremony and planted the 5 metal elements (Panca Datu) was known as Besakih Temple. Initially from a shrine, then a temple called Besukian was built, then the temple continued to grow, the construction was carried out in stages, so that it became the largest temple complex which is now known as Pura Besakih.</p></li>\n<li><h3 class=\"font-small\">Besakih Temple History Based on Sri Kesari Warmadewa</h3>\n<p class=\"text-justify\">History Besakih Temple based on Sri Kesari Warmadewa is the founder of the Warmadewa dynasty which ruled Bali for several centuries, believed to be the first founder of the temple complex in Besakih. This can be seen from the inscription at 914 CE the Belanjong pillar (\"Blanjong Inscription\") in southern Sanur and the Penempahan inscription, and the Malet Gede inscription (835 Saka)9 which tells of Sri Kesari being a Buddhist king from the Syailendra dynasty who led a military expedition and to build a dynasty in Bali. As for the three inscriptions found if there is a similarity in the connection from Bali with the Sanjaya Dynasty in Central Java. <br>\nThis is a date according to the Indian Saka calendar. Another thing that attracts attention is that the three inscriptions essentially describe the victory of King Sri Kesari against his enemies. As a result of the obsolescence of the inscriptions, only two of the enemies can be identified, namely in the Desert and in Suwal. It should be added that the location of Gurun and Suwal is not yet known with certainty. Among experts, some argue that the Desert may be the same as today's Lombok. Another opinion states that the Desert may be synonymous with Nusa Penida. <br>\nSri Kesari Warmadewa is known to be very diligent in worshiping to worship the gods who reside on Mount Agung. His place of worship is called Merajan Selonding or Merajan Kesari Warmadewa. As for him, it was he who carried out the expansion of the Penataran Agung Besakih temple which was once very simple and built the temples in Besakih to complement the existing sacred buildings including: Pura Gelap to worship Lord Iswara, Pura Kiduling Kreteg to worship Lord Brahma, Pura Ulun Kulkul to worship God. God Mahadewa, Pura Batumadeg to worship Lord Vishnu, Pura Dalem Puri to worship Goddess Durga, Pura Basukihan to glorify Naga Basukihan. It was he who ordered the people to celebrate Nyepi on Sasih Kesanga.</p></li>\n</ol>\n<div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/besakih-temple.php\"><img src=\"images/bali-interest-place/besakih-temple-1.jpg\" alt=\"Besakih Temple | Mother Temple | Bali Golden Tour\" width=\"500\" height=\"250\" class=\"full-width mb-3\" title=\"Besakih Temple | Mother Temple | Bali Golden Tour\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/besakih-temple.php\"><img src=\"images/bali-interest-place/besakih-temple-2.jpg\" alt=\"Besakih Temple | Mother Temple | Bali Golden Tour\" width=\"500\" height=\"250\" class=\"full-width mb-3\" title=\"Besakih Temple | Mother Temple | Bali Golden Tour\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/besakih-temple.php\"><img src=\"images/bali-interest-place/besakih-temple-3.jpg\" alt=\"Besakih Temple | Mother Temple | Bali Golden Tour\" width=\"500\" height=\"250\" class=\"full-width mb-3\" title=\"Besakih Temple | Mother Temple | Bali Golden Tour\"></a></div>\n</div>\n<span id=\"meaning-name-besakih\">\n<h3 class=\"font-small\">Meaning Name of Besakih</h3>\n<p class=\"text-justify\">The Besakih's name is come from the word of Basuki, the old language from Sanskrit Wasuki, and then it become the Ancient Java Language. In this Sanskrit, the Basuki means congratulation. In mythology of Samudramanthana has mentioned that Basuki is a dragon that twines the Mount Mandara. The omission has come from tradition megalithic which had  been indicated that it had to be sanctified place. It seems, the Besakih temple is  coming from very old era which is far before the existence of Hinduism influence. Hereinafter, an Ancient Bali king of Sri Kesari Warmadewa found the  Merajan Selonding Temple in this temple complex area. He also commands to build  the Blanjong Monument that is located in Sanur Village. The Besakih Temple complex is built pursuant to  cosmos balance. It is based on the nature conception which is disseminating the fundamental temple complex that is arranged to pursuant of the way direction. So, this building can deputize nature as symbolic of the world balance existence.</p>\n\n</span>\n<span id=\"basukihan\">\n<h3 class=\"font-small\">Basukihan Temple at Besakih</h3>\n<p class=\"text-justify\">Besakih temple is not only one temple there, besakih is called a temple complex, in which there is another temple, so besakih is said to be the largest temple on the island of Bali, where there are many supporting temples underneath which there are very many. In addition to the Panca Dewata temple which maintains the cardinal directions of the universe, there is also a main temple called the Basukihan temple and better known as the Besakih Temple. Located at the foot of the Penataran Agung Besakih Temple, on the right if we are going to climb the steps of the Penataran Agung Temple, there is a temple whose main pelinggih is meru tumpang pitu (level seven). This temple is named Pura Basukihan in which place according to the estimates of the Sulinggih. The Besakihan temple is the main temple of the temple complex in Besakih and according to sources from the priest here, Danghyang Markandeya planted Pancadatu Pedagingan (five types of metal with complete rituals) at Basukihan Temple, Penataran Agung Temple and Dalem Puri Temple is the mother of Kahyangan. Three in the villages namely Puseh temple, Desa temple and Dalem temple. From the most advanced equipment contained in each of the temples, as well as religious literature related to the procedures for building a temple, it appears that the Basukihan temple is the Puseh Jagat temple, Penataran Agung Temple functions as a Jagat Village temple and a Pura Pura Penataran Agung. Dalem Puri as the Dalem Jagat temple. Thus Basukihan Temple, Penataran Agung Temple and Dalem Puri Temple are the center and all Puseh temples, Desa temples and Dalem temples are located anywhere, so that Besakih temple as a whole is a Penyungsung Jagat temple. What is held in this temple is Hyang Naga Basuki. Piodalan day falls on the day of Buda Wage Kelawu or Buddha Cemeng Kelawu.</p>\n</span>\n<span id=\"panca-dewata-besakih\">\n<h3 class=\"font-small\">Panca Dewata Temple at Besakih Temple</h3>\n<p class=\"text-justify\">What is meant as the Panca Dewata here is a god who resides in the direction of the wind which aims to protect the universe from all directions, as for the cardinal directions such as East, South, West, North and Central, which have their respective roles and functions. The Panca Dewata is a manifestation of Lord Shiva whose job is to maintain the cardinal directions of the universe and the Penataran Agung Temple is the center. Here we explain about the temples in Besakih Temple which are included as the five gods wind guardian direction of Besakih Temple, there are 5 temples that function and have different roles according to the direction of the wind.</p>\n<ol class=\"mb-3\">\n  <li class=\"text-justify mb-2\"><strong>East</strong>: Pura Gelap is located in the east and functions as the worship of God in its manifestation as Bhatara Iswara who is in charge of protecting the east direction of the universe or Bhuwana Agung. The origin of the word dark does not mean dark in the true sense, but this dark word comes from an ancient Balinese language called kawi language which means lightning or lightning with a blinding white light. Pura Gelap as a medium of worshiping God in its manifestation as Dewa Iswara, the god of light. This earth can be a vehicle for life because of the sun. This sunlight is the leader of other natural resources so that it functions to give life to the contents of this nature. As one of the pillars of the temple guarding in the east direction of the wind</li>\n  <li class=\"text-justify mb-2\"><strong>South</strong>: Pura Kiduling Kreteg is located in the south which functions as the worship of God in the form of its manifestation as Bhatara Brahma. In charge of guarding the southern direction of the universe, the name Kiduling kreteg is taken from the ancient Balinese language which means next to the bridge, and it is true that the location of the Kiduling kreteg temple is located next to the bridge of the Penataran Besakih Temple. One of the goals of worshiping God as Lord Brahma at the Kiduling Kreteg Temple is to guide Hindus to always develop their creative power in realizing Vedic truths in individual and social life and to maintain the spirit of life so that they can live on the path of Dharma. Symbolized in Pelinggih Meru Tumpang Eleven and is located in the far corner in the northeast of the area of ​​Pura Kiduling Kreteg and is often declared as the Ratu Cili Palace by the local community</li>\n  <li class=\"text-justify mb-2\"><strong>West</strong>: Ulun Kulkul Temple is located in the west which functions as a worship of God manifested as Hyang Mahadewa, and functions to guard the west direction where there is a large kulkul or kentongan in this temple. This temple was built during the time of King Sri Kesari Warmadewa, Isaka 835. At first this temple was a place of Kulkul (Kentongan). Because in this temple there is a large Kentongan whose material comes from silingui wood, so until now it is believed to be the origin of the kulkul in Bali. Based on the concept of belief like this, every village that will make Kulkul for the Kahyangan Tiga temple or pretend that is considered common by the community, at the time of release, ask for tirta at Ulun Kulkul. Furthermore, during the reign of King Sri Kesari Warmadewa, Ulun Kulkul Temple was believed to be a place to give birth to justice. So that the officials who were there at that time were carried out in this temple.</li>\n  <li class=\"text-justify mb-2\"><strong>North</strong>: Batumadeg Temple is located on the north side of the Penataran Besakih Temple which is one of the sublime ambals of this Besakih Temple, in the Batumadeg Temple area it is very wide and there is a pelinggih in it, as for when viewed from the shape of the temple it can be said that this temple is from ancient times. megalithic and this is confirmed by the presence of a large stone in the pelinggih Meru. The name madeg stone is called because in this temple there is an upright stone in Balinese which means standing upright which in archaeology is called menhir. Maged stone as a symbol of worship of Bathara Ida Ratu Saktu Watu Madeg as a manifestation of Ida Bhatara Vishnu in the Shiva pasu pata worship system. And the Menhirs are placed in Meru Tumpang Solas which can be seen when you visit this Batu Madeg temple, you will not be able to see directly, because the location of the menhirs is at inside of this Meru Tumpang Solas.</li>\n  <li class=\"text-justify mb-2\"><strong>Center</strong>: Penataran Besakih Temple is located in the center and is the largest temple of the existing temple group, which serves to worship God with his manifestation as Lord Shiva. Among all the temples included in the Besakih Temple complex. So Penataran Agung Temple is the largest, the most temple buildings, the most types of ceremonies and is the center and all temples in Besakih. In the Raja Purana Besakih it is said that the Penataran Agung Besakih Temple is the place of the Batara Kabeh Pesamuaning. One of the characteristics of Penataran Agung Temple is the presence of Padma Tiga. As a center for worshiping the Tri Purusa, namely Lord Shiva, Lord Sada Shiva, and Lord Parama Shiva. Then there is the pawedaan bale as a place for the sulinggih mapuja. Bale agung as a place for the walaka and sulinggih paruman.</li>\n</ol>\n\n<span id=\"besakih-geograhically\">\n<h3 class=\"font-small\">Besakih Temple Geographically</h3>\n<p class=\"text-justify\">The Besakih Temple as the largest temple on the island of Bali was built on an area of ​​20 hectares in the village of Rendang, Karangasem, Bali. With a land area of ​​20 hectares, 46 large and small temples are occupied in this Besakih temple complex. As for the large and small temples, they are divided into three parts, where the first part is called Penyungsungan Jagat Temple, there are 20 temples and the second part is Kawitan Temple which contains 17 temples and the third is Dadya Temple, there are 9 temples. Of all the complexes in Besakih Temple, Penataran Agung Temple is the center and the largest temple in the area. This temple consists of seven levels and statues of three main gods namely Lord Vishnu, Brahma, and Shiva. And in the Besakih temple area you can see stone age relics such as stone thrones and menhirs. In addition, the architecture of the temple building has a philosophy with odd tiered roofs 1, 3, 5, 7, 9, 11 which can symbolize prosperity. This temple complex also consists of several punden and is connected by about 800 steps. Although it looks tiring, but the beauty of the temple complex and the fresh air at the foot of the mountain will be an unforgettable experience.</p>\n</span>\n<span id=\"location-besakih\">\n<h3 class=\"font-small\">Besakih Temple Location</h3>\n<div class=\"row mb-4\">\n<div class=\"col-lg-8\">\n<p class=\"text-justify\">The location of the Besakih Temple is located in the eastern area of ​​​​the island of Bali, precisely close to Mount Agung, to reach the location it takes about 2 hours of driving to take 2 routes, where the first route is through <a href=\"https://www.baligoldentour.com/kintamani.php\" title=\"Kintamani Village\">Kintamani Village</a>, from Kintamani you will pass a direct road to Besakih, and the route The second can be through from Klungkung village where you will pass  <a href=\"https://www.baligoldentour.com/kerta-gosa.php\" title=\"Kerta Gosa\">Kerta Gosa</a>. You can use help from google map to reach the location of this Besakih temple. It is very easy to find because at every intersection there are directions that show the location of this Besakih temple. If you are confused and don't want to be dizzy, you can contact us <a href=\"https://www.baligoldentour.com\" title=\"Bali Tours\">Bali Tours</a> to take you to the location of this Besakih temple, with very cheap transportation prices and accompanied by a friendly Balinese driver will make the trip to Besakih Temple very enjoyable. If you are on vacation on the island of Bali, don't forget to visit the largest temple on the island of Bali.</p>\n</div>\n<div class=\"col-lg-4\">\n<iframe src=\"https://www.google.com/maps/embed?pb=!1m17!1m11!1m3!1d517378809.9213314!2d115.4509088551752!3d-8.373397986963163!2m2!1f0!2f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x2dd21cbe3748b2b7%3A0xbfc39798cd1bb4a!2sBesakih%20Great%20Temple!5e0!3m2!1sen!2sid!4v1659500615818!5m2!1sen!2sid\" class=\"full-width\" width=\"400\" height=\"250\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>\n</div>\n</div>\n\n</span>\n\n<span id=\"dress-code\">\n<h3 class=\"font-small\">Besakih Temple Dress Code</h3>\n<p class=\"text-justify\">To visit one of the holy and largest temples on the island of Bali, you should dress modestly and not dress revealingly, to respect the Hindus who will pray here. to visit Besakih you will be prepared to wear a kamen and a scarf for you to wear and this is included in the price of the entrance ticket from this Besakih temple, so you don't have to worry anymore to bring a sarong and scarf from your place, because here it is provided for sarong and scarf for enter the sacred area and to honor the people who pray here. So you don't need to hesitate anymore to visit one of the biggest temples on the island of Bali and is also often referred to as the mother of temple in Bali, by using a sarong and scarf you are already respecting the customs and traditions when visiting the holy temple on the island of Bali, and it is also hoped that if you visit come here to dress modestly and don't dress openly to respect the Hindus who pray here. If you are interested in the spiritual history of Bali, it would be nice to visit the largest temple on the island of Bali which is very well known abroad.</p>\n</span>\n<span id=\"facilities\">\n<h3 class=\"font-small\">Besakih Temple Facilities</h3>\n<p class=\"text-justify\">As a very popular tourist destination in the eastern area of ​​Besakih Temple, the facilities offered are very complete, from a very large parking lot, so it can accommodate many cars and buses, so you don't have to worry anymore if you come here and don't get parking. In the parking area there are many small stalls selling snacks and drinks that you can buy here if you are thirsty, and there are also toilet facilities that you can use if you come here and need to pee. The main facilities are very supportive and will make you feel comfortable when visiting this Besakih temple. In addition, other facilities are also available such as ticket counters and others in the Besakih area. Visiting the Besakih temple in Bali is very fun and knowing the history of the establishment of the oldest temple in Bali and the largest temple on the island of Bali, you can see many temples in this Besakih temple complex, so enjoy your day in exploring the beauty and uniqueness of this temple. this besakih temple</p>\n</span>\n</span>"
]