[
  "<h1><a href=\"https://www.baligoldentour.com/brahma-vihara-arama.php\" title=\"BRAHMA VIHARA ARAMA\">BRAHMA VIHARA ARAMA</a> </h1>\n<h2><a href=\"https://www.baligoldentour.com/brahma-vihara-arama.php\" title=\"BRAHMA VIHARA ARAMA IS BEAUTIFUL BUDHA TEMPLE IN NORTH OF BALI ISLANDS\">BRAHMA VIHARA ARAMA IS BEAUTIFUL BUDHA TEMPLE IN NORTH OF BALI ISLANDS</a></h2>\n<a href=\"https://www.baligoldentour.com/brahma-vihara-arama.php\"><img src=\"images/bali-interest-place/brahma-vihara-arama.jpg\" alt=\"BRAHMA VIHARA ARAMA | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"BRAHMA VIHARA ARAMA | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n\n\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/brahma-vihara-arama.php\" title=\"Brahma Vihara Arama\"><strong>Brahma Vihara Arama</strong></a> is the largest Buddhist monastery in Bali and this monastery is better known as the Banjar Buddhist Temple. Brahmavihara-Arama is located in the village of Banjar Tegeha which includes the Banjar sub-district, Buleleng regency and is located about 22 km west of Singaraja or 11 km from the tourist area of ​​Lovina. From the capital city of Denpasar to this monastery, it takes approximately two hours or about 100 km, via the Denpasar-Bedugul-Singaraja highway. Because it is located in a mountainous area, Brahmavihara-Arama has a calm and peaceful atmosphere so that it fits perfectly as a spiritual area location. The location is not so far from the famous Banjar Hot Springs is natural hot spring that very famous in north Bali Islands.</p>\n<p class=\"text-justify mb-2\"><strong>All you need to know Brahma Vihara Arama</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#location\">Location Brahma Vihara Arama</a></li>\n<li><a href=\"#history\">History Brahma Vihara Arama</a></li>\n<li><a href=\"#meaning-name\">Meaning name Brahma Vihara Arama</a></li>\n<li><a href=\"#uniqueness\">Uniqueness of Brahma Vihara Arama</a></li>\n<li><a href=\"#statues\">Budha Statues at Brahma Vihara Arama</a></li>\n</ul>\n\n<span id=\"location\">\n<h3 class=\"font-small\">Location Brahma Vihara Arama</h3>\n<p class=\"text-justify\">This temple is located in the hilly area of ​​Tegeha village with a quiet and calm atmosphere and can see a direct view of Lovina beach. In addition, not far from this monastery there are also tourist attractions Banjar Hot Springs. With the existence of these two attractions, the monastery is increasingly known and frequently visited by tourists, both foreign and domestic. Brahmavihara-Arama began to be established around 1969 and was completed in 1970. Whereas in 1973 it was only inaugurated as a Buddhist monastery. Previously there was a monastery located in the Banjar Hot Spring, which at that time had very limited 25 followers. The goal is diverse. Starting from the desire to meditate or just stop by. Especially because this place is close to Lovina Beach. Brahmavihara-Arama Buleleng is a historic temple on the Island of the Gods of Bali</p>\n</span>\n\n<span id=\"history\">\n<h3 class=\"font-small\">History Brahma Vihara Arama</h3>\n<p class=\"text-justify\">According to historical records, Brahmavihara Arama Banjar was built in the middle of the 20th century AD and precisely in 1960 it was still under construction and finally the building was finished in 1970. After that, it waited for 3 years and precisely in 1973 the Brahma Vihara Arama building was inaugurated. In the past, there was a monastery here but the building was not too big and at that time the followers were very few and it was estimated that there were only about 25 followers of Buddhism in the past and over time there were more and more Buddhist followers and this monastery was unable to accommodate the large number of followers there, so the the monastery administrator held a meeting with his fellow administrators and decided to build a bigger monastery and the decision was made to build it in Banjar Tegeha in Banjar Village which contained approximately 1 hectare of vacant land, and over time the Arama Vihara building was expanded to 4 hectares to be able to build Borobudur miniature here. And finally inaugurated and managed by the Girirakkhito Mahathera Foundation. And now Brahma Vihara Arama is one of the most frequently visited tourist attractions in the northern area of ​​the island of Bali</p>\n</span>\n<a href=\"https://www.baligoldentour.com/brahma-vihara-arama.php\"><img src=\"images/bali-interest-place/brahma-vihara-arama-1.jpg\" alt=\"BRAHMA VIHARA ARAMA | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"BRAHMA VIHARA ARAMA | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n<span id=\"meaning-name\">\n<h3 class=\"font-small\">Meaning name Brahma Vihara Arama</h3>\n<p class=\"text-justify\">Brahmavihara Arama consists of three words, namely: Brahma, Vihara and Arama. Brahma means great, very noble, commendable, noble. Vihara means a way of life, and Arama means place. It is often found that the word Vihara is given the same meaning as Arama, which is a place to live. From the meaning of the word, the meaning of Brahmavihara Arama is a place to train yourself, forge noble / commendable behavior which includes Metta, Karuna, Mudita and Upekkha. Giving the name Brahma Vihara by the late Bhante Girirakkhito as the Founding Father is very much in line with the goal of his establishment. Noble behavior which includes Metta, Karuna, Mudita and Upekkha. This can be explored, internalized, realized and practiced through the Vipassana Bhavana meditation path, because Brahma Vihara can also be used as an object of meditation. For this reason, Brahmavihara Arama was proclaimed by Bhante Girirakkhito as a place of meditation. We realize and believe that humans consist of Rupa and Names, namely body / body and mind, which are also referred to as Panca khanda. Panca khandha are five groups of life which consist of physical body / body (image), feeling, perception, mind and consciousness (Name) Panca khandha this is called life and life or commonly called human.</p>\n</span>\n<span id=\"uniqueness\">\n<h3 class=\"font-small\">Uniqueness of Brahma Vihara Arama</h3>\n<p class=\"text-justify\">Located in the highlands so that the natural environment is still very beautiful, cool, quiet and calm. The view seen in the distance is Lovina Beach with blue sea water. Because it is quiet and very comfortable, the location of Brahmavihara-Arama Buleleng is often used as a place of meditation. Especially for those who want to find a place to retreat and away from the hustle of the city. What is unique, although it is a place of worship for Buddhism, the building of Brahmavihara-Arama Buleleng does not leave the characteristics of Balinese architecture. Also built a mini Borobudur at the location of the monastery which is often used as objects of photographs of visitors to the monastery.</p>\n</span>\n<span id=\"statues\">\n<h3 class=\"font-small\">Budha Statues of Brahma Vihara Arama</h3>\n<p class=\"text-justify\">At Brahma Vihara Arama there are two Buddha statues that really attract our eyes to see, where the Buddha statue is named the Parinirvana Statue and the Buddha statue as the Buddha. This Buddha statue looks very beautiful made of bronze covered with gold, which was a gift from Thailand and Sri Lanka in 1977. Besides this Buddha statue, there are also Buddha statues which are located in the garden at Brahma Vihara Arama and if you add up a total of 31 figs made of rock, a total of 31 means that there are 31 levels of nature beyond nirvana. Many tourists come here and want to get closer to Buddha and do meditation in this place, with a comfortable atmosphere making meditation calm and serene. In general, this Brahmavihara Arama has the following functions; as a place of prayer for Buddhists, a residence for monks, a place for meditation, exploring and developing spirituality and social facilities.</p>\n</span>"
]