[
  "<h1><a href=\"https://www.baligoldentour.com/dharma-giri-vihara.php\" title=\"DHARMA GIRI VIHARA\">DHARMA GIRI VIHARA </a> </h1>\n<h2><a href=\"https://www.baligoldentour.com/dharma-giri-vihara.php\" title=\"DHARMA GIRI VIHARA IS BUDDHA MONASTERY WITH SLEEPING BUDDHA STATUE\">DHARMA GIRI VIHARA IS BUDDHA MONASTERY WITH SLEEPING BUDDHA STATUE</a></h2>\n<a href=\"https://www.baligoldentour.com/dharma-giri-vihara.php\"><img src=\"images/bali-interest-place/sleeping-budha-dharma-giri.jpg\" alt=\"SLEEPING BUDDHA | DHARMA GIRI VIHARA | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"SLEEPING BUDDHA | DHARMA GIRI VIHARA | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n\n\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/dharma-giri-vihara.php\" title=\"Dharma Giri Vihara\"><strong>Dharma Giri Vihara</strong></a> \nis a monastery located in the west part of Bali islands with the uniqueness of the largest Buddha statue in a sleeping position which is painted in pure white color which is very beautiful to the eye. A very spectacular sight, which has become one of the most favorite tourist destinations in the western area of ​​​​the island of Bali. Maybe not many people know about this monastery, because its original purpose was as a place of worship for Buddhists who were around this place. Since the existence of this sleeping Buddha statue, many tourists come here to see the uniqueness of this Buddha putang. With such a beautiful design, it will spoil your eyes to see the majesty of Buddha</p>\n<p class=\"text-justify mb-2\"><strong>All you need to know Dharma Giri Vihara</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#location\">Location Dharma Giri Vihara</a></li>\n<li><a href=\"#statue\">Sleeping Buddha Statue</a></li>\n<li><a href=\"#history\">Dharma Giri Vihara History</a></li>\n<li><a href=\"#process\">Dharma Giri Vihara Geography</a></li>\n<li><a href=\"#geography\">Process Making the Sleeping Buddha Statue</a></li>\n<li><a href=\"#dress-code\">Dharma Giri Vihara Dress Code</a></li>\n</ul>\n\n<span id=\"location\">\n<h3 class=\"font-small\">Location Dharma Giri Vihara</h3>\n<p class=\"text-justify\">The location of the Dharma Giri monastery is in Street Pupuan Tabanan Bali, Tabanan Regency, which is located on the road leading to Singaraja Gilimanuk Village. If you are traveling from Denpasar or Kuta area it will take a very long journey, which takes about 3 hours to get here. A very long journey, but very well worth the scenery you will see here. You can use help from google map if you want to drive yourself to get to this place, but if you don't want to bother looking for the location, you can contact us Bali Tour, we will prepare transportation to get here, of course at a very friendly price and The service is certainly very satisfying and accompanied by a very friendly Balinese driver will make this trip even more enjoyable</p>\n</span>\n\n<span id=\"statue\">\n<h3 class=\"font-small\">Sleeping Buddha Statue</h3>\n<p class=\"text-justify\">The sleeping Buddha statue is located on the left side of the Dharma Giri Vihara building, with a very large size and bright white color which makes this statue look very clean and radiates its beauty. Located in a very wide area that is used as a sitting place for Buddhists, with the view behind the statue is a very large and unspoiled forest. You will definitely like the scenery here, it is very natural and beautiful, it will make your tour very enjoyable. An experience that is hard to forget with a very special moment seeing the splendor of this sleeping Buddha statue<br>\nThe sleeping Buddha statue is one of the tourist destinations for those of you who want to visit the beauty of this sleeping Buddha statue which is located in the western area of ​​​​the island of Bali. The more advanced technology makes social media develop too, so many tourists visit here and capture it in photos and upload it to Instagram which makes this place now one of the most favorite tourist destinations, where tourists can see the beauty of this Buddha statue and take pictures in the background of the Buddha statue<br>\nTo the left of the main building there is a small garden that is still natural and preserved and there is also a small hall in which there is a very large bell and is equipped with a bell hammer made of wood. This bell on certain days will be rung by the monk here. A place that is very suitable for a monastery which is located in a very natural area with a forest that is still maintained its beauty makes the meditation atmosphere of the monks very calm. If by chance you visit the western area of ​​​​the island of Bali, it would be nice if you visit the sleeping buddha who is in this Dharma Giri Vihara</p>\n</span>\n<span id=\"history\">\n<h3 class=\"font-small\">Dharma Giri Vihara History</h3>\n<p class=\"text-justify mb-3\">As for the history of Buddha Dharma Giri Vihara, the foundation was looking for land for Buddhist religious activities at that time, which at that time found a very suitable land where at that time the land was used for plantations and planted with chilies. So that the construction of the Dharma Giri Buddha was carried out in this place and a monument named Raja Ashoka was built which was completed in 2007 with the message of diversity enshrined in the form of an inscription. The King Ashoka Monument was completed and coincided with ten years of the existence of Vihara Dharma Giri in this place. And the foundation wanted to develop this monastery again by using the vacant land around it which at that time was still functioned as a garden, and in 2010 the foundation built a multi-storey building that functioned as the office of the temple administrators. And after the building was completed, in 2010 started plans for the construction of a statue of Buddha Gautama in a sleeping position, while the unique thing is that the foundation administrators did not initially think of making a sleeping position but a cross-legged position with some mudras or hand movements, and the foundation thought if it was in a cross-legged position then the statue will be very high and afraid that the foundation will not be strong then think about making a gautama buddha statue in a sleeping position, as for the length of this sleeping buddha statue is approximately 15 meters and 3 meters high. Initially the existence of the Sleeping Buddha statue was not intended as a tourist attraction. The courtyard in front of it is mostly used for meditation. But over time, the existence of this statue actually attracted many people to visit Vihara Dharma Giri. So that gradually, the statue becomes an icon of religious tourism which is often visited by local and foreign tourists with the beauty of the Gautama Buddha statue in a sleeping position with bright white color that will spoil your eyes to see the beauty of this statue.</p>\n</span>\n<div class=\"row\">\n<div class=\"col-lg-4 col-md-6 col-sm-12\"><a href=\"https://www.baligoldentour.com/dharma-giri-vihara.php\"><img src=\"images/bali-interest-place/dharma-giri-vihara-1.jpg\" alt=\"Dharma Giri Vihara | Sleeping Buddha Statue | Bali Golden Tour\" width=\"400\" height=\"250\" class=\"full-width mb-3\" title=\"Dharma Giri Vihara | Sleeping Buddha Statue | Bali Golden Tour\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12\"><a href=\"https://www.baligoldentour.com/dharma-giri-vihara.php\"><img src=\"images/bali-interest-place/dharma-giri-vihara-2.jpg\" alt=\"Dharma Giri Vihara | Sleeping Buddha Statue | Bali Golden Tour\" width=\"400\" height=\"250\" class=\"full-width mb-3\" title=\"Dharma Giri Vihara | Sleeping Buddha Statue | Bali Golden Tour\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12\"><a href=\"https://www.baligoldentour.com/dharma-giri-vihara.php\"><img src=\"images/bali-interest-place/dharma-giri-vihara-3.jpg\" alt=\"Dharma Giri Vihara | Sleeping Buddha Statue | Bali Golden Tour\" width=\"400\" height=\"250\" class=\"full-width mb-3\" title=\"Dharma Giri Vihara | Sleeping Buddha Statue | Bali Golden Tour\"></a></div>\n</div>\n<span id=\"process\">\n<h3 class=\"font-small\">Process Making the Sleeping Buddha Statue</h3>\n<p class=\"text-justify\">The process of making this sleeping statue is quite long, the process which was originally built in 2010 went through several obstacles, where this building was built twice because the proportions of the first building were not suitable, so it was dismantled and rebuilt in the second construction, the proportions of the statue can be seen. it's okay. The reference to the sleeping Buddha statue does not come from the Buddha statue in Thailand, because in terms of the proportions the shape of the building is completely different. The reference to this sleeping Buddha statue is from Reclining Buddha which refers to a similar statue at Mendut Temple in Magelang district, Central Java. At first the purpose of making this sleeping Buddha statue was not for tourist purposes as it is today, where many tourists visit this place to see the beauty of this sleeping Buddha statue, which was originally intended as a center for Buddhist religious activity in the western area of ​​​​the island of Bali. . Because of the beauty and uniqueness of this sleeping Buddha statue, it is now one of the most popular tourist destinations in the western area of ​​​​the island of Bali</p>\n</span>\n<span id=\"geography\">\n<h3 class=\"font-small\">Dharma Giri Vihara Geography</h3>\n<p class=\"text-justify\">The area of ​​dharma giri vihara not only functions as a place of worship as well, but also functions as a dharma practice, meditation and atthasialni practice (moral discipline recommended by the Buddha). The Dharma Giri Vihara building is where the first floor is designated as a place for selling altars or statues and on the second floor there is a kuti, a resting place for those who do meditation and on the top floor there is a statue of Buddha Gautama who is in a sleeping position. It is a very interesting experience to visit this dharma giri monastery because besides you can find out more about the teachings of Buddhism in Bali, where the island of Bali is predominantly Hindu, and also you can enjoy very beautiful scenery with the forest that stretches still green. and very sustainable and if you want to meditate then this place is very cook at all.</p>\n</span>\n<span id=\"dress-code\">\n<h3 class=\"font-small\">Dharma Giri Vihara Dress Code</h3>\n<p class=\"text-justify\">As for visiting this sleeping Buddha statue there are clothes that are not allowed, where this statue is located in the sacred area of ​​the monastery which is around Dharmasala where visitors are not allowed to wear shorts, for those who happen to be wearing short pants you can use a sarong, here also the visitors do not allowed to use footwear, and footwear must be removed when entering the courtyard of this sleeping Buddha statue. In addition, if you want to visit this place, it is imperative to always maintain the cleanliness of this sacred area, maintain decency and ethics because this area is an area that is sacred by Buddhists. The atmosphere in this monastery is very cool and peaceful, and is very suitable as a place to meditate or clear the mind. For this reason, visitors who come are not allowed to make a fuss so that Buddhists who are praying will not be disturbed.</p>\n</span>"
]