[
  "<h1><a href=\"https://www.baligoldentour.com/garuda-wisnu-kencana.php\" title=\"BALI GARUDA WISNU KENCANA\">BALI GARUDA WISNU KENCANA</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/garuda-wisnu-kencana.php\" title=\"BALI GARUDA WISNU KENCANA IS A STATUE FOR SYMBOL MISSION OF SAVING THE ENVIRONMENT AND THE WORLD ALSO GARUDA WISNU KENCANA AS ICON OF BALI ISLANDS\">BALI GARUDA WISNU KENCANA IS A STATUE FOR SYMBOL MISSION OF SAVING THE ENVIRONMENT AND THE WORLD ALSO GARUDA WISNU KENCANA AS ICON OF BALI ISLANDS</a></h2>\n<a href=\"https://www.baligoldentour.com/garuda-wisnu-kencana.php\"><img src=\"images/bali-interest-place/garuda-wisnu-kencana-bali-golden-tour.jpg\" alt=\"GARUDA WISNU KENCANA | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1000\" height=\"500\" class=\"full-width mb-3\" title=\" GARUDA WISNU KENCANA | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n\n<p class=\"text-justify\"><strong><a href=\"https://www.baligoldentour.com/garuda-wisnu-kencana.php\" title=\"Garuda Wisnu Kencana\">Garuda Wisnu Kencana</a></strong> <strong>(GWK) </strong>It is a tourist destination to see a vast cultural park with various kinds of entertainment and attractions contained in this Garuda Wisnu Kencana. One of the most popular tourist destinations among foreign and domestic tourists, with the flagship of the largest statue in Bali, namely the Garuda Wisnu Kencana Statue which is estimated to be higher than the statue of liberty. With a design that is very thick with the characteristics of Balinese carvings, this statue is one of the best statues and is used as an icon of this beloved island of Bali. If you visit the island of Bali, it would be nice if you visit this Garuda Wisnu Kencana and complete your adventure in spending time during your vacation on the island of Bali</p>\n  <p class=\"text-justify mb-2\"><strong>All you need to know about Garuda Wisnu Kencana</strong> :</p>\n<ul class=\"mb-4\">\n<li><a href=\"#location\">Garuda Wisnu Kencana Location</a></li>\n<li><a href=\"#landspaces\">Landscapes Garuda Wisnu Kencana</a></li>\n<li><a href=\"#you-can-do\">Process of Building the Garuda Wisnu Kencana Statue</a></li>\n<li><a href=\"#story\">Story of Garuda Wisnu Kencana</a></li>\n<li><a href=\"#icon\">Garuda Wisnu Kencana is Icon of Bali Islands</a></li>\n<li><a href=\"#facilities\">Garuda Wisnu Kencana Facilities</a></li>\n</ul>\n  <span id=\"location\">\n<h3 class=\"font-small\">Garuda Wisnu Kencana Location</h3>\n<p class=\"text-justify\">Garuda Wisnu Kencana Bali is located in the southern Badung area about 20 minutes from Kuta. That's very easy to access it from the Ngurah Rai Airport and hotels in Nusa Dua. Garuda Wisnu Kencana (GWK) Bali cultural park is located in the hills of limestone and rock, exactly over the hill of Nusa Dua Pecatu-Badung regency that about 40 kilometers south of Denpasar City Bali, it was approximately 30 minutes drive from Ngurah Rai when using a motor vehicle. The location is very easy to find, armed with a google map you can easily find the location of this Garuda Wisnu Kencana, besides that at every crossroads there are directions that show the location of this Garuda Wisnu Kencana. And if you are confused about finding the location of this Garuda Wisnu Kencana, you can contact us <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a> and we will prepare transportation for you to visit Garuda Wisnu Kencana at a very cheap price and very satisfying service and accompanied by an experienced driver will make the trip this is getting so much fun</p>\n</span>\n<span id=\"process\">\n<h3 class=\"font-small\">Process of Building the Garuda Wisnu Kencana Statue</h3>\n<p class=\"text-justify\">The <a href=\"https://www.baligoldentour.com/garuda-wisnu-kencana.php\" title=\"Garuda Wisnu Kencana\">Garuda Wisnu Kencana</a> statue is made of a mixture of copper and steel with a weight of about 3,000 tons and was done by I Nyoman Nuarta who has a studio working on the Garuda Wisnu Kencana statue module in Bandung by creating a sculpture design consisting of 24 segments with a total of 754 modules. The finished modules were sent to Bali in stages, and this process took a very long time and was stopped due to financial problems and was resumed so that in 2015 the construction of this largest statue was finally completed, having been waiting for 28 years for it to finally be completed. With a height of 121 meters above ground level and 271 meters above sea level with a visibility of up to 20 km, you can see Kuta, Sanur, Nusa Dua and Tanah Lot from here. Not only that, the GWK statue is also one of the tallest in the world, beating the Statue of Liberty in the United States. And the Garuda Wisnu Kencana statue was inaugurated by President Joko Widodo on 22nd September 2018, The inauguration of this statue became the highlight of the 28th anniversary of the construction of the GWK. This inauguration also raised the theme \"Knitting Indonesia One\" by featuring 300 dancers.</p>\n</span>\n<span id=\"landspaces\">\n<h3 class=\"font-small\">Landscapes Garuda Wisnu Kencana </h3>\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/garuda-wisnu-kencana.php\" title=\"Garuda Wisnu Kencana Cultural Park\">Garuda Wisnu Kencana Cultural Park</a> is an area with 240 hectares of land. There are Supporting facilities that you can enjoy like Lotus Pond, Festival Park, Amphitheater, Street Theater, Exhibition Hall, and Jendela Bali The Panoramic Resto and souvenir shop as well. There are many cultural performances every day at <strong>GWK</strong>. <a href=\"https://www.baligoldentour.com/barong-dance.php\" title=\"Barong Dance Performance\" target=\"_blank\">Barong Dance Performance</a> is the most popular show in there and also performances of traditional Balinese music.<br>\nVarious uniqueness and beauty of Bali are well in view of the history, traditions, cultural customs, arts and panorama attraction. Of many attractions in Bali one of them is Garuda Wisnu Kencana that abbreviated. Garuda Wisnu Kencana (GWK) Bali cultural park is the window of island arts and culture against the backdrop of nature and an amazing panorama, making one of the main objectives for a variety of performing arts, exhibitions, conferences or religious visits.</p>\n\n<div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/garuda-wisnu-kencana.php\"><img src=\"images/bali-interest-place/garuda-wisnu-kencana-1.jpg\" alt=\"Garuda Wisnu Kencana Cultural Park | Badung Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width mb-3\" title=\"Garuda Wisnu Kencana Cultural Park | Badung Places of Interest | Bali Golden Tour\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/garuda-wisnu-kencana.php\"><img src=\"images/bali-interest-place/garuda-wisnu-kencana-2.jpg\" alt=\"Garuda Wisnu Kencana Cultural Park | Badung Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width mb-3\" title=\"Garuda Wisnu Kencana Cultural Park | Badung Places of Interest | Bali Golden Tour\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/garuda-wisnu-kencana.php\"><img src=\"images/bali-interest-place/garuda-wisnu-kencana-3.jpg\" alt=\"Garuda Wisnu Kencana Cultural Park | Badung Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width mb-3\" title=\"Garuda Wisnu Kencana Cultural Park | Badung Places of Interest | Bali Golden Tour\"></a></div>\n</div>\n</span>\n<span id=\"story\">\n<h3 class=\"font-small\">Story of Garuda Wisnu Kencana </h3>\n<p class=\"text-justify\">Here is the story of <a href=\"https://www.baligoldentour.com/garuda-wisnu-kencana.php\" title=\"Garuda Wisnu Kencana\">Garuda Wisnu Kencana</a> which follow the birth and deeds of the mythical bird Garudaas quoted from Wikipedia. You can find this story carved into stone relief, placed  in GWK Street Theater. The story of Garuda birth and deeds is told in the first book of the great epic Mahabharata. According to the epic, when Garuda first burst forth from his egg, he appeared as a raging inferno equal to the cosmic conflagration that consumes the world at the end of every age. Frightened, the gods begged him for mercy. Garuda, hearing  their plea, reduced himself in size and energy. Garuda father was the creator-rishi Kasyapa. His mother was Vinata, whose sister was Kadru, the mother of serpents. One day, Vinata entered into and lost a foolish bet, as a result of which she became enslaved to her sister. Mahabharata mentions about a bet between sisters and wives of Kashyapa, Vinata and Kadru, about the colour of Uchchaihshravas tail. While Vinata, the mother of Garuda and Aruna, said it was white, Kadru  said it was black. The loser would have to serve as a servant of the winner. Kadru told her sons, Naga (“serpent”), to cover the tail of the horse and thus  make it appear as black in colour and thus, Kadru won.</p>\n<p class=\"text-justify\">Resolving to release his mother from this state of bondage, Garuda approached the serpents and asked them what it would take to purchase her freedom. Their reply was that Garuda would have to bring them the elixir of immortality, also called amrita. It  was a tall order. The amrita at that time found itself in the possession of the  gods, who guarded it jealously, since it was the source of their immortality. They had ringed the elixir with a massive fire that covered the sky. They had  blocked the way to the elixir with a fierce mechanical contraption of sharp  rotating blades. And finally, they had stationed two gigantic poisonous snakes  next to the elixir as deadly guardians.\nUndaunted,  Garuda hastened toward the abode of the gods intent on robbing them of their  treasure. Knowing of his design, the gods met him in full battle-array. Garuda,  however, defeated the entire host and scattered them in all directions. Taking  the water of many rivers into his mouth, he extinguished the protective fire  the gods had thrown up. Reducing his size, he crept past the rotating blades of  their murderous machine. And finally, he mangled the two gigantic serpents they  had posted as guards. Taking the elixir into his mouth without swallowing it, he launched again into the air and headed toward the eagerly waiting serpents. En route, he encountered Vishnu. Rather than fight, the two exchanged promises. </p>\n<p class=\"text-justify\">Vishnu promised Garuda the gift of immortality even without drinking from the elixir, and Garuda promised to  become Vishnu mount. Flying onward, he met Indra the god of the sky. Another exchange of promises occurred. Garuda promised that once he had delivered the elixir, thus fulfilling the request of the serpents, he would make it possible for  Indra to regain possession of the elixir and to take it back to the gods. Indra in turn promised Garuda the serpents as food. At long last, Garuda alighted in front of the waiting serpents. Placing the elixir  on the grass, and thereby liberating his mother Vinata from her servitude, he urged the serpents to perform their religious ablutions before consuming it. As they hurried off to do so, Indra swooped in to make off with the elixir. From  that day onward, Garuda was the ally of the gods and the trusty mount of Vishnu, as well as the implacable enemy of snakes, upon whom he preyed at every  opportunity.</p>\n</span>\n<span id=\"icon\">\n<h3 class=\"font-small\">Garuda Wisnu Kencana is Icon of Bali Islands</h3>\n<p class=\"text-justify\">This area is the first real rock and steep sloping then transformed into the beautiful and amazing with charming architecture. Implementation of the process by means Bukit cut into giant pillars like building in Egypt but still with the feel of Bali. From the Garuda Wisnu Kencana (GWK) Bali, we can see how beautiful Kuta Beach, Jimbaran, Bali's Ngurah Rai Airport and the Port of Benoa. The area of <a href=\"https://www.baligoldentour.com/garuda-wisnu-kencana.php\" title=\"Garuda Wisnu Kencana\">Garuda Wisnu Kencana</a> planned to be established a landmark or Bali Icon, in the form of a giant statue, that is a statue of Lord Vishnu riding a Garuda bird. This statue was projected to tie layout with visibility up to 20 km so that it can be seen from Kuta and Nusa Dua. Garuda Wisnu Kencana Statue is a symbol of the mission of saving the environment and the world. The statue was made from a mixture of copper and steel weighing 4,000 tons with a height of 75 meters and a width of 60 meters, which was created by sculptor Bali, I Nyoman Nuarta, if manufacturing is complete, can match the Statue of Liberty in United States.</p>\n</span>\n<span id=\"facilities\">\n<h3 class=\"font-small\">Garuda Wisnu Kencana Facilities </h3>\n<p class=\"text-justify mb-2\">Garuda Wisnu Kencana is a tourist destination that has a very large area, where this gwk functions as a cultural park, where you can see various arts from the island of Bali and there is also a large yard as a place for picnics and recreation for family and friends. Garuda Wisnu Kencana is also often used in organizing large events such as concerts or exhibitions, with a very large Garuda Wisnu Kencana statue that will make the atmosphere of visiting Garuda Wisnu Kencana very enjoyable, as for some facilities that you can use or visit at Garuda Wisnu Kencana are as follows</p>\n<ul class=\"mb-3\">\n<li class=\"text-justify\">Lotus Pond surrounded by stone pillars and rock background Garuda bird statue's head with a capacity of 7500 people made       ​​the area is ideal for a variety of grand performances, both national / international. </li>\n<li class=\"text-justify\">Plaza Wisnu art shop selling various Balinese  handicrafts. </li>\n<li class=\"text-justify\">Exhibition Hall space to hold exhibitions. </li>\n<li class=\"text-justify\">Amphitheatre with a capacity of 800 seats and first-class acoustic arrangement is performance art. </li>\n<li class=\"text-justify\">Street Theatre is an outdoor stage for music concerts, fashion shows and other performances. </li>\n<li class=\"text-justify\">\"Jendela Bali\" Restaurant with panoramic of ;<em>Jimbaran Beach</em>. </li>\n</ul>\n<p class=\"text-justify\">When entering Garuda Wisnu Kencana Bali area you will be encountered  several pieces of natural rock pillars wich high 25 feet are standing  firm. Not far from Lord Vishnu statue, there is a sacred spring called  Parahyangan Somaka Giri, why say sacred, because the water is coming out of the  barren limestone hills. The water is believed to cure various diseases, also used as requirements to summon rain.</p>\n</span>"
]