[
  "<h1><a href=\"https://www.baligoldentour.com/gembleng-waterfall.php\" title=\"GEMBLENG WATERFALL\">GEMBLENG WATERFALL</a> </h1>\n<h2><a href=\"https://www.baligoldentour.com/gembleng-waterfall.php\" title=\"GEMBLENG WATERFALL IS BALI INFINITY ROCK POOL WATERFALL WITH JUNGLE VIEW IN SIDEMEN KARANGASEM BALI\">GEMBLENG WATERFALL IS BALI INFINITY ROCK POOL WATERFALL WITH JUNGLE VIEW IN SIDEMEN KARANGASEM BALI</a></h2>\n<a href=\"https://www.baligoldentour.com/gembleng-waterfall.php\"><img src=\"images/bali-interest-place/gembleng-waterfall.jpg\" alt=\"GEMBLENG WATERFALL | INFINITY ROCK POOL WATERFALL | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width\" title=\"GEMBLENG WATERFALL | INFINITY ROCK POOL WATERFALL | BALI GOLDEN TOUR\"></a>\n<p class=\"align-right mb-3\"><em>source : gemblengwaterfall_</em>\n\n</p><p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/gembleng-waterfall.php\" title=\"Gembleng Waterfall\"><strong>Gembleng Waterfall</strong></a> is a waterfall tourist attraction that famous with infinity rock pool, in here have 3 multilevel infinity rock pool, it has become a famous among tourists and is very instagrammable, located in east Bali, precisely in Sidemen, Karangasem Bali. Where this waterfall tourist attraction is now very often visited by tourists and take pictures in the pool in this waterfall. The island of Bali has many unspoiled tourism site and one of them is this beautiful gembleng waterfall in Sidemen village, Karangasem Regency, Bali. The popularity of this tourist attraction is because many tourists upload photos of this place and it becomes a boom on Instagram which makes tourists curious and visit this place.</p>\n<p class=\"text-justify mb-2\"><strong>All you need to know Gembleng Waterfall</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#unique-gembleng-waterfall\">The Uniqueness of the Gembleng Waterfall</a></li>\n<li><a href=\"#location-gembleng-waterfall\">Location of Gembleng Waterfall</a></li>\n<li><a href=\"#function-gembleng-waterfall\">The Function of the Gembleng Waterfall</a></li>\n<li><a href=\"#instagramable-gembleng-waterfall\">Instagramable Gembleng Waterfall</a></li>\n<li><a href=\"#trek-gembleng-waterfall\">Trek to Gembleng Waterfall</a></li>\n<li><a href=\"#facilities-gembleng-waterfall\">Facilities at Gembleng Waterfall</a></li>\n<li><a href=\"#photo-spot-gembleng-waterfall\">Photo Spot at Gembleng Waterfall</a></li>\n</ul>\n<span id=\"unique-gembleng-waterfall\">\n<h3 class=\"font-small\">The Uniqueness of the Gembleng Waterfall</h3>\n<p class=\"text-justify\">Gembleng waterfall is not a big waterfall, but a waterfall where the water flows in a rock whose surface is not land and sloping, and at each fall of this waterfall there is a small pool of water reservoirs before falling down again, and underneath there is a reservoir of falling water. from the upper pool, and here it is like a terraced waterfall, but uniquely here on each level there is a small pool, this waterfall has 3 small pools that are used for bathing and bathing here, with a pool that is not so deep so you can freely soak here . The pool is small and doesn't fit a lot of people. Another unique thing is the infinity-style rock pool with stunning forest views. No wonder many tourists come here to see the uniqueness of this Gembleng waterfall</p>\n</span>\n<span id=\"location-gembleng-waterfall\">\n<h3 class=\"font-small\">Location of Gembleng Waterfall</h3>\n<p class=\"text-justify\">The location of the gembleng waterfall is located in the sidemen area, Karangasem, Bali. Precisely in Telun Wayah village or by another name Tri Eka Buana Village, if you depart from Seminyak or Kuta, it takes about 2 hours to reach this location, the location is far before lempuyang. The location is indeed quite far if you are in the city center, but the long journey is very worth what you will get here, with the beauty of this waterfall will answer all the fatigue on the way to this place, if you want to come here we are from <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a> can take you here at gembleng waterfall by offer hire car with driver in program <a href=\"https://www.baligoldentour.com/bali-car-charter.php\" title=\"Bali Car Charter\">Bali Car Charter</a> using comfortable private car with cold A/C, an experienced driver and of course the price is also very friendly.</p>\n</span>\n<span id=\"function-gembleng-waterfall\">\n<h3 class=\"font-small\">The function of the Gembleng Waterfall</h3>\n<p class=\"text-justify\">Meanwhile, the gembleng waterfall is often used as a place for spiritual self-purification by the local people here, where on the island of Bali the process of self-purification is called Melukat, the purpose of this melukat is to cleanse the soul and body from negative things. In the past, this place was not opened to the public, only for local people who wanted to take a bath and perform a self-cleaning ceremony here. But now it is open to the public, since it was opened not so many tourists have come here, but after one of the photos was seen on Instagram with the characteristic infinity pool, many are curious and come here to see the uniqueness and beauty of this gembleng waterfall.</p>\n</span>\n<span id=\"instagramable-gembleng-waterfall\">\n<h3 class=\"font-small\">Instagramable Gembleng Waterfall</h3>\n<p class=\"text-justify\">When we talk about Infinity Pool, it will certainly make us curious about how it looks and feels when soaking there, especially those that are formed naturally by nature, like this gembleng waterfall, there are 3 infinity pools that you can try. The photos produced when soaking in the infinity pool are very instagramable, and of course will make many people who like your photo with an unspoiled forest background will make many people jealous and curious to visit this gembleng waterfall. Just as <a href=\"https://www.baligoldentour.com/angel-billabong.php\" title=\"Angel Billabong\">Angel Billabong</a> in nusa penida is a naturally formed infinity pool located on the seafront made from erosion of continuous sea water, similar like this gembleng waterfall, formed naturally by continuous erosion of the waterfall which makes it look like a pool or jacuzzi. If you really like Instagram and photos, it would be great if you visit this place and take photos with the infinity pool and upload them to Instagram so that all who see feel amazed by the scenery produced here</p>\n</span>\n<div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><img src=\"images/bali-interest-place/gembleng-waterfall-1.jpg\" alt=\"Gembleng Waterfall | Infinity Pool Waterfall | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width\" title=\"Gembleng Waterfall | Infinity Pool Waterfall | Bali Golden Tour\">\n<p class=\"mb-3\"><em>source : gemblengwaterfall_</em></p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><img src=\"images/bali-interest-place/gembleng-waterfall-2.jpg\" alt=\"Gembleng Waterfall | Infinity Pool Waterfall | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width\" title=\"Gembleng Waterfall | Infinity Pool Waterfall | Bali Golden Tour\">\n<p class=\"mb-3\"><em>source : Tyler Crawford</em></p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><img src=\"images/bali-interest-place/gembleng-waterfall-3.jpg\" alt=\"Gembleng Waterfall | Infinity Pool Waterfall | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width\" title=\"Gembleng Waterfall | Infinity Pool Waterfall | Bali Golden Tour\">\n<p class=\"mb-3\"><em>source : Putu Sri Martiani</em></p></div>\n</div>\n<span id=\"trek-gembleng-waterfall\">\n<h3 class=\"font-small\">Trek to Gembleng Waterfall</h3>\n<p class=\"text-justify\">As for the waterfall attractions on the island of Bali, most of them are located in the interior and getting to the location requires a slightly tiring journey, different from the gembleng waterfall where from the ticket counter you only walk briefly through the plantations of the local community to the location, on the way you can see a very natural forest view where many trees are still green and very sustainable, until at the location there are stairs made of concrete, from the stairs you will go up to the location of the existing infinity rock pool, on the way up and you can see the water falling down the waterfall, where this ladder is built next to the waterfall, only to go to the location of the infinity pool we have to go up the stone stairs, after reaching the top, to reach the infinity pool you have to pass a small bridge made of wood, here you have to be careful because it is a bit slippery, after that you can soak in this infinity pool with a view of the forest in this sidemen village , absolutely fantastic experience. Your journey to this waterfall will be paid off after soaking in the rock pool of this waterfall while looking at the very beautiful forest scenery, enjoy this moment and admire the beauty that nature makes for you to enjoy</p>\n</span>\n<span id=\"facilities-gembleng-waterfall\">\n<h3 class=\"font-small\">Facilities at Gembleng Waterfall</h3>\n<p class=\"text-justify\">What needs to be brought when visiting the waterfall, the gembleng waterfall is a natural tourism object that is just booming and is in great demand by foreign tourists, although it is still new and in the development stage, natural tourism ii already has adequate facilities. If you visit the gembleng waterfall, you need to bring a change of clothes, towels and mosquito lotion. Here is a place for you to change clothes. It's an amazing sensation to soak in this infinity pool waterfall with all the beauty of the surrounding natural scenery, it feels like soaking in a Jacuzzi in the wild, while the water in this Gembleng waterfall is very clean and comes from springs in the hills. , soaking here will really refresh your body, and if you like photos, then this place is perfect for taking pictures with the infinity pool with a natural sidemen forest view</p>\n</span>\n\n\n<span id=\"photo-spot-gembleng-waterfall\">\n<h3 class=\"font-small\">Photo Spot at Gembleng Waterfall</h3>\n<p class=\"text-justify\">For those of you who visit here but don't soak in this infinity pool, you can take pictures and enjoy the beauty that surrounds this place. In addition to the gembleng waterfall infinity pool, there is also a place for photo spots like hearts made of rattan with a very beautiful sidemen forest view and there is also a boat made of wood with a very beautiful forest background, in the future there will be more photo spots so that tourists besides visiting the waterfall can also enjoy the natural scenery at the waterfall. around that is still natural and very beautiful. The surroundings are decorated with various plants so that it will spoil the eyes of those who see it, you may feel at home to linger here with the cool air, unspoiled natural scenery and the melodious sound of the waterfall will make the heart feel very comfortable and at ease</p>\n</span>"
]