[
  "<h1><a href=\"https://www.baligoldentour.com/goa-gajah-temple.php\" title=\"BALI GOA GAJAH TEMPLE\">BALI GOA GAJAH TEMPLE</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/goa-gajah-temple.php\" title=\"GOA GAJAH TEMPLE BALI IS HISTORICAL SITE THAT FOUND RELIC ABOUT ACCULTURATION TWO RELIGION BUDDHIST AND HINDU SIVA\">GOA GAJAH TEMPLE BALI IS HISTORICAL SITE THAT FOUND RELIC ABOUT ACCULTURATION TWO RELIGION BUDDHIST AND HINDU SIVA</a></h2>\n<a href=\"https://www.baligoldentour.com/goa-gajah-temple.php\"><img src=\"images/bali-interest-place/goa-gajah-temple-bali-golden-tour.jpg\" alt=\"GOA GAJAH TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"GOA GAJAH TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n<p class=\"text-justify\">Welcome to <a href=\"https://www.baligoldentour.com/goa-gajah-temple.php\" title=\"Bali Goa Gajah Temple or Elephant Cave Temple\"><strong>Bali Goa Gajah Temple or Elephant Cave Temple</strong></a> which is located  in west side of countryside, Blah Batuh Sub district and Gianyar Regency. It is about 27 km from Denpasar town. This cave is built  at crevasse edge from the federation of 2 rills that is called Pangkung River, where the irrigation is mixed with Petanu River flow. The federation area of  two rivers is called Campuhan/Mixture. It owns the magical energy on the basis  of Rwabineda Concept/two different matters on this basic concept hence Goa Gajah Temple or Elephant Cave Temple is intentionally built  among two rivers. It is a very worthy site for you to visit, here you will know about the history of the development of Hinduism in Bali and see the relics of statues and sites that are very historic and have high value in the development of the island of Bali. With a very comfortable atmosphere near the river, it makes the atmosphere comfortable and cool and full of religious aura</p>\n<p class=\"text-justify mb-2\"><strong>If you visit Goa Gajah Temple, here all you need to know</strong></p>\n<ul class=\"mb-3\">\n<li><a href=\"#history-goa-gajah\">Goa Gajah History</a></li>\n<li><a href=\"#name-goa-gajah\">Meaning Name Goa Gajah</a></li>\n<li><a href=\"#relic-budha-statue\">Relic Budha Statue</a></li>\n<li><a href=\"#goa-gajah-geographicaly\">Goa Gajah Temple Geographically</a></li>\n<li><a href=\"#location-goa-gajah\">Goa Gajah Location</a></li>\n<li><a href=\"#dress-code\">Goa Gajah Dress Code</a></li>\n</ul>\n<span id=\"history-goa-gajah\">\n<h3 class=\"font-small\">History of Goa Gajah Temple</h3>\n<p class=\"text-justify\">As for history, it can be said that Goa Gajah temple was built in the period 10-11 AD, which at that time was the dynasty of the Warmadewa kingdom, while the name Goa Gajah refers to the statue of Ganesha found engraved on the cave wall. In 1923 the elephant cave site was discovered by L.C Heyting who at the time of discovery, he found Archa Ganesha, a statue of Tri Langga and also a statue of Hariti. Furthermore, a follow-up study was carried out by Dr.W.F. Stutterhiem in 1925 and also in 1950 carried out further research by the Indonesian side, namely from the Indonesian archaeological site in 1954 to 1979 which resulted in the discovery of a small pond which is now in front of the mouth of Goa with six statues of women and their showers. The water flowing from the shower is believed by visitors who come there to make their age younger. A very shocking discovery of history, where from this discovery it can be seen that we are familiar with the existence of beliefs in ancient times, while some statues such as Ganesha figures are god figures found in Hinduism long time ago, and the spread of religion had occurred at that time</p>\n</span>\n<span id=\"name-goa-gajah\">\n<h3 class=\"font-small\">Meaning Name Goa Gajah</h3>\n<p class=\"text-justify\">The word of Goa Gajah is anticipated coming from the word of Lwa  Gajah, the name of Buddhist  Temple&nbsp;or  hermitage for Buddhist monk. The Goa Gajah's name is written on Negara Kertagama  papyrus which is compiled by Mpu Prapanca on 1365 M. Lwa or Lwah/Loh mean the  river and it reflect to the meaning that the hermitage is located at Gajah  River or in Air Gajah. In the year inscription 944 Saka, it is mentioned with  the name of ‘ser ring Air Gajah' that is meaning the Subak leader in Air Gajah.  The word has mentioned that the hermitage of Lwa Gajah is located in Subak Air  Gajah. Among the local residents, the Goa Gajah Temple is better known as Cave Temple, located in the west of Bedahulu  Village, Blahbatuh Subdistrict, Gianyar Regency. It is about 27 km east of  Denpasar. A visit to this temple can be done easily because it is only a few  feet below the highway toward the village of Tampaksiring Indeed this temple  was built at the valley of Petanu River having beautiful natural panorama.</p>\n</span>\n<span id=\"relic-budha-statue\">\n<h3 class=\"font-small\">Relic Budha Statue</h3>\n<p class=\"text-justify\">In addition to lightning and caves, at the Goa Gajah site there are also ancient relics on the ruins of cliffs in the southeast which are identified as the Tukad Pangkung complex. To make it easier for visitors to this complex, concrete stairs and a bridge across the Tukad Pangkung have been made. From the bridge a ladder was made to reach a fragment of the Buddha statue which is located on a higher cliff. Before crossing the bridge there is a staircase to view other carved fragments and a hermitage alcove. The overall structure of Goa Gajah temple is different from other temples in Bali, which generally consist of Jaba or outer courtyard, Jaba Tengah or middle courtyard and Offal or backyard which is the most sacred place in a temple. with a cool atmosphere and make the adventure atmosphere even more religious, it's very fun to visit historical sites and see the relics of two beliefs namely Hindu Shiva and Buddha in one place Based on iconographic studies conducted on the Trilingga statue; Ganesha; Shower Statue; Ganesha statue; and lightning, it can be estimated that Goa Gajah was established in the 11th century AD, namely during the reign of Anak Wungsu. However, if you look at the Buddhist relics found in Goa Gajah, namely the Dyani Buddha Amitaba statue which according to his style shows many similarities with the Dyani Buddha statue at Borobudur temple, namely from the mid-9th century AD, it can be concluded that the possibility of Goa Gajah has been established. long before the reign of Anak Wungsu with its initial embryo as a place of worship for Buddhism and only in the 11th century AD Hinduism helped build a worship complex in this place.</p>\n</span>\n<div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/goa-gajah-temple.php\"><img src=\"images/bali-interest-place/goa-gajah-temple-1.jpg\" alt=\"Goa Gajah Temple | Elephant Cave Temple | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width \" title=\"Goa Gajah Temple | Elephant Cave Temple | Bali Golden Tou\"></a>\n<p class=\"text-center mb-3\">Trilingga Relic</p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/goa-gajah-temple.php\"><img src=\"images/bali-interest-place/goa-gajah-temple-2.jpg\" alt=\"Goa Gajah Temple | Elephant Cave Temple | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width \" title=\"Goa Gajah Temple | Elephant Cave Temple | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Ganesha Relic</p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/goa-gajah-temple.php\"><img src=\"images/bali-interest-place/goa-gajah-temple-3.jpg\" alt=\"Goa Gajah Temple | Elephant Cave Temple | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width \" title=\"Goa Gajah Temple | Elephant Cave Temple | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Budha and Ganesha Relic</p></div>\n</div>\n<span id=\"goa-gajah-geographicaly\">\n<h3 class=\"font-small\">Goa Gajah Temple Geographically</h3>\n<p class=\"text-justify\">If you visit the elephant cave, it would be nice if you know the layout of this valuable site, and hopefully when you visit there will be no confusion. Goa Gajah is one of the historical sites found where you can see the buildings and relics here that have Hindu and Buddhist nuances, where long ago there were Buddhist monks who inhabited this place and met with Hindu priests, and they exchanged ideas about Buddhist and Hindu teachings, which where now these teachings are at the root of understanding Hindu teachings on the island of Bali</p>\n<ul class=\"text-justify mb-3\">\n<li class=\"mb-2\">In the northern part of the temple, lies a  carved Cave of Nature in the shape of the letter ”T”, in front of the cave you will see the carvings of with shape of face man carved into the rock in this cave, so beautiful and some of the carvings have been eroded by age.. Inside this cave  there is a Ganesha statue considered as the god of sciences which is located at the end of the cave and is sanctified by the local community here. Additionally, at  the location can also be encountered some fragments of statues and a Trilangga  surrounded by eight small phallus, which is a relic of the Hindu Shiva belief.</li>\n<li class=\"mb-2\">In the cave wall, there are niches of the  hermitage and the face of Cave is decorated with carvings depicting a jungle  with its contents. Similarly, there is a short inscription which reads ”Kumon” and ”Sahywangsa”, which according to the type of letters it is alleged to  originate in the eleventh century AD. Meanwhile in the west of the cave, there is a  building retaining a squating statue inside, and the Ganesha as well as Men  Brayut statue. The latter in Buddhist mythology is known as Hariti, the savior  of children. The relic of the Buddhist faith is so beautiful, just looking at it already makes the heart feel at ease</li>\n<li class=\"mb-2\">In front of the cave, except for the guard  statues, there are also fragments of building whose origin was unknown such as  the building fragments that now being gathered in the temple’s courtyard  located in the west of bathing pond. Fountain statues that have worked again in  the holy bathing pond are divided into three parts and in terms of its style,  they are probably derived from the eleventh century AD. Unfortunately, the  statue fountain located in the middle of the pond, has not been found until  now.<br>\nGoa Gajah  Temple occur two Buddha statues, one of them is without head while another is  still good enough with the style of Central Java. The north side of this statue  seemingly stay to stick on the cliffs, where the foot of the cliff temple has  long fallen into the creek. On the side of this small can be found  three-pronged relief of stupa and the ruins of the cliff temple having  beautiful carvings.</li>\n</ul>\n</span>\n<span id=\"location-goa-gajah\">\n<h3 class=\"font-small\">Location Goa Gajah Temple</h3>\n<div class=\"row\">\n<div class=\"col-lg-8\">\n<p class=\"text-justify\">As for the location of the elephant cave, located in the village of Betulu, Blahbatuh district and Gianyar district, it is one of the tourist destinations that is very often visited by tourists. If you depart from Kuta it will take about 1.5 hours and if from Ubud it will take about 30 - 45 minutes by car or motorbike. It is not difficult to find this location, because it is located in a tourism area where the route is still busy and at each intersection there is a signpost that shows the location of Goa Gajah temple. If you are confused to find the location, you can use the help of google map to reach this location. If you don't want to be busy driving yourself, here we <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a> offer transportation rentals at affordable prices and very satisfying service. Accompanied by an experienced and friendly driver will make this trip even more enjoyable. Besides visiting the elephant temple cave, you can also visit other places such as <a href=\"https://www.baligoldentour.com/tegenungan-waterfall.php\" title=\"Tegenungan Waterfall\">Tegenungan Waterfall</a> which is not far from this place. If you are on vacation on the island of Bali, take the time to visit the elephant cave and see the uniqueness of this site where there are elephant carvings on the cave walls.</p>\n</div>\n<div class=\"col-lg-4\">\n<iframe src=\"https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d15783.008162202344!2d115.2871568!3d-8.5234378!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x0%3A0xcf6f85fcf798a545!2sGoa%20Gajah!5e0!3m2!1sen!2sid!4v1659528735706!5m2!1sen!2sid\" class=\"full-width\" width=\"400\" height=\"250\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>\n</div>\n</div>\n</span>\n<span id=\"dress-code\">\n<h3 class=\"font-small\">Goa Gajah Temple Dress Code</h3>\n<p class=\"text-justify\">Based on archeological findings as mentioned  above, it can be known the Goa Gajah Temple is derived from the ninth to  eleventh centuries AD. In the past, it served as a monastery of Buddhist monk  and Shivite priest. This conservatism also shows the unification of Buddhism  and Shiva went well. As for visiting the elephant cave, you are expected to dress modestly because you will visit a historical site that is sanctified by the local community, as for sarongs and scarves that will be provided by the officers here, and become a package with the ticket price at this elephant cave. When visiting here, please do not damage this historic site, because this site is very old. An experience that might be very memorable for you, where you can see the acculturation of the influence of Hinduism and Buddhism here, with a very beautiful atmosphere that will make the atmosphere around it very impressive. If you like history and unique things, then this elephant cave tourist destination is worth a visit</p>\n</span>"
]