[
  "<h1><a href=\"https://www.baligoldentour.com/goa-lawah-temple.php\" title=\"BALI GOA LAWAH TEMPLE\">BALI GOA LAWAH TEMPLE</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/goa-lawah-temple.php\" title=\"BALI GOA LAWAH TEMPLE IS A TEMPLE WITH NATURE CAVE DWELT BY THOUSANDS OF TAIL BAT\">BALI GOA LAWAH TEMPLE IS A TEMPLE WITH NATURE CAVE DWELT BY THOUSANDS OF TAIL BAT </a><a href=\"https://www.baligoldentour.com/goa-lawah-temple.php\" title=\"NATURE CAVE DWELT BY THOUSANDS OF TAIL BAT AT GOA LAWAH TEMPLE\"></a></h2>\n<a href=\"https://www.baligoldentour.com/goa-lawah-temple.php\"><img src=\"images/bali-interest-place/goa-lawah-temple-bali-golden-tour.jpg\" alt=\"GOA LAWAH TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"GOA LAWAH TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n<p class=\"text-justify\"> <strong><a href=\"https://www.baligoldentour.com/goa-lawah-temple.php\" title=\"Bali Goa Lawah or&nbsp;Bat Cave Temple\">Bali Goa  Lawah or Bat Cave Temple</a></strong> is one of favorite places of interest in Bali and it is located  near of hilly bank so it is called reef of Middle hill. This cave is located in  Pasinggahan countryside, Dawan sub district, Klungkung Regency, east part of  Bali. There is a <strong>nature cave dwelt by thousands of tail bat</strong> located at north side from Jeroan/center of Gua Lawah Temple. Meanwhile the main road from Klungkung to Amlapura is just in front of the  temple. This cave is apposite to the beautiful beach with black sand along the coastal area. A tourist attraction that is very interesting to visit with all its uniqueness makes Goa Lawah become one of the tourist attractions that are often visited by tourists who want to travel to the eastern part of Bali, with a strategic location making Goa Lawah one of the must-visit attractions. a stopover if doing a tour in the eastern area of ​​​​the island of Bali. With a location close to the beach, it adds to the plus value of this Goa Lawah temple tourism object</p>\n<p class=\"text-justify mb-2\"><strong>Here all you need to know about Goa Lawah Temple</strong></p>\n<ul class=\"mb-3\">\n<li><a href=\"#location\">Location of Goa Lawah Temple</a></li>\n<li><a href=\"#uniqueness\">The Uniqueness of Goa Lawah</a></li>\n<li><a href=\"#ecosystem\">Bats in the Ecosystem</a></li>\n<li><a href=\"#history\">History of Goa Lawah Temple</a></li>\n<li><a href=\"#head-dragon\">Goa Lawah is Head of Basuki Dragon</a></li>\n<li><a href=\"#worships\">Goa Lawah for Worships God of Ocean</a></li>\n<li><a href=\"#geography\">Geography Goa Lawah Temple</a></li>\n<li><a href=\"#facilities\">Facilities at Goa Lawah Temple</a></li>\n<li><a href=\"#tour\">Tour to Goa Lawah Temple</a></li>\n\n</ul>\n<span id=\"location\">\n<h3 class=\"font-small\">Location of Goa Lawah Temple</h3>\n<p class=\"text-justify\">The location of Goa Lawah is in Klungkung Regency, Dawan Village, where if you depart from Denpasar it will take about 1 hour drive, the position is located on the main road to Karang Asem. If you go to Karangasem, you will pass this Goa Lawah temple. located in front of the beach with a very beautiful beach with clear water adds to the charm of this lawah cave. If you want to go here, please contact us and we will take you to see the uniqueness of this Goa Lawah temple, where you can see thousands of bats hanging at the mouth of the cave and these bats during the day they only rest and at night they come out. With an experienced driver, the trip to Goa Lawah Temple will be even more enjoyable</p>\n\n<span id=\"uniqueness\">\n<h3 class=\"font-small\">The Uniqueness of Goa Lawah</h3>\n<p class=\"text-justify\">The uniqueness of the Goa Lawah temple is a group of bats that occupy the cave passage here. As for the fact that the bats are in a sacred place and do not disturb them, these bats are protected by local customary rules and are forbidden to be hunted or caught, because they are believed to be sacred creatures that guard the Goa Lawah temple. This makes the noise of this nocturnal animal colony a phenomenon in itself that can be witnessed by visitors. In addition, the presence of a bat relief at one of the gates/Gelung Temples that separates the middle courtyard (jaba Tengah) from the inner courtyard (jeroan) of the temple is a symbol that this animal has a special position in this temple. A herd of nocturnal animals, active at night every day out of the cave starting in the evening. Waves of bats came out of the temple to find food. But strangely, not all of them came out at the same time, they seemed to take turns. There is some waiting. Imagine if everyone left the cave at once, this area could be like being covered by a cloud of bats.</p>\n</span>\n<span id=\"ecosystem\">\n<h3 class=\"font-small\">Bats in the Ecosystem</h3>\n<p class=\"text-justify\">So far, there has never been an incident of bats with residents, besides bats in the cave there are snakes which are also sacred, where these snakes also control the population of bats in this Goa Lawah temple. As for this type of bat is a fruit-eater and travels at night is never far from the nest. As for the cave from Goa Lawah, no one has ever tried to go inside and it is said that this cave penetrates to the <a href=\"https://www.baligoldentour.com/besakih-temple.php\" title=\"Besakih Temple\">Besakih Temple</a>. As for the role of the bats here as seed dispersers, insectivores and indirect pollinators, because they function in regulating and controlling the ecosystem. Losing one of these roles will cause the balance of the ecosystem to be disturbed. In addition, their role in the ecosystem, their distribution area, habitat and their rarity status are also presented in this book so that they can be taken into consideration in managing land use systems that consider conservation aspects.</p>\n</span>\n\n<span id=\"history\">\n<h3 class=\"font-small\"> History of Goa Lawah Temple</h3>\n<p class=\"text-justify\">Pursuant to the papyrus of Dwi Jendra Tattwa,  the Goa Lawah's name is Goa Lelawah, the name which is given by Danghyang  Nirartha (a priest overspread the Hindu teaching in Bali) when he stop in this  place on his Tirtha Yatra trips. He arrive at a cave which is a lot of bats  hang on and its unbroken voice clamor as hymn to add the beauty of the cave.  Therefore this cave is named by Goa Lawah or Bat Cave. On the above cave is growth  by the flower trees with it's smelt fragrance and stimulus the peace mind of Danghyang Nirartha, so that he overnight stay for some nights in this place.  From the cave we see also the beautiful coast with the blue ocean with Nusa  Penida Island as a backdrop. In Goa Lawah consists of two syllables of the  cave, which means cave and Lawah which means bat cave where Lawah tail  inhabited by thousands of bats in the mouth of this Bali attractions there is a  temple Khayangan Jagat status. Goa Lawah Temple is a sacred and beautiful  area. There was a blend of sea and mountains (linga-yoni). As the name  suggests, this temple there is a cave inhabited by thousands of bats. While at  the mouth of the cave there are several palinggih Stana of the Gods. In the  yard, also stood firm several Meru and other sthana. Narrated MPU Kuturan come  to Bali during the tenth century the government-led Children's Youngest brother  of King Airlangga. Airlangga own rule in East Java (1019-1042). When he arrived,  mpu Kuturan find many sects in Bali. Seeing the fact that, mpu Kuturan then  develop the concept of Tri Murti with the aim of uniting all these sects  Kuturan MPU also teaches making heaven Pakraman Three in every village in Bali  as well as confirmed the presence of Jagat heaven that one of them is Goa Lawah Temple</p>\n</span>\n<div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/goa-lawah-temple.php\"><img src=\"images/bali-interest-place/goa-lawah-temple-1.jpg\" alt=\"Goa Lawah Temple | Bats Cave Temple | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width mb-3\" title=\"Goa Lawah Temple | Bats Cave Temple | Bali Golden Tour\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/goa-lawah-temple.php\"><img src=\"images/bali-interest-place/goa-lawah-temple-2.jpg\" alt=\"Goa Lawah Temple | Bats Cave Temple | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width mb-3\" title=\"Goa Lawah Temple | Bats Cave Temple | Bali Golden Tour\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/goa-lawah-temple.php\"><img src=\"images/bali-interest-place/goa-lawah-temple-3.jpg\" alt=\"Goa Lawah Temple | Bats Cave Temple | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width mb-3\" title=\"Goa Lawah Temple | Bats Cave Temple | Bali Golden Tour\"></a></div>\n</div>\n<span id=\"head-dragon\">\n<h3 class=\"font-small\">Goa Lawah is Head of Basuki Dragon</h3>\n<p class=\"text-justify\">Goa Lawah according to stories from the community where the relationship is very close to Besakih Temple which is located on the slopes of Mount Agung which is the largest temple on the island of Bali and is also the mother temple in Bali. Where according to Lontar Prekempa explained that the Goa Lawah temple is a representation of the head of the Naga Basuki while Goa Rajah in the Besakih complex represents the tail of the Dragon Basuki. In Hindi mythology where it is explained that one of the three dragons incarnated by gods who was sent to earth to save mankind is Naga Basuki which is symbolized as a cycle of balance that occurs in nature, where sea water evaporates and falls to earth to become rain on land including mountains which eventually the water returns to the sea. The concept of natural balance which is closely related to the existence of Gua Lawah makes it a center of worship for Bhatara Tengahing Segara who is a representation of God in the form of the caretaker of the ocean and also worships Sang Hyang Naga Basuki.</p>\n</span>\n<span id=\"worships\">\n<h3 class=\"font-small\">Goa Lawah for Worships God of Ocean</h3>\n<p class=\"text-justify\">In the concept of padma bhuana Bali, Goa Lawah Temple occupies a position towards the southeast. The one worshiped here is Ida Sang Hyang Widhi Wasa in the manifestation of Dewa Maheswara. As for the books that tell the history of the temples, it is stated that Goa Lawah Temple is to worship Batara Tengahing Segara, the ruler of the ocean. As for the public belief that has been circulating so far, it is stated that the Goa contained in Goa Lawah is believed to penetrate Besakih Temple. And it was written in the chronicle that it was mentioned that a prince from the kingdom of Mengwi had been tested by Dalem Gelgel to enter Goa Lawah. It turned out that the prince had indeed penetrated Besakih but was deaf. The prince was then given the name I Gusti Agung Ketut Besakih. With this story, it can be shown that Goa Lawah is a place to worship both the mountains and the sea. Therefore, Hindus often take advantage of Goa Lawah Temple as a place for teaching or nyegara gunung. This is where the two met to give birth to a harmonious life. Mountain (Mount Agung) as a symbol of land and sea (Indian Ocean) as a symbol of water.</p>\n</span>\n<span id=\"geography\">\n<h3 class=\"font-small\">Geography Goa Lawah Temple</h3>\n<p class=\"text-justify mb-0\">Goa Lawah Temple was built by applying the tri mandala concept system, where there are 3 basic courtyards in a temple building. This concept is often applied by most temples in Bali and it is believed that the tri mandala concept will bring peace, prosperity and prosperity. The Goa Lawah Temple is patterned into five strata.</p>\n<ol>\n<li>The first strata is Goa Lawah with the space in the cave which is the main core or main. Rows of pelinggih (sacred buildings) in the cave as the main madyaning and the lip of the cave as the main nistaning.</li>\n<li>The second stratum is the viscera of the temple with natar puja, while the madyaning madya is in the form of pelinggih-pelinggih, followed by bale piyasan and bale banten as middle nistaning.</li>\n<li>The third strata is the middle jaba outside the Kori Agung, still in the area of ​​the Candi Bentar. As the main part of the kanista, it consists of a row of complementary and sacred buildings. As Madyaning Kanista, namely Mandala Jaba Tengah, while Nistaning Kanista are Bale Bengong, Bale Kulkul and Bale Orderekan.</li>\n<li>The fourth strata is the jaba side outside of the bentar temple which is on the north side of the road. On the south side there is a guardianship monument, on the west side there is wantilan paseban and on the east side there is a pewaregan with bale paebatan.</li>\n<li>The fifth stratum is on the beach as a mandala of worship. Here, the main mandala is directed to the south, the madyaning mandala is in the form of Pesanekan buildings and parking spaces on the side of the road as a canopy for the mandala.</li>\n</ol>\n</span>\n<span id=\"facilities\">\n<h3 class=\"font-small\">Facilities at Goa Lawah Temple</h3>\n<p class=\"text-justify\">As for the facilities at Goa Lawah Temple, including very complete in supporting the tourism that is here, where there is a very large parking lot here, if you bring a car or bring a motorbike, you don't need to worry, because the parking space provided is sufficient. very wide. There are stalls selling food and drinks here, you can see many stalls on the beach selling food and drinks here, there is a fairly clean toilet here that you can use, there is a rest area here that you can use to rest after a long journey. very long. There are souvenir vendors here selling souvenirs that you can buy as souvenirs. It is classified as a complete facility for those of you who want to visit this Goa Lawah temple, so you don't have to worry anymore when visiting this Goa Lawah temple. So what are you waiting for, come and see the uniqueness of this Goa Lawah temple and see the beauty of Goa Lawah beach which is very beautiful.</p>\n</span>\n<span id=\"tour\">\n<h3 class=\"font-small\">Tour to Goa Lawah Temple</h3>\n<p class=\"text-justify\">If you are interested in visiting the Goa Lawah temple, we have tour packages that you might be interested in, where in addition to visiting the beauty and uniqueness of this Goa Lawah temple, you can also see and visit attractions that are no less interesting located in the eastern part of Bali, you can see here <a href=\"https://www.baligoldentour.com/bali-east-tour.php\" title=\"East Bali Tour\">East Bali Tour</a>, with a very cheap price and guaranteed with a very satisfying service will make your trip and your days more memorable. Goa Lawah temple is a very good tourist attraction for you to know the uniqueness of the customs and ceremonies on the island of Bali. We from <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a> will always provide the best service in the hope that it will make your holiday even more memorable. So what are you waiting for, contact us immediately and see the uniqueness of this Goa Lawah temple during your holiday on the island of Bali</p>\n</span>\n</span>"
]