[
  "<h1><a href=\"https://www.baligoldentour.com/gunung-kawi-temple.php\" title=\"GUNUNG KAWI TEMPLE\">GUNUNG KAWI TEMPLE</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/gunung-kawi-temple.php\" title=\"BALI GUNUNG KAWI TEMPLE IS ANCIENT ROYAL TOMBS IN POET OF MOUNTAIN WITH COLLECTION OF HISTORICAL CANDI\">BALI GUNUNG KAWI TEMPLE IS ANCIENT ROYAL TOMBS IN POET OF MOUNTAIN WITH COLLECTION OF HISTORICAL CANDI</a></h2>\n<a href=\"https://www.baligoldentour.com/gunung-kawi-temple.php\"><img src=\"images/bali-interest-place/gunung-kawi-temple-bali-golden-tour.jpg\" alt=\"GUNUNG KAWI TEMPLE | BALI INTEREST PLACES | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"GUNUNG KAWI TEMPLE | BALI INTEREST PLACES | BALI GOLDEN TOUR\"></a>         \n<p class=\"text-justify\">Bali's own Valley of the Kings is <a href=\"https://www.baligoldentour.com/gunung-kawi-temple.php\" title=\"Gunung Kawi Temple\"><strong>Gunung Kawi Temple</strong></a> in Tampaksiring. This  collection of candi is beautifully situated in a river valley surrounded by  rice fields and jungle. This has been one of our favorite day trips for years. Gunung Kawi Temple is a collection  of ten candi, created to evoke the appearance of temple fronts and designed to  provide residence for the souls of ancient kings. The candi are hewn into the  valley walls on both sides of the Pekerisan River. The Gunung Kawi Temple does  have an interesting history. Inscriptions over each Candi approximate the date  of construction to be in the 11th C. It is believed that each temple served as  a memorial to a deified royalty principally because they are shaped like the  burial towers, or Candi’s, found throughout Central Java.</p>\n<p class=\"text-justify mb-2\"><strong>If you visit What is Gunung Kawi Temple, here's what you need to know</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#location\">Gunung Kawi Temple Location</a></li>\n<li><a href=\"#what-is\">What is Gunung Kawi Temple</a></li>\n<li><a href=\"#ancient\">Ancient Royal Tombs at Gunung Kawi Temple</a></li>\n<li><a href=\"#mythical\">Mythical Story About Gunung Kawi Temple</a></li>\n<li><a href=\"#history\">History Gunung Kawi Temple</a></li>\n<li><a href=\"#path\">Path to Gunung Kawi Temple</a></li>\n<li><a href=\"#geography\">Geography Gunung Kawi Temple</a></li>\n<li><a href=\"#facilities\">Facilities of Gunung Kawi Temple</a></li>\n</ul>\n\n<span id=\"location\">\n<h3 class=\"font-small\">Gunung Kawi Temple Location</h3>\n<p class=\"text-justify\">As for the location of Gunung Kawi Temple, it is located in the village of Tampaksiring, Bali, Gianyar Regency, it is not so difficult to find the location of this place because it is located on a very strategic road. Gunung Kawi Temple is located near Tampak Siring village, around 5 km from well known Tirta Empul Temple. The location is 35 km from Denpasar, city, 50 km from Kuta, and 68 km from Nusa Dua. If you are traveling from Kuta it will take you about 90 minutes to reach this location, and at every crossroads there are directions showing the location of Gunung Kawi Temple. It is still one route from <a href=\"https://www.baligoldentour.com/goa-gajah-temple.php\" title=\"Goa Gajah Temple\" target=\"_blank\">Goa Gajah Temple</a>, Pura Pusering Jagat, Gunung Kawi Temple, and <a href=\"https://www.baligoldentour.com/tirta-empul-temple.php\" title=\"Tirta Empul temple\" target=\"_blank\">Tirta Empul Temple</a>. If you are confused and want to travel here, don't hesitate to contact us <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a>, we will take you to see the uniqueness of this Gunung Kawi Temple with cheap transportation and accompanied by an experienced driver will make your trip to the Gunung Kawi Temple location very interesting. </p>\n </span>\n<span id=\"what-is\">\n<h3 class=\"font-small\">What is Gunung Kawi Temple</h3>\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/gunung-kawi-temple.php\" title=\"Gunung Kawi Temple\">Gunung Kawi Temple</a> is a historical site that has been discovered and preserved until now, because ancient relics contain a lot of historical value that tells of ancient Balinese life, where here it is estimated as the cemetery of ancient royal families with buildings and temples carved into rock cliffs. height adds to the beauty of this tourist destination. The shape of the temple carved into the rock has similarities with the temples on the island of Java. This area preserves many ancient sites, stone sculptures and rock cut structures, especially along the slope of Pakerisan river. Located in a village full with ancient remains of ancient stone sculptures, and even the oldest historical fact on Buddhism is found also around this village. Today due to the rich contains in historical fact a museum has been built before the village of Pejeng, near the temple of Kebo Edan. Within the village of Pejeng to mention a few of them there are some temples with ancient heritages such as Pura Pusering Jagat, Pura Rejuna Metapa, Pura Kebo Edan, Pura Samuan Tiga, Pura Bedugul Kana, and still many other smaller temples that preserves the ancient stone sculptures. Pejeng is a real historical museum. </p>\n </span>\n<span id=\"ancient\">\n<h3 class=\"font-small\">Ancient Royal Tombs at Gunung Kawi Temple</h3>\n<p class=\"text-justify\">Gunung Kawi Temple is an Ancient Royal Tombs and  has two rows of ancient royal tombs on the banks of the Pakerisan River deep in a ravine  overlooked by terraced rice-fields. The holy Pakersian River flows through the  centre of Gunung Kawi cutting the site into two separate sections with a bridge  to connect one side to the other. It is believed the holy waters of the Pakerisan  sanctify Gunung Kawi, and the beauty of the place evokes a relaxing and  peaceful atmosphere. On the east side of the  river are situated five candi which constitute the main group in this complex.  Across the bridge are four candi on the west side. The remaining candi at the  southern end is often referred to as the ‘tenth tomb’. At the bottom of the  stairway and to your right-hand side through a small field (about one kilometer)  is where the tenth tomb is located. But in Java they are  free standing whilst those found at Gunung Kawi are actually hewn relief's in  solid rock. While the exact origin of the candi is unknown, there is evidence to  suggest that the first set of five were built to honor King Anak Wungsu, whose  rule over central and east Bali extended from AD 1050 to about AD 1080. It is  possible that one was built for him and the other four for his wives, who would  have ceremonially committed suicide after his death</p>\n </span>\n  <div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/gunung-kawi-temple.php\"><img src=\"images/bali-interest-place/gunung-kawi-temple-1.jpg\" alt=\"Pathway to Gunung Kawi Temple | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width mb-3\" title=\"Pathway to Gunung Kawi Temple | Gianyar Places of Interest | Bali Golden Tour\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/gunung-kawi-temple.php\"><img src=\"images/bali-interest-place/gunung-kawi-temple-2.jpg\" alt=\"Surround View at Gunung Kawi Temple | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width mb-3\" title=\"Surround View at Gunung Kawi Temple | Gianyar Places of Interest | Bali Golden Tour\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/gunung-kawi-temple.php\"><img src=\"images/bali-interest-place/gunung-kawi-temple-3.jpg\" alt=\"Candi at Gunung Kawi Temple | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width mb-3\" title=\"Candi at Gunung Kawi Temple | Gianyar Places of Interest | Bali Golden Tour\"></a></div>\n</div>\n<span id=\"mythical\">\n<h3 class=\"font-small\">Mythical Story About Gunung Kawi Temple</h3>\n<p class=\"text-justify\">As for there are many legend stories about this <a href=\"https://www.baligoldentour.com/gunung-kawi-temple.php\" title=\"Gunung Kawi Temple\">Gunung Kawi Temple</a> site, there are historical stories circulating in the community. The legend to this  amazing place is intriguing. It is believed that the mythical giant Kebo Iwo  carved out all of the ancient tombs in one night with his fingernails. There are 3 temples  which so called the name as Gunung Kawi in Bali those are Gunung Kawi in Sebatu  countryside, Gunung Kawi Temple in Keliki countryside and Gunung Kawi Temple in  Babitra countryside. Behind the small temple  you can find a couple of meditation caves, which indicates that this is a  pre-Hindu place where monks and pilgrims came together to meditate. Kebo Iwa is a Balinese who has extraordinary supernatural powers, so the kings in Bali are very afraid of him, with his magic he protects Bali from several attacks from outside kingdoms who want to conquer Bali. Those are some of the legendary stories circulating in the community, for the truth or not, it is up to us to react to them. The Gunung Kawi Temple is proof that the ancient kingdom had a different burial system for the royal family where a special tomb was made here for the royal family.</p>\n </span>\n\n<span id=\"history\">\n<h3 class=\"font-small\">History Gunung Kawi Temple</h3>\n<p class=\"text-justify\">Gunung Kawi Temple if we see from the name we know today, it might be the possibility of translation \"Mountain\" as a \"Gunung\" and  \"Kawi\" as \"Poet\", so Gunung Kawi can be meant the mountain of poet. The river that forms the ravine which slope is cut for the temple is Pakerisan river, kris means Balinese long blade or knife. What is actually referred by the name is not clear until now. But we can draw conclusions from some of the historical relics found such as inscriptions that tell about the history of ancient times and also combine them with stories circulating in the local community and look for a middle point to find out what exactly <a href=\"https://www.baligoldentour.com/gunung-kawi-temple.php\" title=\"Gunung Kawi Temple\">Gunung Kawi Temple</a> is.</p>\n<p class=\"text-justify\">Who was the king monumentalized here? is un-answered question until now, except based on highly decorative writing of inscription called \"Quadrangular Kadiri writing style\" The influence of Kadiri kingdom to Bali was only arrived around 1227 AD under the king Kertanegara. While the date carved at the stone sculpture on Mount Panulisan with the same style mentioned the dates 1011 AD, 1074 AD, and 1077 AD. While the period between 989 AD to 1001 AD was the rule of king Udayana Warmadewa with his Queen Mahendradatta. In their charters it is mentioned that king Udayana was deified at \"Banyu Wka\", and his Queen Mahendradatta was deified at Buruan which is already identified, and only Banyu Wka is not identifiable until today, and archaeologists supposed that Banyu Wka is Gunung Kawi, as Banyu means water, and Wka means clear or clean, so he must have been deified at a river with very clean water, yet an ancient monument just renovated is Pura Mangening which also refers the name of ening or clear. The problem is the complex of the temple is not big, only one stone shrines with small zone. If we compared with his Queen monument in Buruan it makes sense that the king would not need big complex to commemorate himself. </p>\n<p class=\"text-justify\">So who was monumentalized at Gunung Kawi? Some archaeologists believed that was the son of Udayana, either king Marakata Pangkajasthana or Anak Wungsu. The rule of Marakata is not known much and there is not many record about his government. Different from Anak Wungsu who issued many inscriptions and he was a diligent king in making every records which lead an idea that he was a great king just like his father king Udayana. With the length of time of ruling that was from 1049 AD to 1077 AD can be a proof that during his rule the condition of the society was good, and it was not impossible he was respected by their whole people. As the fact of many great king in Indonesia that commemoration with candi or sculpture was a normal way the people to honor their king who was able to bring the welfare for the society. In this case writer wish to believe that Gunung Kawi Temple has been dedicated for the great name of king Anak Wungsu.</p>\n </span>\n <span id=\"path\">\n<h3 class=\"font-small\">Path to Gunung Kawi Temple</h3>\n<p class=\"text-justify\">GGunung kawi temple is a tourist destination to see historical relics of ancient times, when you arrive at the parking location you will walk by foot from the parking area, walk a bit far from the parking lot to the location, and arrive at the entrance ticket location, the journey continues again by descending the stairs with more then 100 steps down, the journey down the stairs is a bit tiring, but it is very much worth the scenery you will see here. On the way down the stairs you can also see the scenery around which is unspoiled, there are rice fields owned by local residents here, and you will arrive at a small river, here there is a bridge to cross the river, after passing the river you will arrive at the historic site of Gunung Kawi Temple Here, you will see high rock cliffs carved with temple carvings which when viewed are somewhat similar to temple carvings found on the island of Java. Enjoy the beauty of Gunung Kawi with the cool air here, it will make the atmosphere around this site very pleasant</p>\n </span>\n <span id=\"geography\">\n<h3 class=\"font-small\">Geography Gunung Kawi Temple</h3>\n<p class=\"text-justify\">The people today consider this complex as part of a temple which was constructed much later time. See from the history it is not part of a temple in the meaning of worshipping the Hindu God, but having the relation with personal deification of a king. The whole complex consist of 5 smaller complexes, and including the temple are 6 complexes. Two complexes at the east slope of the river and 3 complexes are on the west slope. Two complexes facing each other separated by the river are identified as belong to the king and his Queen or concubines. The complex for the king consist of 3 rock cut candis and the complex for the Queen consist of 4 rock cut candis. It is hard to understand that only the candi for the king made in 3. It might be the king was with his 2 principal consorts, and the 4 candis across the river were only for his other concubines. At the door of the candi for the king is mentioned in a inscription of the king died at Jalu. Jalu can mean kris or taji, a sharp small blade armed for the cock fighting. </p>  \n</span>\n\n <span id=\"facilities\">\n<h3 class=\"font-small\">Facilities of Gunung Kawi Temple</h3>\n<p class=\"text-justify\">The facilities at the <a href=\"https://www.baligoldentour.com/gunung-kawi-temple.php\" title=\"Gunung Kawi Temple\">Gunung Kawi Temple</a> tourist destination are very complete, so that it becomes a historical tourist destination that is very often visited in this Ubud village, where there is a very large parking area, so you don't need to be confused anymore to find a parking space here. , there is a drink and snack shop in the parking lot, you can buy here if you are thirsty and rest at the stalls located here. Along the road leading to Gunung Kawi Temple there are several shops left and right of the road selling various kinds of handicrafts that you can take home as souvenirs for your family or partner, there is an entrance ticket counter, where you will wear a scarf if you go to the temple. Gunung Kawi Temple, because this place is sacred to the local community, so you will use a scarf to honor the existence of this Gunung Kawi Temple site, and this scarf is free, provided by the administrator of this Gunung Kawi Temple. So don't hesitate anymore if you visit Gunung Kawi Temple with complete facilities, it will make your <a href=\"https://www.baligoldentour.com\" title=\"Bali Tours\">Bali Tours</a> very enjoyable</p>\n</span>"
]