[
  "<h1 class=\"text-uppercase\"><a href=\"https://www.baligoldentour.com/jagatnatha-temple.php\" title=\"Jagatnatha Temple\">Jagatnatha Temple</a></h1>\n<h2 class=\"text-uppercase\"><a href=\"https://www.baligoldentour.com/jagatnatha-temple.php\" title=\"Jagatnatha Temple is Beautiful Balinese Hindu Temple Located in The Center of Denpasar City\">Jagatnatha Temple is Beautiful Balinese Hindu Temple Located in The Center of Denpasar City</a></h2>\n<a href=\"https://www.baligoldentour.com/jagatnatha-temple.php\"><img src=\"images/bali-interest-place/jagat-natha-temple-bali-golden-tour.jpg\" alt=\"Jagat Natha Temple | Bali Interest Place | Bali Golden Tour\" width=\"1200\" height=\"500\" class=\"auto-width mb-3\" title=\"Jagat Natha Temple | Bali Interest Place | Bali Golden Tour\"></a>\n\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/jagatnatha-temple.php\" title=\"Bali Jagatnatha Temple\"><strong>Bali Jagatnatha Temple</strong></a> is a beautiful Hindu temple situated in the center of Denpasar City that is the biggest Hindu temple in the capital city of Bali Province. Jagat natha Temple built in east of Puputan Badung square garden is a public shrine to worship for Ida Sang Hyang Widhi Wasa (call for Hindu god). It is strategically located on Major Wisnu Street that is very easy reached from any directions as well as famous temple and appointed as a tourist destination in Denpasar City. Jagat natha Temple have many visited by the Hindu people especially during the Hindu Holiday season including full moon. It is a unique experience to see a temple in the city center with all its beauty and if you want to pray here, you can wear traditional Balinese clothes and buy offerings that can be purchased at the shop in front of the temple and a very unique experience to take a closer look at the Jaganatha temple which is located in the center of Denpasar city.</p>\n  <p class=\"text-justify mb-2\"><strong>If you visit Jagatnatha Temple , here's what you need to know</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#location\">Location of Jagatnatha Temple</a></li>\n<li><a href=\"#history\">Jagatnatha Temple History</a></li>\n<li><a href=\"#unique\">Unique Jagatnatha Temple</a></li>\n<li><a href=\"#meaning\">Meaning Name of Jagatnatha Temple</a></li>\n<li><a href=\"#facilities\">Jagatnatha Temple Facilities</a></li>\n</ul>\n<span id=\"location\">\n  <h3 class=\"font-small\">Location of Jagatnatha Temple</h3>\n  <p class=\"text-justify\">The location of this Jagatnatha temple is located in the city center, so it is not difficult to find it. Located on Jl. Surapati, Dangin Puri, Kec. Denpasar Tim., Denpasar City, Bali 80232, which is located in front of the Puputan Badung field and next to the Bali Museum, a very strategic place, if you want to drive yourself to this place you can take the benchmark from this Badung Puputan field by using google map will guide you to the location. If you are confused about finding this location, we from Bali Tour are always ready to take you to this place by offering Hire Car and Driver programs at low prices and very satisfying service will make the trip very enjoyable, enjoy your holiday in Bali by visiting Jagatnatha Temple which is located in the center of Denpasar city</p>\n  </span>\n  <span id=\"history\">\n  <h3 class=\"font-small\">Jagatnatha Temple History</h3>\n  <p class=\"text-justify\"> Beginning on February 5, 1963, at that time, Anak Agung Bagus Sutedja, who was the governor of Bali, agreed to the idea of ​​constructing the Jagatnatha Temple, and then on January 1, 1965, he asked Anak Agung Ketut Anggara from Banjar Belong, Denpasar, to make a drawing of the building at once. led construction experts called undagi in Bali to work on the construction. When the events broke out on September 30, 1965, the profession of development was hampered and on July 28, 1967, it was resumed by laying the foundation for the Padmasana building in the form of Bedawang Nala and gradual construction was carried out and on October 15, 1967 the construction had reached the middle and finally on December 13, 1967. The whole Padmasana building of this Jagatnata Temple has been completed. Which was continued on February 5, 1968, the construction of Candi Bentar was completed. Finally, the entire complex of the Jagatnatha Temple was completed and inaugurated on May 13, 1968, which coincided with the full moon day and held a Melaspas ceremony to clean and purify the temple. So starting on that day many residents of Denpasar and also outside the city worship at this Jagatnatha temple.</p>\n  </span>\n  <span id=\"unique\">\n  <h3 class=\"font-small\">Unique Jagatnatha Temple</h3>\n<p class=\"text-justify\">Jagatnatha Temple was built with a position facing west towards Mount Agung, which is believed that Mount Agung is the palace of the gods. The courtyard of this Jagatnatha Temple is quite wide, different from other temples that use the Tri Mandala concept which is divided into 3 pages, in contrast to this Jagatnatha Temple which only has one page, namely the Padmasana Temple area. This Jagatnatha temple has a uniqueness that we can see when we enter, where the uniqueness is found in the Padmasana temple which has a height of 15 meters and at the top of the Padmasana there is a picture of Acintya which is a symbol of the manifestation of God, which was once covered in gold and had disappeared, stolen around 1981. Besides Padmasana, there are two temples located on the left and right of Padmasana, namely on the left is the shrine of Ratu Niang and on the right is the shrine of Dalem Karang. Like temples in general, there are also Bale Kulkul (wooden bell), Pamiyosan, Bali paselang, Bali Gong, Candi Bentar and Kori Agung. Its most visible uniqueness is the height of the Padmasana Temple as the main temple in the Jagatnatha Temple area which is made of white natural stone and above it is shaped like a throne with Balinese carvings in every corner which adds to the beauty of this Jagatnatha Temple, if you come here you can take the time. yourself to take pictures with this padmasana and the resulting photos are very instagramable</p>\n</span>\n<div class=\"row\">\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/jagatnatha-temple.php\"><img src=\"images/bali-interest-place/jagatnatha-temple-1.jpg\" alt=\"Padmasana at Jagatnatha Temple | Denpasar Places of Interest | Bali Golden Tour\" width=\"370\" height=\"250\" class=\"full-width\" title=\"Padmasana at Jagatnatha Temple | Denpasar Places of Interest | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Padmasana at Jagatnatha Temple</p></div>\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/jagatnatha-temple.php\"><img src=\"images/bali-interest-place/jagatnatha-temple-2.jpg\" alt=\"Bale Gong at Jagatnatha Temple | Denpasar Places of Interest | Bali Golden Tour\" width=\"370\" height=\"250\" class=\"full-width\" title=\"Bale Gong at Jagatnatha Temple | Denpasar Places of Interest | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Bale Gong at Jagatnatha Temple</p></div>\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/jagatnatha-temple.php\"><img src=\"images/bali-interest-place/jagatnatha-temple-3.jpg\" alt=\"Bale Kul Kul at Jagatnatha Temple | Denpasar Places of Interest | Bali Golden Tour\" width=\"370\" height=\"250\" class=\"full-width\" title=\"Bale Kul Kul at Jagatnatha Temple | Denpasar Places of Interest | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Bale Kul Kul at Jagatnatha Temple</p></div>\n</div>\n<span id=\"meaning\">\n<h3 class=\"font-small\">Meaning Name of Jagatnatha Temple</h3>\n<p class=\"text-justify\">The name of Jagatnatha Temple is not like other temples on the island of Bali which takes its name from the place where the temple stands, such as the Besakih Temple, Ulun Danu Beratan Temple, Uluwatu Temple and others. But the name Jagatnatha is taken from two syllables consisting of the word \"Jagat\" which means \"The World, the Universe\" and the word \"Natha\" which means \"Protection\", so it can be interpreted that the name Jagatnatha is the Protection of the World or the Universe\" and literally you could say if this Jagatnatha Temple is a temple that functions to ask for protection from the universe which is a manifestation of Ida Sang Hyang Widi Wasa (God in Balinese Hindus) so that he is always given safety and health always.. The ceremony in this Jagatnatha Temple is the same as the ceremonies found in other temples which distinguishes this Jagatnatha Temple is more universal in nature, where every Galungan and Kuningan holidays will be crowded by Hindus in Denpasar where he cannot go home to pray so he can pray here, so if it coincides with the Hindu holiday, many Hindus cannot return home for some reason, then they will pray here.</p>\n</span>\n<span id=\"facilities\">\n<h3 class=\"font-small\">Jagatnatha Temple Facilities</h3>\n<p class=\"text-justify\">As one of the tourist destinations located in the city of Denpasar, Jagatnatha Temple has very complete facilities for Hindus who want to pray here and also for tourists who want to visit or want to pray here. There is a very large parking area around the Puputan Badung field, and there is also a toilet that you can use and also for those who want to enter the temple you must use a scarf as a mandatory means to enter the sacred area, and if you want to pray here you must bring canang (offering) and you can buy it at the shop in front of this Jagatnatha Temple. After visiting, you can walk around this puputan field and see the activities of the people in Denpasar who come here to rest and exercise. A spiritual experience as well as entertainment for you by visiting the sacred Hindu temples and also relaxing in this Badung Puputan field. A very complete facility that will pamper guests and make guests feel at home visiting this Jagatnatha Temple</p>\n</span>"
]