[
  "<h1 class=\"text-uppercase\"><a href=\"https://www.baligoldentour.com/kecak-dance.php\" title=\"Bali Kecak and Fire Dance\">Bali Kecak and Fire Dance</a></h1>\n<h2 class=\"text-uppercase\"><a href=\"https://www.baligoldentour.com/kecak-dance.php\" title=\"Bali Kecak and Fire Dance Is Traditional Balinese Dance with Story From Mythical Fragment Ramayana\">Bali Kecak and Fire Dance Is Traditional Balinese Dance with Story From Mythical Fragment Ramayana </a></h2>\n<a href=\"https://www.baligoldentour.com/kecak-dance.php\"><img src=\"images/bali-information-site/kecak-dance-tours-bali-golden-tour.jpg\" alt=\"KECAK DANCE | BALI INFORMATION SITE | Bali Golden Tour\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"KECAK DANCE | BALI INFORMATION SITE | Bali Golden Tour\"></a>\n<p class=\"text-justify\"><strong><a href=\"https://www.baligoldentour.com/kecak-dance.php\" title=\"Bali Kecak and Fire Danc Performance\">Bali Kecak and Fire Dance Performance</a></strong>, Not known exactly where Kecak dance originated and which was first developed, but there are some kind of agreement on the Balinese Kecak was first developed into a performing arts in the village of Bona, Gianyar, as additional knowledge Kecak was originally a song or music that is resultant from a combination sounds that make up melodies that are usually used to accompany the sacred dance Sanghyang. And can only be staged in the temple. Then in the early 1930s by artists from the village of Bona, Gianyar trying to develop a Kecak dance by taking the story of Ramayana who danced as a substitute for Sanghyang Dance so this dance could eventually be displayed in public as a performance art. Part of the Ramayana story in which the first is taken as Goddess Sita was abducted by King Ravana.</p>\n<p class=\"text-justify mb-1\"><strong>All you need to know about Kecak and Fire Dance</strong></p>\n<ul class=\"mb-3\">\n<li><a href=\"#location\">Kecak and Fire Dance Location</a></li>\n<li><a href=\"#development-kecak\">The Development of Kecak Dance in Bali</a></li>\n<li><a href=\"#pattern-kecak\">Pattern of Kecak and Fire Dance</a></li>\n<li><a href=\"#story-kecak\">Kecak and Fire Dance Performance Story</a></li>\n<li><a href=\"#how-to-watch\">How To Watch The Kecak and Fire Dance</a></li>\n</ul>\n\n<span id=\"location\">\n<h3 class=\"font-small\">Kecak and Fire Dance Location</h3>\n<p class=\"text-justify mb-2\">The location of the Kecak and Fire Dance performances is almost in every very strategic area where this show is located, such as in Ubud, Tanah Lot and the most famous is its location in Uluwatu. So if you want to see this kecak and fire dance show maybe you can see the location of your hotel and look for the closest performance venue so that it will make traveling time not so long, with a very strategic location, it's no wonder that this kecak and fire dance has always been a favorite. one of the tourist destinations for the show that is very often watched and this show only starts in the afternoon, so the atmosphere of watching the kecak and fire dance performances becomes even more enjoyable. The locations of the Kecak and fire dances that you can visit are as follows:</p>\n<ol class=\"mb-3\">\n  <li class=\"text-justify mb-2\"><strong>Ubud</strong>: The location of this Kecak dance performance is located in the Ubud area, which is precisely at Pura Dalem Taman Kaja, with the address: Jl. Sri Wedari No.12, Ubud, Ubud District, Gianyar Regency, Bali 80571. If you happen to be in Ubud and don't want to travel far to watch this Kecak dance, you can visit the Pura Dalem Taman Kaja which is located in Ubud Village, as for the starting hours This Kecak show starts at 19.00 - 20.00 pm with the same storyline being delivered, namely from the Ramayana story with the story of Hanoman who helps Rama in freeing Sinta from Ravana.</li>\n  <li class=\"text-justify mb-2\"><strong>Tanah Lot</strong>: The next location is at the <a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\" title=\"Tanah Lot Temple\">Tanah Lot Temple</a> tourist destination, where the location of the show is close to the Tanah Lot temple which is so beautiful and enchanting that it makes the show very enjoyable, with the address at Tanah Lot Bali, Beraban, Kec. Kediri, Tabanan Regency, Bali 82171, the location of the performance theater is very good so it will make the viewing atmosphere very enjoyable, enjoy this kecak show while visiting the Tanah Lot temple which is so beautiful with sunset views, while the show time starts at 18.00 - 19.00 pm, With the same storyline, namely from the Ramayana fragment</li>\n  <li class=\"text-justify mb-2\"><strong>Uluwatu</strong>: This location is the most popular and visited, because it is very strategically located next to the <a href=\"https://www.baligoldentour.com/uluwatu-temple.php\" title=\"Uluwatu Temple\">Uluwatu Temple</a> which is very charming, besides seeing the Kecak dance performance which is very beautiful, you can also see the sunset from the theater here, which is where the theater is located not far from the Uluwatu temple which is very famous for its beautiful sunsets, and now there are 2 sessions in Uluwatu, where session 1 starts from 18.00 - 19.00 pm and session 2 starts at 19.00 - 20.00 pm with a duration of 1 hour full of joy in watching this dance, The storyline that is delivered is also the same, namely about the story of the mythical Ramayana</li>\n  <li class=\"text-justify mb-2\"><strong>Melasti Beach</strong>: this location is new and is located on Melasti Beach in the Nusa Dua area, although this location is new, it is already busy with visitors watching the Kecak dance, with the location next to the beach, the atmosphere for watching the Kecak dance is very enjoyable and the show hours are the same as the previous ones which is staryt from 18.00 - 19.00 pm, while watching the Kecak dance, you can enjoy the view of the sunset here, a very pleasant experience</li>\n\n</ol>\n<span id=\"development-kecak\">\n<h3 class=\"font-small\">The Development of Kecak Dance in Bali</h3>\n<p class=\"text-justify\">Kecak Dance in Bali continues to change and progress since the 1970's. Developments can be seen is in terms of story and staging.  In terms of the story for staging not only sticking to one part of the Ramayana, but also other parts of the story of the Ramayana. Then in terms of staging also began to experience growth not only found in one place likes the Village Bona, Gianyar, but also other villages in Bali began to develop Kecak dance so all regions in Bali there are dozens of Kecak groups whose members are usually members of the Banjar. Activities such as Kecak dance festival is often held in Bali well by government or by a school of art in Bali. As well as from the amount of much dancers who ever performed in the Kecak dance was recorded in 1979 which involved 500 dancers. At that time kecak performed by taking the story from the Mahabharata. But this record was broken by Tabanan regency government that organizes colossal Kecak dance with 5000 dancers on September 29, 2006, at Tanah Lot, Tabanan, Bali. The record is very fantastic, where in performing the performance involves hundreds of dancers who are truly stunning, you could say that the Kecak dance is in great demand by tourists who want to see traditional Balinese dances.</p>\n</span>\n<div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/kecak-dance.php\"><img src=\"images/bali-information-site/kecak-dance-ubud.jpg\" alt=\"Kecak and Fire Dance in Ubud | Pura Dalem Taman Kaja | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width\" title=\"Kecak and Fire Dance in Ubud | Pura Dalem Taman Kaja | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Kecak and Fire Dance in Ubud</p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/kecak-dance.php\"><img src=\"images/bali-information-site/kecak-dance-tanah-lot.jpg\" alt=\"Kecak and Fire Dance in Tanah Lot | Tanah Lot Temple | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width\" title=\"Kecak and Fire Dance in Tanah Lot | Tanah Lot Temple | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Kecak and Fire Dance in Tanah Lot</p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/kecak-dance.php\"><img src=\"images/bali-information-site/kecak-dance-uluwatu.jpg\" alt=\"Kecak and Fire Dance in Uluwatu | Uluwatu Temple | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width\" title=\"Kecak and Fire Dance in Uluwatu | Uluwatu Temple | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Kecak and Fire Dance in Uluwatu</p></div>\n</div>\n<span id=\"pattern-kecak\">\n<h3 class=\"font-small\">Pattern of Kecak and Fire Dance</h3>\n<p class=\"text-justify\">As a Kecak dance performance is supported by some very important factor, and in the Kecak dance performance presents the dance as an introduction to the story, of course, vital music to accompany the dancers movements. But in the Kecak Dance, the music generated from a combination sounds of members \"cak\" which were about 50-70 people all of them will make music in akapela. A person will act as a leader who gives the tone early, someone else acting as a suppressor in charge of pressure high or low  tone, someone else acting as a solo singer, and someone else will act as the mastermind behind that to deliver the story. the dancers  in the Kecak dance motion should not follow the movement of dance accompanied with gamelan. So in the Kecak dance this gestures of the dancer is more relaxed because the main priority is the storyline and the sound mix. It is a very meaningful experience in watching a very beautiful balinese dance performed by the dancers very nicely and the story is given a comedy spice so that it will not be so boring at all, with a very good and funny storyline that will make this show even more enjoyable very</p>\n</span>\n\n<span id=\"story-kecak\">\n<h3 class=\"font-small\">Bali Kecak and Fire Dance Performance Story</h3>\n\n<p class=\"text-justify\">What makes the Kecak special is that the accompanying music is provided by the human voice, the gamelan suara, a choir of a hundred men or more sitting in concentric circles, swaying, standing up, lying prone as the story develops.Amongst the swaying masses the voices of the storytellers can be heard telling the unfolding tale. The story is a fragment from the Ramayana, the Hindu epic which finds its expression in many forms, not only in dance, but also in painting and carving. Prince Rama, heir to the throne of the kingdom of Ayodya, and his wife Sita have been banished from the kingdom by King Dasarata as a result of trickery by Rama's stepmother. The story begins with the arrival of Rama and Sita accompanied by Rama's brother Laksmana in the forest of Dandaka.</p>\n<p class=\"text-justify\">The trio have been observed by the demon Rahwana, King of Alengka, who lusts after the beautiful Sita. Rahwana sends his prime minister Marica to try and isolate Sita so that Rahwana can kidnap her. Marica's magical powers turn him into a golden deer and he enters the forest and when the Sita sees the golden deer she is so enchanted by it that she asks Rama to capture it for her. Rama chases after the deer leaving his brother Laksamana behind with strict instuction to protec Sita. When Sita thinks she hears a cry for help from Rama she forces Laksamana to go after Rama by accusing him of cowardice and he goes off to help Rama with great reluctance after drawing a magic circle on the ground and telling Sita the she should not under any circumstance step out side the circle.</p>\n\n<p class=\"text-justify\">Sita, left alone in the forest becomes an easy prey to the trickery of Rahwana who has disguised himself has an old periest and bags Sita for some food as he is cold and hungry. Sita falls for for his trick, she steps outside the circle to give the old priest some food and rahwana grabs her and takes her to his palace.Once back in his palace in Alengka, Rahwana tries everything he can to seduce Sita without any luck. In the palace of Alengka, Sita pours out her heart about her cruel fate to Rahwana's niece Trijata, when Hanoman appears telling her that hi is Rama's envoy and proving it by showing her Rama's ring. Sita gives Hanoman a hairpin to show she is still alive and sand him back to Rama with a massage to come to her rescue.</p>\n<p class=\"text-justify\">In the meantime Rama and Laksamana accompanied by Tualen are wandering in the forest looking for Sita when Meganada, Rahwana's son, appeares and engages Rama and Laksamana in Battle. Meganada uses his magic powers and shoots of an arrow which magically turns in to a dragon which overpowers Rama and Laksamana and they are trussed up in ropes. The bird Garuda, King of all the bird, a good friend of King Dasarata, has observed trouble Rama is in from high up in the sky and comes to the rescue freeing the brothers from the ropes. Rama and Laksamana continue on their way to rescue Sita and are joined by Sugriwa, king of the monkeyes, and his monkeys army. This fragmen of the Ramayana come to an end with the bittle between Sugriwa and his Monkeys Army and Meganada and his Demon Army which ends with the defeat of Meganada.</p>\n</span>\n<span id=\"how-to-watch\">\n<h3 class=\"font-small\">How To Watch The Kecak and Fire Dance</h3>\n<p class=\"text-justify\">The Kecak and fire dance dance is a dance performance that is only performed in the afternoon with dozens of dancers, where the sound of music in the Kecak dance is mostly performed by the dancers who make \"cak\" sounds in tandem, so that the sound becomes louder. very beautiful to be with, if you plan to watch this kecak dance you can visit one of the closest places from your hotel, but if you want to watch the kecak dance and also see the sunset view, we <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a> offer you half day trip in the program of <a href=\"https://www.baligoldentour.com/bali-uluwatu-tour.php\" title=\"Half Day Uluwatu Sunset Tour\">Half Day Uluwatu Sunset Tour</a> package which where you will visit <a href=\"https://www.baligoldentour.com/uluwatu-temple.php\" title=\"Uluwatu Temple\">Uluwatu Temple</a> with its phenomenally beautiful sunset beauty and also watch the Kecak and Fire Dance which starts at 18.00 pm at the theater near Uluwatu Temple, so that when you are in the theater you can see the sunset and also the very beautiful Uluwatu Temple. very beautiful, and after the show you can enjoy try to have dinner at jimbaran beach or you can also go directly to the hotel by bringing a very impressive experience in watching this Kecak and Fire Dance Performance</p>\n   </span>\n</span>"
]