[
  "<h1><a href=\"https://www.baligoldentour.com/kehen-temple.php\" title=\"KEHEN TEMPLE\">KEHEN TEMPLE</a> </h1>\n<h2><a href=\"https://www.baligoldentour.com/kehen-temple.php\" title=\"KEHEN TEMPLE OR TEMPLE OF FIRE IS BEAUTIFUL TEMPLE WITH CANDI KURUNG IN ENTRANCE GATE\">KEHEN TEMPLE OR TEMPLE OF FIRE IS BEAUTIFUL TEMPLE WITH CANDI KURUNG IN ENTRANCE GATE</a></h2>\n<a href=\"https://www.baligoldentour.com/kehen-temple.php\"><img src=\"images/bali-interest-place/bali-kehen-temple.jpg\" alt=\"KEHEN TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"KEHEN TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n\n\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/kehen-temple.php\" title=\"Kehen Temple\"><strong>Kehen Temple</strong></a> is a Hindu temple located in Bangli village, is a Hindu holy temple which is also called the Hyang Api temple. It has a lot of uniqueness that can be seen from this Kehen Temple from its very strategic location and also the entrance using Candi Bentar with Balinese carvings and looks like the Khayangan Jagat Temple in general. As for what looks different from other temples, the entrance to Kehen Temple is using Candi Kurung and being one of the photo objects that is really fantastic where the photos produced with the Kurung Temple background are so beautiful to look at and very instagrammable. In addition to the beauty of the Kurung Temple located in Kehen Temple, here you can also see another sight that is no less interesting, namely the view of the Bangli hill that stretches to the north of Kehen Temple, a view that is so enchanting and will spoil the eyes of the beholder.</p>\n<p class=\"text-justify mb-2\"><strong>If you visit Kehen Temple, here's what you need to know</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#location\">Location of Kehen Temple</a></li>\n<li><a href=\"#ancient\">Classified as an Ancient Temple in Bali</a></li>\n<li><a href=\"#history\">History of Kehen Temple</a></li>\n<li><a href=\"#association\">Association Kehen Temple with Bangli Village</a></li>\n<li><a href=\"#uniqueness\">The Uniqueness of Kehen Temple</a></li>\n<li><a href=\"#structure\">Kehen Temple Structure</a></li>\n<li><a href=\"#ceremony\">Ceremony at Kehen Temple</a></li>\n<li><a href=\"#about\">About Kehen Temple</a></li>\n</ul>\n<span id=\"location\">\n<h3 class=\"font-small\">Location of Kehen Temple</h3>\n<p class=\"text-justify\">The location of the Kehen Temple is in Cempaga Village, Bangli District, Bangli Regency. Meanwhile, if you depart from Denpasar, it will take about 2 hours to travel by traveling about 43 kilometers. If you plan to come here, you can use the help of google maps to guide you here, but if you don't want to bother looking for the location of this Kehen Temple, we from <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\"><strong>Bali Tour</strong></a> provide transportation for you to go to Kehen Temple at a relatively cheap price and of course very good service. very satisfying. Accompanied by a friendly and experienced driver will make the trip to Kehen Temple a very pleasant one. The location is in the highlands, and Bangli also has tourist attractions that are no less interesting, some of the attractions in Bali can be seen here <a href=\"https://www.baligoldentour.com/places-of-interest-bangli.php\" title=\"Bangli Places of Interest\"><strong>Bangli Places of Interest</strong></a>, besides visiting Kehen Temple you can also visit tourist attractions in Bangli so you save traveling time</p>\n\n</span>\n<span id=\"ancient\">\n<h3 class=\"font-small\">Classified as an Ancient Temple in Bali</h3>\n<p class=\"text-justify\">Bangli Regency was once the center of the kingdom known by the same name. The Bangli Kingdom is one of the nine kingdoms in Bali. The name Bangli comes from bang giri, which means \"red forest\" or \"red mountain\". Bangli Regency was founded by the Gelgel Kingdom of the Majapahit dynasty. Based on the writings contained in the ancient inscriptions, it can be concluded that Kehen Temple is included in the category of the oldest temples on the island of Bali and this can be seen from the findings of several inscriptions found in Kehen Temple. Kehen Temple is located at an altitude of 483 meters above sea level, precisely at the foot of the southern part of Bangli Hill. Because it is located at a height, this temple has a very charming view</p>\n</span>\n<span id=\"history\">\n<h3 class=\"font-small\">History of Kehen Temple</h3>\n<p class=\"text-justify\">If we talk about the history of this Kehen Temple, it can be concluded that this Kehen Temple has been around for a very long time and can be compared to other ancient temples in Bali. As for the name of the previous Kehen temple, Hyang Kehen can be seen from the inscriptions found. Kehen Temple is mentioned in three copper inscriptions found on the island of Bali and mentions about this temple three times namely in 9th AD, early 11th AD and 13th AD. The three inscriptions in copper form have been read by Dr. P.V. Van Stain Callenfels, while the explanation with the original text has been published in the book \"Epigraphina\" in 1926.</p>\n<ol>\n<li class=\"mb-2\"><strong>Inscription I:</strong> The first inscription is estimated from the IX century mentions Hyang Api, Hyang Karinama, Hyang Tanda, and the names of monks. The language is Sanskrit. The first inscription consisting of 18 lines and in ancient Balinese language mentions the name “Hyang Karinama”… Hyang Api in Simpat Bunut village (“The hermitage at Hyang Karinama don't have Hyang Api… at Wanua di Simpat Bunut – Hyang Tanda”). This inscription also mentions the names of the monks. This first inscription is not numbered, but Dr. R. Goris classifies it into the Saka year which ranges from 804 - 836 (between the years 882 - 914 AD.</li>\n<li class=\"mb-2\"><strong>Inscription II:</strong> The second inscription uses the Old Javanese language, mentioning \"The Senapati Kuturan\". The second inscription, which is only the last sheet, consists of 10 lines and is in Old Javanese language, it mentions the names of Senapati Kuturan, Saphata and the names of the king's employees. This second inscription is also without a year number, but Dr. R. Goris classifies it into the Saka year between 938 - 971 (between the years 1016 - 1049 AD).</li>\n<li class=\"mb-2\"><strong>Inscription III:</strong> The third inscription contains the ancient Javanese language, the number Saka year 1126, AD 1204 mentions the name of Hyang Kehen who ruled in that year was Bhatara Guru Sri Adhikunti Ketana. The third inscription in the form of copper mentions to the residents around the third that a ceremony took place at the Kehen Temple in Saka 1126 (1204 AD) which contains the name of King Sri Dhanadhiraja and his consort Bhatara Sri Dhanadewi. King Sri Dhanadhiraja is the son of king Bhatara Parameswara and the mother of king Bhatara Parameswara is Bhatara Guru Sri Adhikunti. And in this third inscription it states that this Kehen temple is dedicated to Hyang Api (God of Fire) whose name used to be Hyang Kehen Temple.</li>\n\n</ol>\n<p class=\"text-justify\">Of the three inscriptions that mention the name of Pura Kehen, it can be studied etymologically where in subsequent developments the name Hyang Api contained in <strong>the first inscription became Hyang Kehen in the third inscription and subsequently became Kehen Temple today</strong>, then this means that Pura Kehen has existed in Saka between 804 – 836 (between the years 882 – 914 AD). So Kehen Temple already existed at the end of the IX century or the beginning of the X century AD. Where the Kehen Temple is included in a row of ancient temples on the island of Bali</p>\n</span>\n<span id=\"association\">\n<h3 class=\"font-small\">Association Kehen Temple with Bangli Village</h3>\n<p class=\"text-justify\">The existence of the Kehen Temple which has an attachment to the history of Bangli Village where this history is concluded based on the inscription No. 705 Pura Kehen C Inscription which states that in the year Saka 1126 Wesaka, the period of tithi daca mi sukla forced, ma, Kaca, waraning Krulut which means May 10 1204 AD mentions that King Ida Bhatara Guru Sri Adhikunti Ketana as King of the city of Bangli issued a Bhsama or an order which said that all residents of the Bangli village area to return to their villages.</p>\n</span>\n<span id=\"uniqueness\">\n<h3 class=\"font-small\">The Uniqueness of Kehen Temple</h3>\n<p class=\"text-justify\">The Kehen Temple has its own uniqueness among other Hindu temples on the island of Bali, where this uniqueness makes the Kehen Temple attractive for foreign and domestic tourists to visit. The uniqueness can be seen from the Candi Kurung which is located in the front area and also the bale kulkul located on the banyan tree, and here there are also several statues of ancient relics that are still preserved and as a reminder of the history of this Kehen temple.</p>\n<ol class=\"mb-4\">\n<li class=\"text-justify mb-2\"><strong>Candi Kurung</strong>, where usually most temples in Bali for entrance generally use the Kahyangan Jagat Temple, in contrast to Kehen Temple which uses Candi Kurung. And this candi is located in front of the entrance, and because of the uniqueness of this brackets temple with Balinese carvings that are very unique and very beautiful, many tourists who come here take the time to take pictures with the background of Candi Kurung and the resulting photos are quite instagrammable. For those of you who come to Kehen Temple, you can try to take pictures here as a reminder that you have visited an ancient temple known as the Temple of Fire.</li>\n<li class=\"text-justify mb-2\"><strong>Bale Kul Kul</strong> is usually found in a building specially prepared for Kul Kul, unlike the Kehen Temple where Bale Kul Kul is located on the trunk of a Banyan Tree. The banyan tree that grows very large in the area of ​​​​Kehen Temple is very sacred by the community. The local people strongly believe in the signs that come from this banyan tree, where if the banyan tree trunk is broken then a big event or a disaster will occur. This conclusion is drawn from the many events that have occurred from generation to generation since hundreds of years ago.</li>\n</ol>\n</span>\n<div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/kehen-temple.php\"><img src=\"images/bali-interest-place/bali-kehen-temple-1.jpg\" alt=\"Candi Kurung Front View | Kehen Temple\" width=\"500\" height=\"275\" class=\"full-width mb-3\" title=\"Candi Kurung Front View | Kehen Temple\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/kehen-temple.php\"><img src=\"images/bali-interest-place/bali-kehen-temple-2.jpg\" alt=\"Candi Kurung Back View | Kehen Temple\" width=\"500\" height=\"275\" class=\"full-width mb-3\" title=\"Candi Kurung Back View | Kehen Temple\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/kehen-temple.php\"><img src=\"images/bali-interest-place/bali-kehen-temple-3.jpg\" alt=\"Bali Kulkul at Banyan Tree | Kehen Temple\" width=\"500\" height=\"275\" class=\"full-width mb-3\" title=\"Bali Kulkul at Banyan Tree | Kehen Temple\"></a></div>\n</div>\n<span id=\"structure\">\n<h3 class=\"font-small\">Kehen Temple Structure</h3>\n<p class=\"text-justify\">When it comes to temples, it would be nice if we know the structure of temples in Bali, most of the temples are divided into three interconnected pages, where there is an outer courtyard, a central courtyard and an inner courtyard. And these three pages are very important and have their respective meanings, so every temple in Bali we always find has three pages, like the one in Kehen Temple. The structure of the Kehen temple is like other temples in Bali, where the temple structure is divided into 3 pages which is like below : </p>\n<ol class=\"mb-4\">\n<li class=\"text-justify mb-2\"><strong>The first page</strong> is called Nista Mandala or often called Jaba Sisi (Outer page). Inside the Nista Mandala area, there are several temple buildings such as Bale Gong, sacred stone shrine, Bale Agung, Bale Kulkul, sacred batara shrine sading bingin, sacred batara shrine kebo suih, sacred temple shrine Ratu Mas Ayu Panganten, sacred batara shrine manik aseman</li>\n<li class=\"text-justify mb-2\"><strong>The second page</strong> is called Madya mandala or often called middle jaba. This section separates the first page (nista mandala) from the third page (main mandala). In the Madya Mandala area there are several pelinggih buildings (sacred buildings), namely as follows. Bale Pasangkepan, Bale Puppet, Bale Semar Pegulingan, Pelinggih Batara Sakti Ratu Mas Subandar. Perantenan Area, this building is located in the southwest of the middle mandala. The Perantenan serves as a place to prepare ceremonial offerings and prepare food for the penangkil and the father who arranges for the father to visit the Kehen Temple. Bale pewaregan, Bale Pewaregan itself functions as a place for fathers, pemedek, or penangkil to take food and drinks provided by the temple committee because most of them live far from the temple location.</li>\n<li class=\"text-justify mb-2\"><strong>The third page</strong> is called the third mandala, which is called the main mandala or often called offal. This part is the most sacred and holy due the main temple located inside the third page. The pelinggih building (sacred building) located in the main area of ​​​​the mandala, namely. Bale Penglipuran (Pelinggih Batara Sakti Dahaning Gunung), Pelinggih Batara Sakti Pasek Majambul, Pelinggih Batara Sakti Gede Penarikan, Pelinggih Batara Sakti Taman Sari. Pelinggih Sangran, Pelinggih Batara Sakti Gede Sema, Pelinggih Batara Sakti Mount Kaloka, Pelinggih Batara Sakti Gunung Tengah, Pelinggih Batara Sakti Gunung Sari, Pelinggih Ratu Ngerurah, Pelinggih Batara Sakti Swaring Jagat/Corong Agung, Pelinggih Batara Sakti, Pinggihyang Hyang Kehen, Pelinggih Batara Sakti Hyang Karimana and Pelinggih Batara Sakti Dalem Bujangga, Pelinggih Basis, Bale Peselang, Bale Stage, Pelinggih Batara Sakti Bukit Jati, Pelinggih Batara Sakti Ngurah Sakti, Pelinggih Batara Sakti Gunung Agung, Pelinggih Batara Sakti Maspait, Pelinggih Mantra Tirta, Pelinggih Batara Sakti Gede Pande, Bale Pasamuan Parepen, Bale Pasamuan, Bale Pawedaan, Bale Pidpid, Bale Pesandekan Penyineban Temple is to the south of Kehen Temple. The function of the Penyineban Temple is to store inscriptions.</li>\n</ol>\n</span>\n<a href=\"https://www.baligoldentour.com/kehen-temple.php\"><img src=\"images/bali-interest-place/bali-kehen-temple-4.jpg\" alt=\"KEHEN TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"KEHEN TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n<span id=\"ceremony\">\n<h3 class=\"font-small\">Ceremony at Kehen Temple</h3>\n<p class=\"text-justify\">The Kehen Temple holds a ceremony on a certain day, where the ceremony at Kehen Temple is held based on the Balinese calendar and Balinese year, and there are ceremonies that are routinely carried out every year and there is also a main ceremony held every three years. You can see the details of this Kehen temple ceremony below, if you happen to come on the day of the ceremony, you should not go inside, just from outside, so as not to disturb the ongoing ceremony</p>\n<ol class=\"mb-4\">\n<li class=\"text-justify mb-2\">The ceremony which is routinely held at Kehen Temple every six months (based on the Balinese calendar) is the Piodalan which falls on every Buda Keliwon Wuku Sinta which coincides with the Pagerwesi holiday. This ceremony usually lasts for five days in which every day during the ceremony, all Banjars from the villages of Cempaga, Kawan, Bebelang, Demulih, Penatahan, Tanggahan, Pukuh, Kubu, and Penglipuran provide devotions in turns with the Mepeed event.</li>\n<li class=\"text-justify mb-2\">The main level ceremony is held every three years, on the fifth sasih as the Great Work of Bhatara Turun Kabeh. This ceremony is also called Ngusaba Dewa. The implementation of this ceremony is expected in October 2015 on Purnama Kalima which usually lasts 9 to 11 days. The most important thing at this ceremony is the Melasti ceremony procession where all Pratima, Tapakan and sacred objects in the Loaduan area consisting of about 19 traditional banjars participate together to carry out the Melasti ceremony (usually to Watuklotok Beach, Tirta Sudamala, or Tamansari) with thousands of people and dozens of groups carrying Gambelan with Baleganjur beats will accompany the procession of this ceremony on foot. This ceremonial procession is a portrait of the togetherness of Bangli manners, especially from the customs of the Beratuan Temple of Kehen called Gebog Domas. During the ceremony, the worshiping villages take turns performing sacred dances in the form of Baris Dadap, Baris Perasi, Baris Gowak and Rejang and Pendet dances.</li>\n</ol>\n</span>\n<span id=\"about\">\n<h3 class=\"font-small\">About Kehen Temple</h3>\n<p class=\"text-justify\">This Kehen Temple is estimated to have existed since the megalithic era with the relics of sacred stones which are still considered sacred by the local community, then after the arrival of Danghyang Nirata who brought the temple elbow, then Kehen Temple was built according to the temples in Bali in general and Besides that, it can be seen from the presence of three inscriptions. From the inscription data, it is possible to take a hint that the Hyang Api in the first inscription changed its name to Hyang Kehen. In inscription III, where the name \"Kehen\" means \"Cool, Brazier, Place of Fire\". Likewise, with the belief in the magical religious field, there is a continuation of the worship of the previous natural forces (Hyang Api, Hyang Tanda, and Hyang Karimana) which was then adjusted to the beliefs that developed during the Hindu period into the Tri Murti Gods (God Brahma, Vishnu, Ciwa). The advice of the people of Pakraman Cempaga Village should always maintain and maintain the sanctity and preservation of Kehen Temple as a historical building and also an invaluable spiritual cultural asset for the sustainability of Hindus in Bali.</p>\n</span>"
]