[
  "<h1><a href=\"https://www.baligoldentour.com/kerta-gosa.php\" title=\"BALI KERTA GOSA\">BALI KERTA GOSA</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/kerta-gosa.php\" title=\"BALI KERTA GOSA IS A ANCIENT JUSTICE COURT BUILDING UPON KLUNGKUNG KINGDOM RULE\">BALI KERTA GOSA IS A ANCIENT JUSTICE COURT BUILDING UPON KLUNGKUNG KINGDOM RULE</a></h2>\n\n<a href=\"https://www.baligoldentour.com/kerta-gosa.php\"><img src=\"images/bali-interest-place/kerta-gosa-court-building-bali-golden-tour.jpg\" alt=\"Kerta Gosa | Justices Court Building | Bali Interest Place | Bali Golden Tour\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"Kerta Gosa | Justices Court Building | Bali Interest Place | Bali Golden Tour\"></a>\n\n<p class=\"text-justify\"><strong><a href=\"https://www.baligoldentour.com/kerta-gosa.php\">Bali Kerta Gosa</a></strong> located in Klung kung Regency and use a s justice court palace long time ago. As the former kingdom, if reasonable Klungkung has many a time this is a tourism object. One of them is the Taman Gili in Kerta Gosa, cultural heritage Semarapura Klungkung Palace. Kerta Gosa is a building (bale), which is part of the building complex Semarapura Palace and was built around 1686 by peletak basis of power and the first holder of the throne that is the kingdom of Klungkung Ida I Dewa Agung Jambe. A very suitable tourist attraction and visit if you want to see the beauty and history of the Klungkung kingdom era, here besides seeing the building called Bale Kambang you can also see the beauty of the pool called Gili. By looking at the traditional paintings in Bale Kambang, you will understand the history of the Klungkung kingdom.</p>\n<p class=\"text-justify mb-2\"><strong>Here all you need to know about Kerta Gosa Bali</strong></p>\n<ul class=\"mb-3\">\n<li><a href=\"#history\">History of Kerta Gosa</a></li>\n<li><a href=\"#complex\">Kerta Gosa Complex</a></li>\n<li><a href=\"#name\">The Meaning Name Kerta Gosa</a></li>\n<li><a href=\"#structure\">Structure Kerta Gosa Building</a></li>\n<li><a href=\"#function\">Kerta Gosa and Bale Kambang</a></li>\n<li><a href=\"#painting\">Painting at Ceiling Kerta Gosa</a></li>\n<li><a href=\"#cultural\">Cultural Heritage Kerta Gosa</a></li>\n</ul>\n\n<span id=\"history\">\n<h3 class=\"font-small\">History of Kerta Gosa</h3>\n<p class=\"text-justify\">The Kerta Gosa building has existed since 1700 AD. This can be seen based on the year numbers of andra angkala which are above the entrance to the Kerta Gosa complex. andra angkala is in the form of Chakra, Yuyu, Paksi, which is worth 1661 Saka or around 1700 AD. This year's figure coincides with the reign of King Dewa Agung Jambe. The building from Kerta Gosa was built in 1686 by the first power holder in Klungkung, namely Ida I Dewa Agung Jambe who was the King of Klungkung in ancient times, and was built in the Klungkung royal building complex. The purpose of building Kerta Gosa is as a place for discussion about the current security situation, justice and prosperity for the Klungkung kingdom. Or now a system like this is called the Court which is to provide a sense of justice and comfort for the residents of the Klungkung kingdom. Kerta gosa during the colonial era was also used as a courthouse in 1908 - 1942, where this can be seen from the equipment of this kerta gosa building such as chairs, tables and others with carvings and decorated with gold paint (prada).</p>\n</span>\n<span id=\"complex\">\n<h3 class=\"font-small\">Kerta Gosa Complex in Klungkung Kingdom</h3>\n<p class=\"text-justify\">Kerta Gosa is a building complex or court hall inherited from the legacy of the Klungkung Kingdom which reigned from 1686 - 1908 and during the Dutch colonial period in 1908 - 1942 this Kerta Gosa building still functioned as usual. Where in the Kerta Gosa building complex there are several other buildings that complement the entire Kerta Gosa complex. The buildings include Bale Kambang which is in the middle of a pond called Taman Gili and the Royal Gate. And on the west side of the Kerta Gosa complex there is a building that is used as the Klungkung Museum with European architectural style (Balisering) which was also a former Dutch school. In fact, the court used equipment such as chairs and tables, wood carving and the paint is still there prade (gold paint). Objects  to the evidence the court heritage institutions such as the traditional customs that apply in Klungkung in the colonial period (1908-1942) and the period of  Japanese occupation (1043-1945).</p>\n</span>\n<span id=\"name\">\n<h3 class=\"font-small\">The Meaning Name Kerta Gosa</h3>\n<p class=\"text-justify\">The meaning of the name Kerta Gosa when viewed from Sanskrit which consists of two syllables, namely Kerta which is written in Sanskrit as kertha which means good, noble, safe, peaceful, happy, and prosperous. And the word gosa, which is written in Sanskrit as Gosita, which means to be called, announced, and broadcast. So the name Kerta Gosa can be interpreted as things to achieve peace and prosperity. Kerta Gosa can also be interpreted as a place for the king to hold deliberations regarding peace and prosperity for the kingdom which includes the fields of security and justice. The meaning of the Kerta Gosa building is closely related to the royal palace, which includes elements of a place of recreation, joy, luxury, and as a monumental art element of a kingdom. As a building that functioned for court proceedings from the royal era to the colonial period. The available information states that the judicial procedures and officials who were present at the Colonial Period trial were still continued with the previous customary court procedures. Therefore, Kerta Gosa as a venue for open justice reflects the existence of local wisdom in the field of values ​​of justice and openness in the legal system. Kerta Gosa gives us an overview of the judicial process that took place in the past. </p>\n</span>\n<div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/kerta-gosa.php\"><img src=\"images/bali-interest-place/kerta-gosa-1.jpg\" alt=\"Kerta Gosa Bale | Bale Kambang | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width\" title=\"Kerta Gosa Bale | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Kerta Gosa Bale</p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/kerta-gosa.php\"><img src=\"images/bali-interest-place/kerta-gosa-2.jpg\" alt=\"Kerta Gosa Bale | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width\" title=\"Kerta Gosa Bale | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Kerta Gosa Bale</p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/kerta-gosa.php\"><img src=\"images/bali-interest-place/kerta-gosa-3.jpg\" alt=\"Kerta Gosa Bale | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width\" title=\"Kerta Gosa Bale | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Kerta Gosa Bale</p></div>\n</div>\n<span id=\"structure\">\n<h3 class=\"font-small\">Structure Kerta Gosa Building</h3>\n<p class=\"text-justify\">Kerta Gosa consists of two buildings (bale), namely Kerta Gosa Bale and Bale Kambang. Bale Kambang called because the building is surrounded by a pond that is Gili Park. The uniqueness Kerta Gosa with Bale Kambang this is surface on the ceiling or roof bale is decorated with traditional painting style of Kamasan (a village in Klungkung) or style of puppet that is very popular in the community Bali. Initially, the paintings that decorate the ceiling are made of cloth and parba. New since 1930 is replaced and created at the top of the plasterboard direstorasi ago according to the original image is still intact and up to now. Cultural heritage as Kingdom Semarapura, Gosa and Kerta Bale Kambang enabled to judge the matter and the religious ceremony that is especially yadnya cut teeth (mepandes) like children king. </p>\n</span>\n\n<span id=\"function\">\n<h3 class=\"font-small\">Kerta Gosa and Bale Kambang</h3>\n<p class=\"text-justify\">Function of the two buildings is closely related to the function of education through the paintings that were presented at the puppet ceiling buildings. The paintings are a series of stories that take on the key themes, namely Swargarokanaparwa and parwa Bima Swarga a guide punishment Karma Phala (result of the good-bad deeds performed during a human lifetime) and the re-incarnation into the world because of the deeds and sin - sin. Because no one said that if the psychological, theme paintings decorate the ceiling Kerta Gosa building load values education mental and spiritual. Painting is divided into a row of six terraced. In the year 1930, had made the restoration of the painting there is a puppet in Kerta Gosa and Bale Kambang painted by the artists  of Kamasan. Restoration last painting done in 1960. A very good visit to increase your knowledge about the history of the Klungkung kingdom, especially in the field of courts, where here you can see the history of the courts that occurred during the kingdom and during the colonial era.</p>\n</span>\n<div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/kerta-gosa.php\"><img src=\"images/bali-interest-place/kerta-gosa-4.jpg\" alt=\"Bale Kambang and Taman Gili | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width\" title=\"Bale Kambang and Taman Gili | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Bale Kambang and Taman Gili</p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/kerta-gosa.php\"><img src=\"images/bali-interest-place/kerta-gosa-5.jpg\" alt=\"Bale Kambang and Taman Gili | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width\" title=\"Bale Kambang and Taman Gili | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Bale Kambang and Taman Gili</p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/kerta-gosa.php\"><img src=\"images/bali-interest-place/kerta-gosa-6.jpg\" alt=\"Bale Kambang and Taman Gili | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width\" title=\"Bale Kambang and Taman Gili | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Bale Kambang and Taman Gili</p></div>\n</div>\n<span id=\"painting\">\n<h3 class=\"font-small\">Painting at Ceiling Kerta Gosa</h3>\n<p class=\"text-justify\">Bottom row illustrates the themes derived from Tantri Story. Suite second from the bottom illustrates the theme of the story. Bimaswarga in Swargarakanaparwa. Catenarian next theme Bagawan Kasyapa story. Fourth row to take a theme that is characteristic Palalindon or meaning and the meaning of the occurrence of earthquakes in mythologist. Continuation of the story is  taken from the theme Bimaswarga painted on the fifth row that is located almost on the cone-shaped roof building. In the last row or the sixth place by a description of the life of Nirwana. In addition to the building ceiling Kerta Gosa, puppet paintings also decorate the ceiling in the west that is Kerta Gosa Bale Kambang. On the palate this painting Bale Kambang puppet who comes to take the themes from the story of Kakawin Ramayana and Sutasoma. The theme comes from  guide kakawin this function that the building is the place Bale Kambang under  one's belt religious ceremony that is Manusa Yadnya cut teeth children in  Klungkung king. The attractiveness of Kerta Gosa paintings than in the  traditional style of Kamasan at Kerta Gosa Bale and Bale Kambang, other  important heritage that is still around and cannot be separated in terms of the  value of history is noble pemedal (gate).</p>\n</span>\n<span id=\"cultural\">\n<h3 class=\"font-small\">Cultural Heritage Kerta Gosa</h3>\n<p class=\"text-justify\"> Pemedal Court located in the west  Kerta Gosa emits a very cultural heritage values Palace. Pemedal this Court on  the value of art are traditional Balinese architecture. This is the gate that  functions as a cantilever holder of the throne of power mechanisms (Dewa Agung)  in Klungkung for over 200 years (1686-1908). In the event of war against the  Dutch military expedition known as the Puputan Klungkung on 28 April 1908, the  holder of the throne last Dewa Agung Jambe followers and autumn. (The recording  of this monument is now enshrined in Puputan Klungkung which is located across  the Kerta Gosa). After the defeat in the building core Palace Semarapura  (viscera) and destroyed the settlement was made. Rubble highest remaining Kerta  Gosa, Bale Kambang Taman Gili with its Portal Palace and the object appeared to  be a very interesting both in the tourism and especially cultural historical  studies. </p>\n</span>"
]