[
  "<h1 class=\"text-uppercase\"><a href=\"https://www.baligoldentour.com/legong-dance.php\" title=\"Bali Legong Dance\">Bali Legong Dance</a></h1>\n<h2 class=\"text-uppercase\"><a href=\"https://www.baligoldentour.com/legong-dance.php\" title=\"Bali Legong Dance Is Traditional Balinese Dance and Also Called as Legong Keraton Dance With Beautiful Dance Curves\">Bali Legong Dance Is Traditional Balinese Dance and Also Called as Legong Keraton Dance With Beautiful Dance Curves</a></h2>\n<a href=\"https://www.baligoldentour.com/legong-dance.php\"><img src=\"images/bali-information-site/legong-keraton-dance.jpg\" alt=\"Bali Legong Dance | Bali Legong Keraton Dance | Bali Golden Tour\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"Bali Legong Dance | Bali Legong Keraton Dance | Bali Golden Tour\"></a>\n<p class=\"text-justify\"><strong><a href=\"https://www.baligoldentour.com/legong-dance.php\" title=\"Bali Legong Dance\">Bali Legong Dance</a></strong> also called with name <strong>Bali Legong Keraton Dance</strong> is one of the traditional Balinese dances introduced to foreign tourists as a dance performance performed by very professional Balinese dancers with very beautiful dance curves that will make you fascinated with the beautiful curves of these dancers. This Legong Keraton Dance is usually performed by female dancers with the characteristic of carrying fans and accompanied by gamelan music (traditional Balinese musical instruments) where this Legong Keraton Dance is a cultural heritage that has existed since ancient times which was used as a dance performance for ancient kingdoms, and now the Legong Keraton Dance is developed by a dance studio which is made as a dance performance that we can see today. A very memorable experience in being part of the preservation of the Legong dance which is one of the cultural heritages of dance on the island of Bali.</p>\n<p class=\"text-justify mb-1\"><strong>All you need to know about Legong Dance</strong></p>\n<ul class=\"mb-3\">\n<li><a href=\"#location\">Legong Dance Location and Show Hours</a></li>\n<li><a href=\"#history\">Legong Dance History</a></li>\n<li><a href=\"#meaning\">Meaning of the word Legong</a></li>\n<li><a href=\"#development\">The Development of the Legong Dance</a></li>\n<li><a href=\"#legong-art\">The Art of Legong Dance</a></li>\n<li><a href=\"#gamelan\">Legong Dance Music Gamelan</a></li>\n<li><a href=\"#how-to-watch\">How To Watch Legong Dance</a></li>\n</ul>\n\n<span id=\"location\">\n<h3 class=\"font-small\">Legong Dance Location and Show Hours</h3>\n<p class=\"text-justify mb-2\">As one of the dance performances that is no less interesting than other dances such as the Barong Keris Dance and the Kecak Fire Dance, this Legong Dance also has its own characteristics that make it a place in the hearts of tourists. As for the location for watching this Legong Dance, what we know is that it is only found in Ubud village, some performance located at Ubud Palace with random schedule with other traditional dance, in Saraswati Temple and special place called Legong and Barong Waksirsa Dance which is held every day at 19.00 - 20.00 pm by professional dancers who bring the storyline With a very beautiful that will make you really get carried away from the storyline brought by this professional dancer. If you drive from Kuta to get to the Legong Dance location it will take about 2 hours drive, it's not so difficult to find the location, because it is located in the center of Ubud at the Ubud Palace, so it would be nice if you took a trip to Ubud and ended with watch this phenomenal Legong Dance. After watching the Legong Dance you can enjoy the night atmosphere in Ubud by spending time with dinner in Ubud Village, the atmosphere is very different from most tour programs, where you will enjoy the beautiful night in Ubud Village</p>\n</span>\n<span id=\"history\">\n<h3 class=\"font-small\">Legong Dance History</h3>\n<p class=\"text-justify\">This Legong Dance has existed since ancient times which is thought to have been created and developed at the end of the 19th century which is more often performed in the kingdom to entertain the king or royal guests. On the island of Bali, this Legong Dance is called the Legong Keraton because this dance was only performed in the kingdom in the past. The beginning of the Legong Dance in Bali started with a King of Sukawati with name I Dewa Agung Made Karna who reigned 1775-1825 AD, It is told that one time he was doing penance at Jogan Agung Temple, Ketewel village (Sukawati area) and he dreamed of seeing an angel dancing in heaven wearing a headdress made of gold. The angel danced gracefully with very beautiful movements and every curve of the dance required a very perfect beauty. And finally he woke up from his dream and immediately headed to the kingdom and ordered the nagging bendesa to make some masks similar to the angels in his dreams and also ordered some expert dancers to make dance moves similar to the dances performed by the nymphs. And the mask work was completed and nine sacred masks were made according to the request of the king Sukawati, and finally the first dance performance was performed under the name Sang Hyang Legong at the Jogan Agung temple where he performed penance and dreamed of dancing angels, the performance was performed by two dancers. women who have not menstruated, who are still pure</p>\n</span>\n<span id=\"meaning\">\n<h3 class=\"font-small\">Meaning of the word Legong</h3>\n<p class=\"text-justify\">If you look at the meaning of the word Legong which comes from two syllables, namely \"Leg\" which means a dance movement that is flexible and flexible and the word \"gong\" which means a Balinese musical instrument called gamelan that accompanies this flexible dance movement. So the word Legong can be interpreted with the meaning of flexible dance movements accompanied by beautiful gamelan music. The gamelan that accompanies this Legong Dance is Semar Pagulingan. At first this Legong Dance was danced by 2 female dancers, where the dancers had not menstruated, and were performed under the light of the full moon which made the scenery very enchantingly beautiful with the characteristics of dancers who use traditional fans, and there are also some additional dancers who do not wear fans. called \"inclined\". In the development of this era, the Legong Dance had lost its popularity which was defeated by other dances, so that a revitalization effort was carried out in 1960 so that this Legong Dance could be preserved and survived to this day, where we can still see this Legong Dance today.</p>\n\n<div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/legong-dance.php\"><img src=\"images/bali-information-site/legong-dance-1.jpg\" alt=\"Legong Dance | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width\" title=\"Legong Dance | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Legong Dancer</p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/legong-dance.php\"><img src=\"images/bali-information-site/legong-dance-2.jpg\" alt=\"Legong Dance | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width\" title=\"Legong Dance | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Legong Dancer</p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/legong-dance.php\"><img src=\"images/bali-information-site/legong-dance-gamelan.jpg\" alt=\"Gamelan Legong Dance | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width\" title=\"Gamelan Legong Dance | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Gamelan Legong Dance</p></div>\n</div>\n<span id=\"development\">\n<h3 class=\"font-small\">The Development of the Legong Dance</h3>\n<p class=\"text-justify\">After King Sukawati, namely I Dewa Agung Made because he performed the Sang Hyang Legong dance performance for the first time, not long after the dance was created and performed by Nandir Dance studio from Blahbatuh village led by I Gusti Ngurah Jelantik performed a dance performance which was attended and witnessed by the King. Gianyar whose name is I Dewa Agung Manggis, who really likes dance and seeing the Sang Hyang Legong dance performed by I Gusti Ngurah Jelantik made him very entertained and very interested in this dance, so he ordered two artists from Sukawati village to arrange the dance with similar type movement dan dancer from the sang hyang legong dance. This Sang Hyang Legong dance was returned by using two dancers as dancers, and the artist finally succeeded in rearranging this dance using two dancers and since this is the Legong Classic dance that we can see until now. And now there are many dance studios that have developed this Legong dance to be more artistic and more pleasing to the eye with various dance styles and without losing the characteristics of this Keraton Legong dance.</p>\n</span>\n<span id=\"legong-art\">\n<h3 class=\"font-small\">The Art of Legong Dance</h3>\n<p class=\"text-justify\">The art of Legong Dance has developed very rapidly in terms of dance technique and quality, it is said that in the past this palace Legong dance only developed in the kingdom and finally developed outside the kingdom in the early 19th century where the dancers who used to dance the palace Legong dance in the palace returned to their respective villages and teach the art of this dance to the residents and the community, so that this Legong dance is widely developed and it is also known that the Balinese are very fond of art, so that at that time there were many dance studios that developed this Legong dance with various styles. which is very beautiful to see, such as the palegongan style dances that are spread in the villages of Saba, Peliata, Bedugul, Binoh, Kelandis and several other places. Of the many villages that experience this Legong dance, only in the villages of Saba and Peliatan are still strong in maintaining the characteristics of this Legong dance and also giving birth to many types of Palegongan dances with various names and types of dance styles. As we can see today, there are many types of Legong dances that we can see and also some take the storyline from mythical stories such as Ramayana and Mahabharata which are packaged so well that it makes the audience feel at home to watch it.</p>\n</span>\n<span id=\"gamelan\">\n<h3 class=\"font-small\">Legong Dance Music Gamelan</h3>\n<p class=\"text-justify\">The Legong dance was originally accompanied by gamelan music, gamelan is a traditional Balinese musical instrument that is played by several people, so that it produces music that is very good to listen to. The type of gamelan used in accompanying this Legong dance is the Palegongan Gamelan which consists of gender rambar, gangsa jongkong, gong, kemong, kempluk, klenang and a pair of kerumungan drums, flute, fiddle, jublag, jegog, gerontorang and additionally there are someone as a narrator who sings a melodious voice called tembang. But along with the times and from an economic point of view where this Legong dance is often accompanied by gamelan gong kebyar which in the end makes this dance more often accompanied by the gong kebyar dance, this is inseparable from the flexibility of the Legong dance which can be accompanied by several types of instruments. music without reducing the characteristics of the Legong dance which is so enchantingly beautiful. So if you are on vacation on the island of Bali and want to try to see a new dance, you can watch the Legong dance and see the graceful movements of the dancers carrying the fan, an experience that is very impressive in seeing the dance which is one of the cultural heritage of Indonesia. the island of Bali that we can still see in this modern era</p>\n</span>\n<span id=\"gamelan\">\n<h3 class=\"font-small\">Stroyline Legong Dance Performance</h3>\n<p class=\"text-justify mb-2\">At first, the Legong dance was a type of dance, but in later developments, the dance movements were positioned based on one of the dances in the gambuh. When viewed from the vocabulary of motion, it seems that the intricate movements contained in the Legong dance have been perfected and adjusted dynamically, so that it becomes Legong as it is today. The dance movements in pelegongan are very beautiful, although in the end behind the movements hidden dramatic movements, and along with the development of the era and tourism, there are many variants of this Legong dance which was developed for tourism purposes so that there are many Legong dances that are used for tourism purposes. adopt stories from very famous wayang, and some also adopt stories from ancestral times</p>\n<ol class=\"mb-3\">\n<li class=\"text-justify mb-2\"><strong>Legong Keraton</strong>: This dance takes the basic story from the Panji story which is found in the 12th and 13th centuries which tells the story of King Lasem who was going to propose to the daughter of the Daha kingdom named Rangeksari but the princess refused because she was bound by Raden Panji from Kahuripan, finally King Lasem did a disgraceful thing by kidnapping the princess and this kidnapping was known by the King of Kediri who was the sister of the princess and he declared war and left for the kingdom of Lasem. This was known by the king of Lasem and went to the battlefield, but before arriving on the battlefield King Lasem was intercepted by the Garuda bird who came to help free the princess, a fierce battle took place between King Lasem and the Garuda bird, which was finally won by the Garuda bird and the king of lasem managed to escape to the kingdom. And arriving at the kingdom, the King of Kediri had come with his troops and the battle broke out and because the previous king of Lasem was seriously injured and fought the troops of the King of Kediri which finally made the King of Lasem die and this battle was won by the King of Kediri who finally freed the princess and took over lasem kingdom.</li>\n<li class=\"text-justify mb-2\"><strong>Legong of Mahabarata Epos</strong>: This dance takes the story from the Mahabharata which is told about the civil war between the Pandavas and the Kauravas to fight for the throne of Hastinapura, the Kauravas are assisted by an uncle named Sengkuni, with his cunning tactics he succeeded in expelling the Pandavas from the kingdom and wasted in the forest for 12 years and carried out a disguise according to the agreement of the tactics. sly Sengkuni. During exile the Pandavas were given the gift of power and powerful weapons to face war and the Pandavas were assisted by the avatar of Lord Vishnu who incarnated as Sri Krishna who helped the Pandavas and gave advice and tactics to defeat the Kauravas, and the war took place on a battlefield called Kuruksetra and civil war. This is called Bharatayuda. Which is where this war lasted for a very long time and was full of bloodshed which also caused Drona, Karna and Sengkuni who finally died and ended with the death of the Kauravas, where the Pandavas won this battle and took the rightful throne from Hastinapura. A dance performance that is presented is very epic, so you will be carried away by the storyline that is brought</li>\n</ol>\n\n<span id=\"how-to-watch\">\n<h3 class=\"font-small\">How To Watch Legong Dance</h3>\n<p class=\"text-justify\">Legong Dances always have a special place in the hearts of dance fans, and if you are interested in watching this Legong Dance, you can head to the ubud palace in the afternoon and watch this amazing and beautiful Legong Dance performance. You can buy tickets for the show at ticket counter at Saraswati Temple and special place called Legong and Barong Waksirsa Dance and at Ubud Palace if on schedule for the Legong Dance, due in Ubud palace held many kind traditional dance and each day different dance performance, with limited seat, is recommend you come earlier so can have good seat for watching the beautiful Legong Dance. If you want to watch this dance, we from <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a> offer a <a href=\"https://www.baligoldentour.com/bali-car-charter.php\" title=\"Hire Private Car and Driver\">Hire Private Car and Driver</a> program by providing private transportation in a very comfortable car and cold A/C will make the trip enjoyable and accompanied by an experienced driver will make the trip very enjoyable. And if you happen to be in the Ubud area, you can rent local transportation to get to Ubud Palace, and you can easily buy tickets for the show on site. Enjoy watching the Legong Dance performance which is very full of meaning and with a very good storyline that will make the show a lot of fun.</p>\n</span>\n\n</span></span>"
]