[
  "<h1 class=\"text-uppercase\"><a href=\"https://www.baligoldentour.com/mas-village.php\" title=\"Bali Mas Village\">Bali Mas Village</a></h1>\n  <h2 class=\"text-uppercase\"><a href=\"https://www.baligoldentour.com/mas-village.php\" title=\"Bali Mas Village is The Center of Wood Carving Art in Bali with Beautiful and Artistic Crafting\">Bali Mas Village is The Center of Wood Carving Art in Bali with Beautiful and Artistic Crafting</a></h2>\n<a href=\"https://www.baligoldentour.com/mas-village.php\"><img src=\"images/bali-interest-place/mas-village-bali-golden-tour.jpg\" alt=\"Mas Village | Bali Wood Carving Art | Bali Interest Place | Bali Golden Tour\" width=\"1200\" height=\"500\" class=\"auto-width mb-3\" title=\"Mas Village | Bali Wood Carving Art | Bali Interest Place | Bali Golden Tour\"></a>\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/mas-village.php\" title=\"Bali Mas Village\"><strong>Bali Mas Village</strong></a> is one of villages in Bali fundamentally identified as an artistic countryside by focusing in artistic of wood carving. Mas Village is located in Ubud sub district and Gianyar Regency, east part of Bali. It owns the typical style of wood carving art by placing forward the distinguish synergy the humanism and naturalism. The village's popularity as an wood carving art village is famous in the national and world level which is not forgetting from the highness name of some maestros which has borne and found the spirit (taksu) and soul. Along the road we can find a lot of  art shops that sell many kind of wood carvings. An experience that may not be forgotten by you where visiting the village of mas which is very synonymous with the craft of wood carving which is so beautiful, if you are interested in wood carving you can visit this village of mas, from various sizes of wood art can be seen here and they display it in their art gallery which is for sale to tourists</p>\n  <p class=\"text-justify mb-0\"><strong>All you need to know about Mas Wood Carving Village</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#location\">Location Mas Wood Carving Village</a></li>\n<li><a href=\"#history-mas-village\">History of Mas Ubud Village</a></li>\n<li><a href=\"#history-wood-carving\">History Wood Carving art at Mas Village</a></li>\n<li><a href=\"#center-wood-carving\">Mas Village is The Center of Word Carving Art in Bali</a></li>\n<li><a href=\"#facilities\">Mas Village Word Carving Art Facilities</a></li>\n</ul>\n<span id=\"location\">\n  <h3 class=\"font-small\">Location Mas Wood Carving Village</h3>\n<p class=\"text-justify\"> Mas Village strategically located in the main road from Denpasar to Ubud and it can be reached from various of angle. It is about 15 km easterly go to the majors road to Ubud from Denpasar town. If you wish to go to this place from Denpasar, the starting spandrel points step into Mas Village is Sakah, where a big baby idol monumentally existing in the middle of road. The Baby idol is a symbol and representative of human being life early which is believed by local residents with full of philosophic value, religious and dynamism. It is not so difficult to find the location of Mas village because it is located on the main road leading to the center of Ubud, so most tourists will stop here for a moment to see the beautiful carvings. If you want to explore on your own, you can use the help from google map to direct you here and if you don't want to bother looking for the location, you can use our <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a> services by offering <a href=\"https://www.baligoldentour.com/bali-car-charter.php\" title=\"Hire Car and Driver\">Hire Car and Driver</a> at a low price and accompanied by a friendly and experienced driver. the trip is getting more and more fun</p>\n  </span>\n  <span id=\"history-mas-village\">\n  <h3 class=\"font-small\">History of Mas Ubud Village</h3>\n  <p class=\"text-justify\"> We can see the history of Mas Ubud village from the history of the journey of Dang Hyang Nirartha, a holy Brahmin from the Majapahit Kingdom who came to Bali with a mission to spread religious teachings. He had stopped at Mas village at the invitation of a knight (arya) named Mas Wilis who came from the Majapahit kingdom who resided in Bali, where another knight from Majapahit also resided in the Balinese village of Mas who previously won the war against the king. Be Dulu was a despot and decided to stay in Bali. With the arrival of Dang hyang nirartha to Mas village, he gave many advices and directions as well as teachings related to religion, social and culture to Mas Wilis. And then Dang Hyang Nirartha performed the coronation of Mas Wili and gave the title as Prince Manik mas and Dang Hyang Nirartha put a tall stick in honor of that day and the stick grew into a Tangi tree which is said to be alive today, and the tangi tree is in the temple. Pule Mas park, since then this village is called Mas Village. Prince Mas Wilis has a daughter and was married to Dang Hyang Nirartha and has a younger brother named Brahmin Mas, and until now the breed is still in this village of Ubud.</p>\n  </span>\n  <span id=\"history-wood-carving\">\n  <h3 class=\"font-small\">History Wood Carving art at Mas Ubud Village</h3>\n  <p class=\"text-justify\">Mas village has been famous since the royal era, where many artists from mas ubud were involved in the construction of the <a href=\"https://www.baligoldentour.com/ubud-royal-palace.php\" title=\"Ubud Royal Palace\">Ubud Royal Palace</a>, and most of the residents work as carvers, and you could say if the blood of carving is ingrained, it's no wonder the resulting carvings are so beautiful very. The first carving art was aimed at making places of worship (temples) with carvings with flower and leaf patterns, and over time it developed into carving tables, chairs and doors as well as statues made of wood. The motifs produced from the typical carvings of this mas village are relics of the previous royal era which were passed down from generation to generation without leaving the characteristics of this mas village carving. This motif is increasingly progressing so that new variations of motifs appear. In general, there are characteristics of Balinese carving art, namely leaf, flower, and fruit motifs which are a combination of convex and concave shapes and also carvings that take wayang images such as Mahabrata and Ramayana which are used as wall decorations or small statues. Mas Village always makes us stunned by the incomparably beautiful wood carving craft, so that it can attract tourists to visit the beauty of wood carving in this village of Mas, Ubud.</p>\n    <div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/mas-village.php\"><img src=\"images/bali-interest-place/mas-village-wood-carving-1.jpg\" alt=\"Mas Wood Carving Art Village | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width mb-3\" title=\"Mas Wood Carving Art Village | Gianyar Places of Interest | Bali Golden Tour\"></a>\n</div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/mas-village.php\"><img src=\"images/bali-interest-place/mas-village-wood-carving-2.jpg\" alt=\"Mas Wood Carving Art Village | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width mb-3\" title=\"Mas Wood Carving Art Village | Gianyar Places of Interest | Bali Golden Tour\"></a>\n</div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/mas-village.php\"><img src=\"images/bali-interest-place/mas-village-wood-carving-3.jpg\" alt=\"Mas Wood Carving Art Village | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width mb-3\" title=\"Mas Wood Carving Art Village | Gianyar Places of Interest | Bali Golden Tour\"></a>\n</div>\n</div>\n</span>\n<span id=\"center-wood-carving\">\n<h3 class=\"font-small\">Mas Ubud Village is The Center of Word Carving Art in Bali</h3>\n<p class=\"text-justify\"> This Artistic countryside owns the long history root. The result of wood carving art in this village owns the immeasurable and wide dimension like idol for the devoting (arca idol), representative dimension of everyday Balinese social society life (farmer, fisherman, worker, intellectual, merchant etc), the abstract dimension as existing of actor imagination which is listening carefully of reality, dynamics and life philosophy. The villagers are same as villagers at other tourism countryside in Bali that have also experienced the transformation from agrarian society to the crafting society. Even nowadays, it is continued to service society from commerce service until levying service of the souvenir for overseas and domestic tourist. With the growth of foreign tourists to Bali who are very fond of wood carving crafts, there are also entrepreneurs who open wood carving galleries in this village of Mas, thus making <strong>Mas Village the center of the craft of wood carving art</strong> which is very charming and very beautiful, at a low price. will definitely make the shopping atmosphere very comfortable</p>\n</span>\n<span id=\"facilities\">\n<h3 class=\"font-small\">Mas Ubud Village Word Carving Art Facilities</h3>\n<p class=\"text-justify\">As for the facilities offered by each wood craftsman here, they are very complete, and will make you feel at home for a long time to see the wood carvings that are here. So if you visit Mas Village, stop by one of the wood craft places, and there are many facilities that will pamper you, first the parking space provided is quite large so you don't have to worry anymore to find a parking space, and also here there are craftsmen who carve wood, so you can see firsthand the process of carving wood from raw materials to become truly beautiful works. Besides being able to see the process of making wood carving artwork, you are also invited to visit the collection of wood carvings that are done here, from various forms of carving you can see here, besides that here we also accept orders for wood carvings, if you have examples that you want to make, can tell officers here, they'll do it. And for the delivery of wood to your country usually use cargo services. It's a very pleasant experience to see the center of wood crafts on the island of Bali</p>\n  </span>"
]