[
  "<h1><a href=\"https://www.baligoldentour.com/penglipuran-village.php\" title=\"BALI PENGLIPURAN VILLAGE\">BALI PENGLIPURAN VILLAGE</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/penglipuran-village.php\" title=\"BALI PENGLIPURAN VILLAGE IS TRADITIONAL BALI VILLAGE WHICH IS UNTOUCHABLE BY THE MODERNIZATION ERA\">BALI PENGLIPURAN VILLAGE IS TRADITIONAL BALI VILLAGE WHICH IS UNTOUCHABLE BY THE MODERNIZATION ERA</a></h2>\n<a href=\"https://www.baligoldentour.com/penglipuran-village.php\"><img src=\"images/bali-interest-place/penglipuran-traditional-village.jpg\" alt=\"PENGLIPURAN VILLAGE | TRADITIONAL BALI VILLAGE UNTOUCHABLE BY MODERNIZATION ERA | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"res-width\" title=\"PENGLIPURAN VILLAGE | TRADITIONAL BALI VILLAGE UNTOUCHABLE BY MODERNIZATION ERA | BALI GOLDEN TOUR\"></a>\n<p class=\"text-right mb-3\"><em style:font-size:12px=\"\">source: desapenglipuran</em></p>\n<p class=\"text-justify\"> <strong><a href=\"https://www.baligoldentour.com/penglipuran-village.php\" title=\"Bali Penglipuran Village\">Bali Penglipuran Village</a></strong> that located around 6 kilometer from the closest city Bangli or 1 kilometer from Kubu village has 700 populations by the last census 1999 by the number of the head family 192. Penglipuran village is a traditional village which has their own character, belong to the district Kubu- Sub district Kubu amd Bangli regency. The beauty of the village and the surrounding act that penglipuran village is untouchable village by the modernization era. Supported by the fresh air by the height 700 meter above the sea level, give the comfortable for the villager and visitors. A village that really still reflects the old culture and customs, where the shape of the buildings here are almost the same, and still maintain their identity and are not touched by modern buildings. The atmosphere of visiting is very pleasant where when you are here you will feel you are in the past where the sustainability of the houses in the village of Penglipuran are still maintained</p>\n<p class=\"text-justify mb-2\"><strong>If you visit Penglipuran Village, here all you need to know</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#cultural-tourism-site\">Penglipuran Cultural Tourism Site</a></li>\n<li><a href=\"#location-penglipuran\">Location of Penglipuran Village</a></li>\n<li><a href=\"#topography-penglipuran\">Topography of Penglipuran Village</a></li>\n<li><a href=\"#geography-penglipuran\">Penglipuran Village Geography</a></li>\n<li><a href=\"#history-penglipuran\">Penglipuran Village History</a></li>\n<li><a href=\"#culture-village-penglipuran\">Culture Village of Penglipuran</a></li>\n<li><a href=\"#facilities-penglipuran\">Facilities at Penglipuran Village</a></li>\n</ul>\n<span id=\"cultural-tourism-site\">\n<h3 class=\"font-small\">Penglipuran Cultural Tourism Site</h3>\n<p class=\"text-justify\">Penglipuran is a very unique village, where it still maintains a beautiful rural face like in the past, without being eroded by the modern side of the building, if you visit here you can see the shape of the house in a past life like this original. Penglipuran Traditional Village is a rural area that has a specific structure from a traditional village structure, so that it is able to display a beautiful rural face. The physical arrangement of the village structure is inseparable from the culture of the community that has been passed down from generation to generation. Thus, Penglipuran Traditional Village is a cultural tourism site. The beauty of the Penglipuran Traditional Village can be felt starting from entering the pre-village area with green grass on the edge of the road and hedges pulled along the road, adding to the coolness of the village procession area. It is a very amazing sensation to know a village whose face has not changed from the past until now and still reflects its very beautiful nature</p>\n</span>\n<span id=\"location-penglipuran\">\n<h3 class=\"font-small\">Location of Penglipuran Village</h3>\n<p class=\"text-justify\">The location of this Penglipuran village is located in Kubu, Bangli sub-district. With a village area of ​​about 112ha with a border area from the east of the traditional village of Kubu to the south of the traditional village of Gunaksa and to the west of the Tukad Sang - Sang, while to the north is the traditional village of Kayang. The area is quite large for this Penglipuran village which is located at the foot of the beautiful Mount Batur at an altitude of 700 meters above sea level. Penglipuran traditional village is one of the tourism sites in Kintamani, where from Denpasar city center it is about 45 km or approximately 2 hours drive. Quite far from the city center, you can use google map to guide you here, and if you don't want to be busy, then we from Bali Tour offer Bali Car Charter transportation services to get here and of course with very cheap prices and very good service. satisfying will make this trip even more fun</p>\n<div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/penglipuran-village.php\"><img src=\"images/bali-interest-place/penglipuran-village-1.jpg\" alt=\"Penglipuran Village | Bangli Places of Interest | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width mb-3\" title=\"Penglipuran Village | Bangli Places of Interest | Bali Golden Tour\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/penglipuran-village.php\"><img src=\"images/bali-interest-place/penglipuran-village-2.jpg\" alt=\"Penglipuran Village | Bangli Places of Interest | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width mb-3\" title=\"Penglipuran Village | Bangli Places of Interest | Bali Golden Tour\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/penglipuran-village.php\"><img src=\"images/bali-interest-place/penglipuran-village-3.jpg\" alt=\"Penglipuran Village | Bangli Places of Interest | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width mb-3\" title=\"Penglipuran Village | Bangli Places of Interest | Bali Golden Tour\"></a></div>\n</div>\n</span>\n<span id=\"topography-penglipuran\">\n<h3 class=\"font-small\">Topography of Penglipuran Village</h3>\n<p class=\"text-justify\">The topography of Penglipuran Village is very unique, it can be seen from the shape of the buildings which are almost all the same. The topography of the village is arranged in such a way that in the main area of ​​the village the position is higher and so on it decreases until the downstream area. In the village area, there are Penataran Temples and Puseh Temples, which are the main areas of the village which are unique and specific because along the village corridor roads are only used for pedestrians, whose right and left are equipped with village structure attributes; such as pengengker walls, angkul-angkul and tejakan uniform. Uniformity of the face The topography of Penglipuran Village is very unique, it can be seen from the shape of the buildings which are almost all the same. The topography of the village is arranged in such a way that in the main area of ​​the village the position is higher and so on it decreases until the downstream area. In the Penglopura village area, there are Penataran Temples and Puseh Temples which are the main areas of the village which are unique and specific because along the village corridor roads are only used for pedestrians, whose right and left are equipped with village structure attributes; such as pengengker walls, angkul-angkul and tejakan uniform. The uniformity of the face of the village is not only due to the uniformity of shape but also from the uniformity of materials, namely the soil material for the pengengker and angkul-angkul (pol-polan) walls and the split bamboo roof for all village buildings. The use of bamboo for roofs, walls and other necessities is a must because Penglipuran village is surrounded by bamboo forests and is still the territory of Penglipuran village. The atmosphere of the house is very harmonious, when you enter the Penglipuran village area you will feel back to the past where you see the ancient houses lined up here with the beauty of the village in addition to the uniformity of shape as well as the uniformity of materials, namely soil material for the walls of penyengker and angkul- angkul (pol-polan) and split bamboo roofs for all village buildings. The use of bamboo for roofs, walls and other necessities is a must because Penglipuran village is surrounded by bamboo forests and is still the territory of Penglipuran village.</p>\n</span>\n<span id=\"geography-penglipuran\">\n<h3 class=\"font-small\">Penglipuran Village Geography</h3>\n<p class=\"text-justify\">The surrounded Penglipuran Village are Desa Khayan, Desa Gunaksa, Desa Kubu and Desa ceking. The village which is consists of one village and smaller village, administratively is very easy to adjust. The number of the village and the smaller village is the same. The name of the penglipuran village according to the mythology from the old people from Penglipuran village camed from \"Pengeling Pura\" (remember with the temple), it means that remember with the ancestor. This mythology is connected with the movement of their ancestor from Bayung Gede vilage at Kintamani Area to penglipuran village. To respect their ancestor at bayung Gede that's is why at Penglipuran Village as well built the same kind of the temple such as : Pura Bale Agung, Pura Puseh, Pura Dalem and Pura Dukuh. The four temple until now is still respecting by the villagers. Their sense of belonging and their respecting to the ancestor is the meaning of the four temples they built.</p>\n</span>\n<span id=\"history-penglipuran\">\n<h3 class=\"font-small\">Penglipuran Village History</h3>\n<p class=\"text-justify mb-0\">As for the history of Penglipuran village, based on circulating sources, a long time ago in the Bangli kingdom, when there was a war and the King of Bangli assigned the Bayung Gede villagers to join the war and other activities in the kingdom, because the location of the Bayung traditional village was far away, then the King of Bangli gave land to the village of Bayung Gede which is where Penglipuran Village is now, so whenever needed, the residents of the village of Bayung Gede could quickly face the king. Originally mentioned in the inscription, that the Penglipuran Traditional Village was called \"Kubu Bayung\" which means Pondok Bayung Gede. Over time, the villagers built a village in this neighborhood with Kahyangan Tiga (three temples namely Puseh Temple, Dalem Temple and Desa/Balai Agung Temple) and another temple (Dang Khayangan) was built similar to or similar to the one in Bayung Gede Village by the community. This is intended to remember the temple in Bayung Gede Village (Ngelingang Pura in Bayung Gede Village).<br>\nAs for the origin of the word Penglipuran village, from the narratives of the community leaders who are here, there are several versions that can explain the meaning of the word Penglipuran. And etymologically the word \"Penglipuran\" can be interpreted as follows.</p>\n<ol>\n<li>Penglipuran comes from the word \"pangeling\" and \"pura\" being the word penglipuran, meaning the people of Penglipuran build temples like in Bayung Gede to remember the temple in Bayung Gede and remember their ancestors</li>\n<li>Penglipuran comes from the words \"pelipur\" and \"lara\" become penglipuran, meaning that penglipuran becomes a place of comfort in times of sorrow (lara) in addition to the fact that the people can often cheer up when the king is in trouble.</li>\n<li>Penglipuran comes from and the words \"pangleng\" and \"pura\" become penglipuran meaning that whoever goes to Penglipuran will pass temples in the four cardinal directions, namely north, east, south and west, in other words that Penglipuran is surrounded by pretending.</li>\n</ol>\n</span>\n<span id=\"culture-village-penglipuran\">\n<h3 class=\"font-small\">Culture Village of Penglipuran</h3>\n<p class=\"text-justify\">In 1993 the government officially made Penglipuran village one of the tourist villages on the island of Bali, with a decree from the Bangli Regent no 115, 29th April 1993. To maintain the sustainability of this Penglipuran tourist village, this Penglipuran village enforces strict customary rules so that Penglipuran village can be sustainable until now. The prohibitions made by Penglipuran village to maintain the sustainability of the village are such as the prohibition of using motorized vehicles so that the air quality remains clean. For tourists who are visiting for the first time, this rule feels surprising, but once they enter the village they will feel the coolness of the village air which is minimally polluted coupled with a variety of colorful plants. Penglipuran Village also has the characteristic architectural form of similar traditional buildings and is neatly arranged, from the main end of the village to the downstream. The position of the main building is higher and lowers downstream. Balinese gates (angkul-angkul) become access to people's homes in each yard and look uniform. The doors of the houses face each other and are separated from the main village road. So, the village looks organized. Other customary rules are that the village prohibits polygamous marriages, the caste level is only for the Sudra caste, and there are dance traditions that are passed down from generation to generation, namely the Baris Dance.</p>\n</span>\n<span id=\"facilities-penglipuran\">\n<h3 class=\"font-small\">Facilities at Penglipuran Village</h3>\n<p class=\"text-justify\">As for the facilities in Penglipuran village, which is one of the cultural tourism sites which is very famous for its local wisdom and the beauty of its customs and customs, which are never deserted by tourists who see the village with the shape and design of its houses and yards that have not changed from time immemorial. , when you visit here you will feel a situation like being in the age of lights with ancient buildings on the left and right which are very unique and beautiful. The facilities in Penglipuran village are very complete, from a very large parking lot that can accommodate dozens of cars here, so you don't have to worry when visiting Penglipuran village, there are clean toilet facilities you can use by paying a modest donation, there is a small shop that sells snacks and cold drinks as a thirst quencher when walking around this Penglipuran village area, besides that there is also a place to sell Tenganan village craft knick-knacks that you can buy as souvenirs for visiting the very famous Penglipuran village. in this world. Those are some of the supporting facilities that will spoil the tourists who want to visit this Penglipuran village.</p>\n</span>"
]