[
  "<h1><a href=\"https://www.baligoldentour.com/rambut-siwi-temple.php\" title=\"BALI RAMBUT SIWI TEMPLE\">BALI RAMBUT SIWI TEMPLE </a></h1>\n<h2> <a href=\"https://www.baligoldentour.com/rambut-siwi-temple.php\" title=\"BALI RAMBUT SIWI TEMPLE IS A TEMPLE CONTAIN OF A RELIC WHICH LOCK OF SAGE HAIR THAT IS VENERATED\">BALI RAMBUT SIWI TEMPLE IS A TEMPLE CONTAIN OF A RELIC WHICH LOCK OF SAGE HAIR THAT IS VENERATED</a></h2>\n<a href=\"https://www.baligoldentour.com/rambut-siwi-temple.php\"><img src=\"images/bali-interest-place/rambut-siwi-temple-bali-golden-tour.jpg\" alt=\"RAMBUT SIWI TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"RAMBUT SIWI TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>          \n<p class=\"text-justify\"><strong><a href=\"https://www.baligoldentour.com/rambut-siwi-temple.php\" title=\"Bali Rambut Siwi Temple\">Bali Rambut Siwi Temple</a></strong> is located in Jembrana regency, east of Yeh Embang village, Mendoyo district. It is about 10 km from Negara and can reach by any cars or motorcycles as well. Local peoples believe that they have to worshipped this temple to get a God bless of securing during the Journey. The Main temple located in cliff bank and and blessed by the breath taking view of the Indian ocean. This temples owns the representative temple building which is set beside  main road of Denpasar to Gilimanuk. Name of Rambut Siwi is contain of a relic  which is a lock of sage’s hair (rambut) that is venerated (siwi). A very magnificent temple located in the western part of the island of Bali, with its unspoiled natural beauty and the sea views that can be seen from this temple make the scenery very phenomenal with the religious aura around the temple will add to the pleasure in visiting this Rambut Siwi temple.</p>\n<p class=\"text-justify mb-2\"><strong>If you visit Rambut Siwi Temple, here all you need to know</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#temple\">Rambut Siwi Temple is Dang Kahyangan Jagat Temple</a></li>\n<li><a href=\"#sacred\">Sacred Temple and Ceremonial Days</a></li>\n<li><a href=\"#history\">History Rambut Siwi Temple</a></li>\n<li><a href=\"#biggest\">Biggest Temple at Jembrana Regency</a></li>\n<li><a href=\"#charm\">Rambut Siwi Temple Charm</a></li>\n<li><a href=\"#best-place\">Best Place to Visit in West Part Bali</a></li>\n</ul>\n<span id=\"temple\">\n<h3 class=\"font-small\">Rambut Siwi Temple is Dang Kahyangan Jagat Temple</h3>\n<p class=\"text-justify\">Rambut Siwi Temple is one of the largest and very important temples which is included in the row of Dang Kahyangan Jagat temples located in Jembrana Regency, Bali. Dang Kahyangan Temple itself is a sacred place dedicated to honoring sacred teachers such as priests, Maha Rsi and Masters. The Rambut Siwi temple is very important and is related to the sacred journey of Dang Hyang Nirartha or Dang Hyang Dwijendra where he was also given the title of Pedanda Sakti Bawu Rawuh who was instrumental in instilling the teachings of Hinduism. The location of the main temple is on a cliff by the beach, with a natural background of the Indian Ocean sea, so the atmosphere is beautiful, calm, peaceful and full of spiritual aura, no wonder this place is the most ideal place for meditation or calming down.</p>\n</span>\n<span id=\"sacred\">\n<h3 class=\"font-small\">Sacred Temple and Ceremonial Days</h3>\n<p class=\"text-justify\">In the Rambut Siwi Temple area at least you will meet 8 temples including the Pesanggrahan temple and also the temple under the cliffs by the beach, the first place of worship is the Pesanggrahan temple then Taman Temple, Penataran, Tirta Cave, Melanting, Gading Wani Temple, Ratu Gede temple Dalem Ped and the last place of worship is in the Luhur temple area, namely Rambut Siwi Temple. The core of the Rambut Siwi temple in Jembaran is the Penataran Temple and the Luhur Temple (Rambut Siwi) while the other is the Order of the Temple. In the main courtyard of the sublime temple there are a number of sacred buildings, such as Padma, Meru overlapping the three linggih Ida Betara Pedanda Sakti Bawu Rawuh (Dang Hyang Nirartha), Pengayeng Betara Gunung Agung, Gedong, Meru overlapping the two palaces of Batari Dewa Ayu Ulun Danu, mostgih Rambut Sedana, Peselang, Taksu and a number of other sacred buildings. The ceremony carried out at the Rambut Siwi Temple is based on the Balinese calendar, where 1 month is counted as 35 days since the ceremony at the Rambut Siwi Temple falls on Buda Umanis Day, Wuku Warbakat and if that day coincides with the Full Moon or Tilem, it is called odalan nadi. and held the most important level odalan.</p>\n</span>\n<span id=\"history\">\n<h3 class=\"font-small\">History Rambut Siwi Temple</h3>\n<p class=\"text-justify\">This is related to the mythology of the arrival of Mpu Dang Hyang Nirartha from East Java or Majapahit to Bali. According to Mpu Bhaskara Murti from Geria Madu Sudana in the city of Negara, when Mpu Dang Hyang Nirartha went to Bali, one of the temples he visited was the Rambut Siwi Temple. When he entered the temple, the temple guard required Mpu Dang Hyang Nirartha to pray at the temple. Otherwise, he will be pounced on by the tiger. Because it is required, worship him in the temple. It turned out that the temple was in ruins. Because of this, the temple guard finally apologized to Mpu Dang Hyang Nirartha. In addition, the temple guards requested that the temple be returned to its original state. On the wisdom of Mpu Dang Hyang Nirartha, the temple was returned intact as before. Mpu Dang Hyang Nirartha took a strand of his hair and placed it in the temple to be used as a means of worship in the temple. Since then the temple was named Rambut Siwi Temple. The name Rambut Siwi is more popular today.</p>\n\n<p class=\"text-justify\">When Mpu Dang Hyang Nirartha went to Bali, the ruling in Jembrana was I Gusti Ngurah Rangsasa. It is said that this ruler adhered to the teachings of Bairawa. Bairawa's teachings are derived from the teachings of Tantrayana. In ancient times there were many who misunderstood the teachings of this Tantrayana. For example, one of the teachings states that maituna is defined as free and erotic sex. The essence of the teaching of Maituna is a yoga attitude to strengthen and improve the relationship between purusa and pradana within. From this relationship will emerge a spiritual power from within that is greater. That spiritual power will be able to express the sanctity of Atman to reach Brahman / such a state of self that will be useful to build a healthy identity physically and spiritually. In Mahanirvana Tantra it is stated that Tantrayana really strengthens the power of Guna Sattwam and Rajas</p>\n</span>\n<div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/rambut-siwi-temple.php\"><img src=\"images/bali-interest-place/rambut-siwi-temple-1.jpg\" alt=\"Rambut Siwi Temple in Negara, Jembrana Regency | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width mb-3\" title=\"Rambut Siwi Temple in Negara, Jembrana Regency | Bali Golden Tour\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/rambut-siwi-temple.php\"><img src=\"images/bali-interest-place/rambut-siwi-temple-2.jpg\" alt=\"Rambut Siwi Temple in Negara, Jembrana Regency | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width mb-3\" title=\"Rambut Siwi Temple in Negara, Jembrana Regency | Bali Golden Tour\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/rambut-siwi-temple.php\"><img src=\"images/bali-interest-place/rambut-siwi-temple-3.jpg\" alt=\"Rambut Siwi Temple in Negara, Jembrana Regency | Bali Golden Tour\" width=\"500\" height=\"275\" class=\"full-width mb-3\" title=\"Rambut Siwi Temple in Negara, Jembrana Regency | Bali Golden Tour\"></a></div>\n</div>\n<span id=\"biggest\">\n<h3 class=\"font-small\">Biggest Temple at Jembrana Regency</h3>\n<p class=\"text-justify\">The Rambut Siwi Temple is one of the biggest of all the Hindu temples in Bali and is located in the Jembrana Regency in the west of Bali. Situated about 2 hours away from Denpasar in the further western areas where the atmosphere is classically Balinese with un-spoilt tropical woodlands and small villages spread out around the coast with a few larger areas inland. Most of this area is the conservational park of Bali which is home to many of the island's endemic species that are now protected in the hope of re-sustaining the entire island. Located right the beach the Rambut Siwi Temple is very photogenic and is extremely beautiful with the main shrine set in to the cliff. As with many of the Balinese temples, the recorded history of the Rambut Siwi Temple is unsure and sparse although the locals maintain that the temple is one of the water temples was built in order to keep the powerful forces of the sea away from the land and the village. Rambut Siwi Temple is the location of many ceremonies and activities in the Balinese Hindu calendar and the family calendars of the local families such as birth and marriage ceremonies.</p>\n</span>\n<span id=\"charm\">\n<h3 class=\"font-small\">Rambut Siwi Temple Charm</h3>\n<p class=\"text-justify\">The locals also believe that the Rambut Siwi Temple is a secret temple, today it is difficult to spot and it is said that there was a time when the temple was secret and held many secret objects and is shrouded with mystery and uncertainty to this day. this certainly adds to the charm of the Rambut Siwi Temple and is one of the reasons that its tucked away and yet grand statue is so impressive and yet humble. Another use of this temple is for the blessing of the journey that is made when traveling in these parts as often the passing of the Rambut Siwi Temple is on a long journey. There are other temples that are used in similar ways but many locals can be seen stopping at the Rambut Siwi Temple for a short time in order to ensure that their journey will be safe one heading either further north or back to the south of Bali. The views in this are sensational ether looking towards the sea and down over the temple or from the beach looking up to the temple and over the tropical woodland that surrounds it.</p>\n</span>\n<span id=\"best-place\">\n<h3 class=\"font-small\">Best Place to Visit in West Part Bali</h3>\n<p class=\"text-justify\">The gardens include extremely well kept tropical flowers and trees presented in classic Traditional Balinese styles and maintained with a great amount of care. Visiting the Rambut Siwi Temple is cheap and a very beautiful way to spend part of your day in this area, particularly at sunset when it is at its most beautiful. The Rambut Siwi Temple is a far less crowded alternative to the <a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\" title=\"Tanah Lot Temple\">Tanah Lot Temple</a> that is the most visited temple in Bali and the most Photographed of all the places in Bali. However you have to be willing to make the longer journey to enjoy the Rambut Siwi Temple's serenity. You can visit this rambu siwi temple with all its uniqueness and beauty which is located in the western area of ​​​​the island of Bali, with the garden setting in this temple as if it adds to its beauty value, not being too crowded by visitors will make you free to enjoy the beauty of the hair siwi temple this. It's a very pleasant sensation to see one of the very important and big temples on the island of Bali. If you happen to be in the west of the island of Bali, it would be nice to visit this Rambut Siwi Temple.</p>\n</span>"
]