[
  "<h1><a href=\"https://www.baligoldentour.com/taman-ayun-temple.php\" title=\"BALI TAMAN AYUN TEMPLE\">BALI TAMAN AYUN TEMPLE</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/taman-ayun-temple.php\" title=\"BALI TAMAN AYUN TEMPLE SITUATED IN MENGWI VILLAGE WITH VERY BEAUTIFULL GARDEN INSIDE THE TEMPLE\">BALI TAMAN AYUN TEMPLE SITUATED IN MENGWI VILLAGE WITH VERY BEAUTIFUL GARDEN INSIDE THE TEMPLE</a></h2>\n<a href=\"https://www.baligoldentour.com/taman-ayun-temple.php\"><img src=\"images/bali-interest-place/taman-ayun-temple-bali-golden-tour.jpg\" alt=\"TAMAN AYUN TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"TAMAN AYUN TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n\n\n<p class=\"text-justify\"><strong><a href=\"https://www.baligoldentour.com/taman-ayun-temple.php\" title=\"Bali Taman Ayun Temple\">Bali Taman Ayun Temple</a></strong> is situated in Mengwi Village of Badung District, around 18 km to  the west of Denpasar. It is a very beautiful temple, as the name tells (<strong>Taman Ayun means temple in a beautiful garden)</strong>. In addition to its beauty, Taman Ayun Temple is also considered to have historical values, which makes the  regional government of Bali suggests the UNESCO in 2002 that this temple is included in World Heritage List. Taman Ayun Temple is indeed a temple that is very often visited by tourists when taking an afternoon trip to <a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\" title=\"Tanah Lot Temple\">Tanah Lot Temple</a>, because the Taman Ayun tourist attraction is located in Tabanan Village, so it is in the direction of Tanah Lot, where many are often included in the <a href=\"https://www.baligoldentour.com/bali-tanah-lot-tour.php\" title=\"Half Day Tanah Lot Tour\">Half Day Tanah Lot Tour</a> program, for those of you who want to visit Tanah Lot. those of you who want to visit Taman Ayun, you can take this tour package</p>\n<p class=\"text-justify mb-2\"><strong>If you visit Taman Ayun Temple, Here all you need to know</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#location-taman-ayun\">Taman Ayun Temple Location</a></li>\n<li><a href=\"#history-taman-ayun\">Taman Ayun Temple History</a></li>\n<li><a href=\"#restoration-taman-ayun\">Restoration in Taman Ayun Temple</a></li>\n<li><a href=\"#unesco-taman-ayun\">Taman Ayun Temple UNESCO World Heritage List</a></li>\n<li><a href=\"#geographicaly-taman-ayun\">Taman Ayun Temple Geographicaly</a></li>\n<li><a href=\"#function-taman-ayun\">Function Taman Ayun Temple</a></li>\n<li><a href=\"#facilities-taman-ayun\">Taman Ayun Temple Facilities</a></li>\n</ul>\n<span id=\"history-taman-ayun\">\n<h3 class=\"font-small\">Taman Ayun Temple Location</h3>\n<div class=\"row\">\n  <div class=\"col-md-8\">\n<p class=\"text-justify\">The location of the Taman Ayun Temple is located on Jl. Ayodya No.10, Mengwi, Kec. Mengwi, Badung Regency, Bali 80351, which is located in the village of Mengwi and is often also called the Mengwi Temple, a very strategic location which is located not far from other tourist destinations that are no less interesting. If you are traveling from the Kuta area, it takes about 90 minutes to reach this location and if you are from Ubud it will take about 75 minutes. It's not so difficult to find the location of this Taman Ayun Temple, you can use the help of Google Maps if you want to explore yourself here and also at each fork in the road there are already many signposts that show the direction of this Taman Ayun Temple. If you don't want to explore on your own, you can use our <a href=\"https://www.baligoldentour.com/bali-car-charter.php\" title=\"Hire Private Car and Driver\">Hire Private Car and Driver</a> services at low prices and of course a very satisfying service, or take one of the packages, namely the <a href=\"https://www.baligoldentour.com/bali-tanah-lot-tour.php\" title=\"Half Day Tanah Lot Sunset Tour\">Half Day Tanah Lot Sunset Tour</a> which will visit the Taman Ayun Temple and also the temple. Tanah Lot with a very stunning sunset, with a comfortable car and a very friendly driver will make this trip even more enjoyable and will make a trip to Taman Ayun Temple very meaningful.</p>\n</div>\n<div class=\"col-md-4\">\n<iframe src=\"https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d15782.256228400764!2d115.1726013!3d-8.5416323!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x0%3A0xaf262ff28fc4caed!2sTaman%20Ayun%20Temple!5e0!3m2!1sen!2sid!4v1662253342973!5m2!1sen!2sid\" class=\"full-width\" width=\"400\" height=\"275\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>\n</div>\n</div>\n</span>\n<span id=\"history-taman-ayun\">\n<h3 class=\"font-small\">Taman Ayun Temple History</h3>\n<p class=\"text-justify\">Taman Ayun Temple is a Mother Temple (Paibon) to Mengwi Kingdom. This temple was built by Mengwi King, I Gusti Agung Putu, in the Javanese year of 1556 (1634 AD).  Initially, I Gusti Agung Putu built a taman ayun temple to the north of Mengwi village to the worship of his ancestors. The temple was named Genter Park. When Mengwi  grew into a big kingdom, I Gusti Agung Putu moved Genter Park eastward and expand the compound. The expanded temple was officially declared Taman Ayun Temple on Kliwon Tuesday - Medangsia the fourth month in the Javanese year of 1556. Until today, each Kliwon Tuesday of wuku Medangsia in Javanese calendar  (Saka), a piodalan (ceremony) is held in this temple to celebrate the temple’s anniversary. The purpose and objective of establishing these temple by the king is so that he and the people of the Mengwi kingdom can seek blessings for the safety, welfare and fertility of the country. Also to give the opportunity for all Mengwi people to participate in religious ceremonies at the Taman Ayun temple, for example, teaching and learning, mendak sangpitara, nunas pekuluh (holy water) to eradicate pests in the fields and others. Taman Ayun Temple was also built as well as a shrine to worship \"Pasek Badak\" to worship the spirit of Pasek Badak which was carried by all Bala Putra cadets of stone (royal soldiers).</p>\n</span>\n<div class=\"row\">\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/taman-ayun-temple.php\"><img src=\"images/bali-interest-place/taman-ayun-temple-1.jpg\" alt=\"INSIDE TAMAN AYUN TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"400\" height=\"275\" class=\"full-width mb-3\" title=\"INSIDE TAMAN AYUN TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a></div>\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/taman-ayun-temple.php\"><img src=\"images/bali-interest-place/taman-ayun-temple-2.jpg\" alt=\"INSIDE TAMAN AYUN TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"400\" height=\"275\" class=\"full-width mb-3\" title=\"INSIDE TAMAN AYUN TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a></div>\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/taman-ayun-temple.php\"><img src=\"images/bali-interest-place/taman-ayun-temple-3.jpg\" alt=\"INSIDE TAMAN AYUN TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"400\" height=\"275\" class=\"full-width mb-3\" title=\"INSIDE TAMAN AYUN TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a></div>\n</div>\n<span id=\"restoration-taman-ayun\">\n<h3 class=\"font-small\">Restoration Taman Ayun Temple</h3>\n<p class=\"text-justify\">Taman Ayun Temple was greatly influenced by the ups and downs of the Mengwi kingdom in 1890 AD (1812 Caka) a war broke out with the King of Badung, Mengwi suffered defeat and the king of Mengwi (the tenth) \"I Gusti Agung Made Agung\" died in the battle and the whole family was still alive escape to the east. In 1911 AD, part of the royal family returned to Mengwi and Taman Ayun Temple was treated again. But on Saturday, January 20, 1971 AD there was a very powerful earthquake (gejer) so that many of the existing buildings collapsed and were damaged. Has gone through a number of restoration works. Large scale  restoration was implemented in 1937. In 1949, restoration work was done to the  kori agung (the grand room), Bentar temple. A big wantilan was also constructed  during the time. The third restoration was implemented in 1972, followed by the  final restoration in 1976. For those who like to take pictures, the Kori Agung (main gate) that stands majestically is an object that is very suitable to be used as a backdrop.</p>\n</span>\n<span id=\"unesco-taman-ayun\">\n<h3 class=\"font-small\">Taman Ayun Temple UNESCO World Heritage List</h3>\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/taman-ayun-temple.php\" title=\"Bali Taman Ayun Temple\">Bali Taman Ayun Temple</a> is considered to have a very high historical value and a very important role in the history of Badung Regency where the Taman Ayun Temple was built by King Mengwi with the aim of worshiping the ancestral spirits of the kings which was realized by the construction of a gedong paibon, The local community and government recommends the existence of Taman Ayun Temple to The World Heritage Center or UNESCO (United Nations Educational, Scientific and Cultural Organization) to become one of the world heritages (world heritage). so that In 2022 the provincial government of Bali proposed to UNESCo that this Taman Ayun Temple be included in the World Heritage List and finally after a very long wait, about 10 years, and in 2012 UNESCO finally agreed to include this Taman Ayun Temple in the world. heritage list which stipulates that Taman Ayun Temple is part of a world cultural heritage site. Taman Ayun Temple is a historic building which is a relic of the Mengwi kingdom in ancient times, with its stipulation as one of the cultural heritages, this temple is increasingly preserved so that it will be seen by future generations and remind us of the history of the ancient ancestors when build this Taman Ayun temple along with its function and purpose.</p>\n</span>\n<span id=\"geographicaly-taman-ayun\">\n<h3 class=\"font-small\">Taman Ayun Temple Geographicaly</h3>\n<p class=\"text-justify\">\nTemples in Bali in general will use the Tri Mandala concept in building temple complexes, and this concept was first introduced by Dang Hyang Nirartha who was on a holy journey to spread religious teachings on the island of Bali in ancient times, and this concept is still used today, as well as Taman Ayun Temple in Mengwi Village also takes the concept of Tri Mandala as the concept of the room and building of this sacred temple area. Taman Ayun Temple is divided into three inner courts, just like the temples in Bali, where the three courtyards consist of the most sacred parts called Utama Mandala (offal), Madia Mandala (Jaba Tengah) and Nista Mandala (jabaan). To enter the Main Mandala, Kori Agung (Paduraksa) was built, while in Madia and Nista Mandala, a bentar temple (Apit Surang) was built. Taman Ayun Temple complex consists of an 1 outer court and 3 inner courts, which can be explained as follows</p>\n<ol class=\"mb-2\">\n<li class=\"mb-2\"><strong>The outer courtyard</strong> : this outer courtyard of the taman ayun temple also known as Jaba, is located on the outer side of the pond. There is a bridge over the pond that surrounds the Taman Ayun temple area, the function of the bridge is to connect the outer court to the first inner court. Where on this bridge There are 2 large statues located to the left and right of the end of the bridge, which serve as spiritual guardians of the Taman Ayun Temple, to prevent negative things from entering the Taman Ayun Temple, at the end of the bridge, on the side of the first inner court, there is a Bentar gate followed by a path leading to the first inner court.</li>\n<li class=\"mb-2\"><strong>The first inner courtyard</strong> : On the left side of the Taman Ayun Temple route, near the gate, there is a small guard post. Here, in the first inner court, there is a Wantilan (a kind of hall) where several ceremonies are usually held, including cockfighting, which is also part of the ritual ceremonies at the temple. There was a path that crossed the first inner court and divided it into two parts, connecting the gates to the first inner court with those to the second inner court. In the southwest, there is a round gazebo where people can rest and enjoy the beauty of the temple. There is a pond near the gazebo overgrown with water lilies. Right in the middle of the pond, there was a small pillar that splashed water in nine different directions. To the east there is a cluster of small temples called the Luhuring Purnama Temple. There is a gate at the end of the Taman Ayun Temple trail which divides the first inner court into two. The gate led to the second inner court, which was on a higher ground than the first.</li>\n<li class=\"mb-2\"><strong>The second inner courtyard</strong> : you go through the gate to go up to the second courtyard and Across the gate there is a building that serves as a partition. The bulkhead of Taman Ayun Temple is decorated with relief sculptures depicting the nine guardian gods of the winds. In the east there is a small temple called Pura Dalem Bekak. To the west, around the corner, is the Kulkul hall with its high roof. In the second courtyard, many tourists often take pictures in front of the Gate leading to the third (main) courtyard, here producing a very beautiful photo object, with the characteristic of the gate full of Balinese carvings made of bricks and pars stone.</li>\n<li class=\"mb-3\"><strong>The third inner courtyard</strong> : which is also the deepest and highest, is the most sacred area. The main door, called the door coil, is placed right in the middle and is only opened during ceremonies. However, the main door of Taman Ayun Temple is flanked by two gates through which people can access the courtyard to carry out their daily routines at Taman Ayun Temple. The court houses several Merus, a temple, a Gedong, a Padmasana, a Padma Rong Telu, and other religious buildings.</li>\n</ol>\n</span>\n\n<span id=\"function-taman-ayun\">\n<h3 class=\"font-small\">Function of Taman Ayun Temple</h3>\n<p class=\"text-justify mb-2\">Taman Ayun Temple as a tourist destination that is very often visited by foreign and domestic tourists in the village of Mengwi, several other functions of the Taman Ayun Temple temple are related to the local community here, while these functions play a very important role in welfare in carrying out activities. ceremonies or other social activities, and this Taman Ayun Temple can also be said as a unifying tool for various caste groups around this area which can be seen during religious ceremonies at this Taman Ayun Temple, many people from various groups and castes come here and help each other. one another and without distinction of race or class. A very good function role in the welfare of the community in social life, as for some of the functions of the Taman Ayun Temple that the author can describe are as follows:</p>\n<ol class=\"mb-3\">\n<li class=\"text-justify mb-2\"> As a guardianship temple (Pengawatan) so that people in Mengwi village who do not have time to pray to the big temples in Bali such as <a href=\"https://www.baligoldentour.com/besakih-temple.php\" title=\"Besakih Temple\">Besakih Temple</a>, <a href=\"https://www.baligoldentour.com/uluwatu-temple.php\" title=\"Uluwatu Temple\">Uluwatu Temple</a>, <a href=\"https://www.baligoldentour.com/batur-temple.php\" title=\"Batur Temple\">Batur Temple</a>, <a href=\"https://www.baligoldentour.com/batu-karu-temple.php\" title=\"Batukaru Temple\">Batukaru Temple</a>, <a href=\"https://www.baligoldentour.com/ulun-danu-temple.php\" title=\"Ulun Danu Beratan Temple\">Ulun Danu Beratan Temple</a>, and others, they can come to Taman Ayun Temple and acts as an intermediary for praying at the big temple, So a temple that can be used as an intermediary if you don't have time to pray to the big temples on the island of Bali</li> \n<li class=\"text-justify mb-2\"> As a unifier of the people in the village of Mengwi from various castes and blend into one who worships at this Taman Ayun Temple, It can be said that during the ceremony at Taman Ayun Temple, many Hindus from various castes mingled here with the aim of praying and asking for salvation, here they mingled without regard to caste and together offered worship to God Almighty, also that Taman Ayun Temple is a unifying for all caste groups in this village</li> \n<li class=\"text-justify mb-2\"> As a source of irrigation, where the temple is surrounded by a pond which is also used as water to irrigate the fields around the temple by the local community, , around the Taman Ayun temple there is a very large ponds pond and this water flows into irrigation channels in the local village where the water is used for irrigating the rice fields and plantations of local residents, so you could say this water is very useful for the preservation of the surrounding rice fields.</li> \n<li class=\"text-justify mb-2\"> As a place for recreation and gathering of members of the Mengwi kingdom in ancient times, and until now Taman Ayun Temple is also used by local people and other Hindus in Bali as a place of recreation to enjoy the beauty of the garden that was built in the ancient kingdom, with a very beautiful, safe and calm atmosphere that makes Taman Ayun Temple very worthy as Recreation areas, You can enjoy this beauty when you enter the first page, with a very beautiful garden setting that will complete your tour here</li> \n</ol>\n</span>\n\n<span id=\"facilities-taman-ayun\">\n<h3 class=\"font-small\">Taman Ayun Temple Facilities</h3>\n<p class=\"text-justify mb-2\">As for being one of the temple tourist destinations that is never empty, this <a href=\"https://www.baligoldentour.com/taman-ayun-temple.php\" title=\"Bali Taman Ayun Temple\">Bali Taman Ayun Temple</a> has very complete facilities, so that it will make tourists feel very comfortable visiting Taman Ayun Temple. From a very large parking lot, it will make the atmosphere comfortable, you don't need to think long when visiting Taman Ayun because the parking lot is spacious and can accommodate large buses too, there is a shop selling cold food and drinks in front of the temple, you can buy if you feel thirsty and the price is quite very cheap and there are also toilet facilities that you can use, this toilet facility is located on the first page of the Taman Ayun temple, besides that the garden facilities are very spacious and will spoil your eyes to see the beauty of this temple. Taman Ayun Temple is an experience that will never be forgotten by visiting one of the important temples in the Mengwi village and is one of the relics of the Mengwi kingdom in ancient times. If you are on vacation on the island of Bali, take the time to visit this Taman Ayun Temple with all its uniqueness and beauty that will complete your religious adventure on the island of Bali.</p>\n</span>"
]