[
  "<h1><a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\" title=\"TANAH LOT TEMPLE\">TANAH LOT TEMPLE</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\" title=\"TANAH LOT TEMPLE IS BALINESE HINDU SEA TEMPLE OR KNOWN AS FLOATING TEMPLE WHICH IS BUILT ON THE ROCK 3 ACRE SIZE IN THE SEA\">TANAH LOT TEMPLE IS BALINESE HINDU SEA TEMPLE OR KNOWN AS FLOATING TEMPLE WHICH IS BUILT ON THE ROCK 3 ACRE SIZE IN THE SEA</a></h2>\n<a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\"><img src=\"images/bali-interest-place/tanah-lot-temple-bali-golden-tour.jpg\" alt=\"TANAH LOT TEMPLE | FLOATING TEMPLE  | SEA TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1000\" height=\"500\" class=\"auto-width mb-3\" title=\"TANAH LOT TEMPLE | FLOATING TEMPLE | SEA TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n\n<p class=\"text-justify\"><strong><a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\" title=\"Tanah Lot Temple\">Tanah Lot Temple</a></strong> is located in coastal side of Beraban countryside, Kediri sub  district and Tabanan Regency. It is  situated in 30 Km in west side of Denpasar town and about 11 Km in south side of Tabanan town. The Tanah Lot temple is built on the rock with 3 acre size and reachable in a few minute by walk, because it is just 20 meters from the coastal lip. This temple is very famous among tourist destinations in Bali with spectacular view of sunset. At some nooks of coral reef around Tanah Lot Temple. With this natural beauty, making Tanah Lot Temple a favorite destination on the island of Bali. Tanah Lot has always been a tourist destination that is always visited by tourists, with the beauty of the temple and the sunset making Tanah Lot Temple visited by thousands of foreign and domestic tourists every day. Here you will see many tourists who are enthusiastic to see the uniqueness of the Tanah Lot temple which is so phenomenal to foreign countries</p>\n<p class=\"text-justify mb-2\"><strong> If you visit Tanah Lot Temple, here's what you need to know : </strong> </p>\n<ul class=\"mb-4\">\n<li><a href=\"#location\">Location of Tanah Lot Temple</a></li>\n<li><a href=\"#popular\">Tanah Lot Temple Popular Tourim Site </a></li>\n<li><a href=\"#meaning-tanah-lot\">Meaning Word Tanah Lot</a></li>\n<li><a href=\"#history-tanah-lot\">Tanah Lot Temple History </a></li>\n<li><a href=\"#uniqueness-tanah-lot\">The Uniqueness of Tanah Lot Temple</a></li>\n<li><a href=\"#holy-snakes\">Holy Snakes at Tanah Lot Temple</a></li>\n<li><a href=\"#holy-water\">Holy Water at Tanah Lot Temple</a></li>\n<li><a href=\"#function-tanah-lot\">Function Tanah Lot Temple</a></li>\n<li><a href=\"#batu-bolong\">Batu Bolong Temple at Tanah Lot</a></li>\n<li><a href=\"#why-called-batu-bolong\">Why is it called Batu Bolong?</a></li>\n<li><a href=\"#unique-batu-bolong\">The Uniqueness of Batu Bolong Temple</a></li>\n<li><a href=\"#dress-code\">Tanah Lot Temple Dress Code</a></li>\n<li><a href=\"#facilities\">Facilities at Tanah Lot Temple</a></li>\n<li><a href=\"#best-time\">Best Time to Visit Tanah Lot Temple</a></li>\n</ul>\n<span id=\"location\">\n<h3 class=\"font-small\">Location of Tanah Lot Temple</h3>\n<div class=\"row\">\n  <div class=\"col-md-8\">\n<p class=\"text-justify mb-4\">The location of the <a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\" title=\"Tanah Lot Temple\">Tanah Lot Temple</a> is located in Tabanan Regency, Braban village which is located in the west area of ​​​​the island of Bali, where in this area there are also many tourist destinations that are no less interesting. The location of the Tanah Lot Temple is also close to the Batu Bolong Temple tourist destination which is only a few meters from Tanah Lot, where you can visit Batu Bolong Temple and Tanah Lot Temple at one time. Tanah Lot is not so difficult to find, armed with a google map and follow the path and you will arrive at this location. If you depart from kuta it will take about 60 minutes if there is no traffic and if from seminyak it will take about 45 minutes if there is no traffic, but with the current situation, traffic jams are along the way, hope you can leave early so you don't miss the sights The sunset is very beautiful here.</p>\n</div>\n<div class=\"col-md-4\">\n<iframe src=\"https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d15778.948651571252!2d115.086807!3d-8.621213!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x0%3A0xcaabe270f7e34d69!2sTanah%20Lot!5e0!3m2!1sen!2sid!4v1659780537861!5m2!1sen!2sid\" class=\"full-width\" width=\"400\" height=\"225\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>\n</div>\n</div>\n</span>\n<span id=\"popular\">\n<h3 class=\"font-small\">Tanah Lot Temple Popular Tourim Site</h3>\n<p class=\"text-justify\">The island of Bali has always been famous as a holiday destination, besides there are many tourist objects that are very interesting and always give a good impression on tourists. Tanah Lot Temple has always been a very popular tourist destination among both foreign and domestic tourists, with its peerlessly beautiful scenery that will always be memorable in the hearts of visitors, it is not wrong if Tanah Lot Temple is the number one tourist destination on the island of Bali besides <a href=\"https://www.baligoldentour.com/uluwatu-temple.php\" title=\"Uluwatu Temple\">Uluwatu Temple</a> which is also a very popular tourist destination on this beloved island of Bali. The object that is most frequently visited is the <a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\" title=\"Tanah Lot Temple\">Tanah Lot Temple</a>, which is a temple located on the beach and standing on a rock, when the tide comes, the Tanah Lot temple will look like it is floating in the ocean. This uniqueness makes this place much in demand by tourists. In addition, at Tanah Lot Temple you can see the beauty of the sunset process, this is also in great demand by tourists to admire the spectacular natural beauty. If you visit the island of Bali, don't forget to visit the Tanah Lot Temple with all its uniqueness and the beauty of the sunset.</p>\n</span>\n<span id=\"meaning-tanah-lot\">\n<h3 class=\"font-small\">Meaning of Word Tanah Lot Temple </h3>\n<p class=\"text-justify\">The word of Tanah Lot is consisted of two  words that are Tanah word interpreted as a reef looking like gili or isle. Lot or Lod word has meaning the sea. So <strong>Tanah Lot is meaning the small island  floating on the sea.</strong> The location is now called as Tanah Lot has been used at a Megalithic period as a place that looked into holy, proven from the existence  of menhir. Pursuant to environmental condition, hence the structure of Tanah Lot Temple is built at irregular  reef plain of its angle which is only consisted of one plain yard as Jeroan. Tanah Lot Temple differences with other temples on the island of Bali, Tanah Lot does not have a few pages because it is built on a plain of coral that irregular corners of his home. Inside the actual  temple compound itself there are tiered shrines that follow the fundamental elements of Balinese design where the number of levels constructed are symbolic to the complexities of the faith. There are other formations within the area  that indicate that the site is not only of great religious importance, but also maintains archaeological value. Temple nestled in the ocean has a ritual or ceremony which takes place  every 6 months or 210 days. At that time all the Hindus from different areas in  Bali will come to worship in peace and harmony to invoke</p>\n</span>\n<a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\"><img src=\"images/bali-interest-place/tanah-lot-temple-2.jpg\" alt=\"SUNSET AT TANAH LOT TEMPLE | FLOATING TEMPLE  | SEA TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1000\" height=\"500\" class=\"auto-width mb-3\" title=\"SUNSET AT TANAH LOT TEMPLE | FLOATING TEMPLE | SEA TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n<span id=\"history-tanah-lot\">\n<h3 class=\"font-small\">Tanah Lot Temple History</h3>\n<p class=\"text-justify\">The history of <a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\" title=\"Tanah Lot Temple\">Tanah Lot Temple</a> is based on a legend circulating in the community, where it is narrated that in the 15th century, Bhagawan Dang Hyang Nirartha or known as Dang Hyang Dwijendra carried out a mission to spread Hinduism from Java to Bali. At that time the ruler on the island of Bali was King Dalem Waturenggong. He very much welcomed the arrival of Dang Hyang Nirartha in carrying out his mission, so that the spread of Hinduism managed to reach remote villages on the island of Bali. Once, Dang Hyang Nirartha saw a holy light from the southern sea of ​​Bali, so Dang Hyang Nirartha looked for the location of the light and he arrived at a beach in a village called Beraban Tabanan village. At that time the village of Beraban was led by the Bendesa Beraban Sakti, who strongly opposed the teachings of Dang Hyang Nirartha in spreading Hinduism. Bendesa Beraban Sakti, adheres to the flow of monotheism. Dang Hyang Nirartha meditated on a rock that resembled the shape of a parrot that was originally on land. In various ways, Bendesa Beraban wanted to expel the existence of Dang Hyang Nirartha from his meditation place. It is said that in order not to be disturbed by his meditation by the Beraban Bendesa who tried to drive him away, Dang Hyang Nirartha moved the rock (where he meditated) to the middle of the beach with spiritual power. The rock is named Tanah Lot which means rock in the middle of the ocean. Since that incident the Bendesa Beraban Sakti acknowledged the supernatural powers of Dang Hyang Nirartha by becoming his followers to embrace Hinduism along with all the local residents. and a Tanah Lot temple was built and guarded by a temple guard who was created from Danghyang Niratha's poleng seledang. Then the shawl was changed into a seahorse commonly called a lipi poleng (black-and-white snake). Before leaving the village of Beraban, Dang Hyang Nirartha gave a dagger to the village chief of Beraban. The keris has the power to eliminate all diseases that attack plants. The keris is kept in Puri Kediri and a religious ceremony is held at Tanah Lot Temple every six months. Since this is routinely done by the residents of Beraban village, the welfare of the residents has greatly improved with abundant agricultural crops and they live with mutual respect.</p>\n<p class=\"text-justify\">We can still see the poleng poleng that turns into a snake which aims to protect the Tanah Lot temple. The snake is believed to be a temple guard who keeps people away from the threat of crime and damage. It is said that if there will be a disaster or natural disaster, the snake will be used as a sign through the king or queen of the red sea snake that appears. In addition, under the temple there is also a fresh spring that can make you stay young. You can ask for youthful water in the western part of Tanah Lot Temple. The last myth is that if unmarried couples visit Tanah Lot Temple, their relationship will not last long, therefore many people who are in pairs but are not married and believe in this myth are afraid to visit</p>\n</span>\n<span id=\"uniqueness-tanah-lot\">\n<h3 class=\"font-small\">The Uniqueness of Tanah Lot Temple </h3>\n<p class=\"text-justify\"><strong><a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\" title=\"Tanah Lot Temple\">Tanah Lot Temple</a></strong> in addition to its natural beauty such as sunsets, also has its own uniqueness, and this uniqueness is only found in Tanah Lot Temple. Apart from the unique location of the Tanah Lot temple standing on a rock where if the water is large this temple will appear to float in the ocean, a very extraordinary sight. You can see this uniqueness at certain times, because not every day the sea water will be large, usually the sea water will be large when it is near the full day, there you can see the uniqueness that emanates from the majesty of this Tanah Lot temple. In addition to the beauty of the temple on the beach, this place also has a mystical thing that is very trusted by local residents, where there is a sacred snake located in front of the temple, and also holy water which is located below, precisely under a rock. </p>\n</span>\n<span id=\"holy-snakes\">\n<h3 class=\"font-small\">Holy Snakes at Tanah Lot Temple</h3>\n<div class=\"row\">\n<div class=\"col-md-8\">\n<p class=\"text-justify\">One of  the uniqueness of the owned <a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\" title=\"Tanah Lot Temple\">Tanah Lot Temple</a> is across the street from the temple  there are a number of caves in which lived a few sea snakes are colored black  and white generally can be met in the coast. Part of its  stomach there are no athwart skin, there is only small skin, but this sea water  snake very noxious but snake bite case are very seldom happened, because the sea  water snake generally very passive. These snakes are very tame and not to be bullied for being  considered a forerunner of the keeper and protect the entire area from unseen evil forces. According to the story of the guardian of this sacred snake, it is said that this sacred snake guards the Tanah Lot temple from negative influences that come, so this sacred snake is very sacred by the local community because it is believed to protect the Tanah Lot temple area from negative things. </p>\n<a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\">\n</a></div><a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\">\n</a><div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\"></a><a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\"><img src=\"images/bali-interest-place/snake-tanah-lot-temple-bali-golden-tour.jpg\" alt=\"HOLY SNAKE TANAH LOT TEMPLE | Bali Golden Tour\" width=\"300\" height=\"225\" class=\"full-width mb-3\" title=\"HOLY SNAKE TANAH LOT TEMPLE | Bali Golden Tour\"></a>\n</div>\n</div>\n</span>\n<span id=\"holy-water\">\n<h3 class=\"font-small\">Holy Water at Tanah Lot Temple</h3>\n<div class=\"row\">\n<div class=\"col-md-8\">\n<p class=\"text-justify\">Holy Water is located right under <a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\" title=\"Tanah Lot Temple\">Tanah Lot Temple</a>, precisely on the rock where there is a small cave where there is a source of fresh water that continues to flow, its uniqueness even though it is located on the beach but there is a fresh water spring here and this fresh water is very purified by the local community and it is believed that a splash of holy water can remove negative things from the body and provide a very comfortable inner calm. Holy water is  believed can bring sustenance to anyone who drank it. The holy water place is guarded by the priests of the Tanah Lot, to maintain the sanctity of this holy water, If the water is not big, you can go to this holy water place and see for yourself the uniqueness of this holy water, you can take the time to ask for holy water to be drunk and sprinkled on your head, so it will give you a sense of comfort, calm and clean from all things negative</p>\n<a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\">\n</a></div><a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\">\n</a><div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\"></a><a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\"><img src=\"images/bali-interest-place/holy-water-tanah-lot-temple-bali-golden-tour-1.jpg\" alt=\"HOLY WATER TANAH LOT TEMPLE | Bali Golden Tour\" width=\"300\" height=\"225\" class=\"full-width mb-2\" title=\"HOLY WATER TANAH LOT TEMPLE | Bali Golden Tour\"></a>\n</div>\n</div>\n</span>\n<span id=\"function-tanah-lot\">\n<h3 class=\"font-small\">Function of Tanah Lot Temple </h3>\n<p class=\"text-justify mb-2\">The function of this  temple can be realized from the function of the main temple building which is  located in the temple main area. In this place, there is a main temple to  worship the god in form of Dewa Baruna or Bhatara Segara, the sea power. The  media of worship to this god is the temple building with 5 storied meanwhile  the 3 storied temple building in north part of this area is purposing to  worship to Dang Hyang Nirartha.<br>\nIn order to know the status of Tanah Lot Temple can be realized from the temple history, function and also incoming devotee  existence pray when temple ceremony is held. In this case can be realized as  follows:</p>\n<ul class=\"mb-2\">\n<li class=\"text-justify\">Tanah Lot Temple as dang Kahyangan (the big Holy Temples in Bali), because the history and the Penyiwi (The people taking care of the temple) are from the local people from Tabanan regency and surrounding area</li>\n<li class=\"text-justify\">Tanah Lot Temple as Segara Temple, because its function as sanctum to worship the Bhatara Segara, the God with manifestation as the ocean Power Deity</li>\n</ul>\n<p class=\"text-justify\">Not be separated from the  myths that includes everything from the establishment of the Tanah Lot Temple this temple remains one of the main icons of tourism in Bali Island. This will be an impressive religious tourism travel for you let alone a visit while  holding rituals accompanied by the event themed Tanah Lot Spectacular will make a trip on the Bali Island is becoming increasingly a memorable one. </p>\n</span>\n<span id=\"batu-bolong\">\n<h3 class=\"font-small\">Batu Bolong Temple at Tanah Lot</h3>\n<p class=\"text-justify\">Meanwhile, there is a very interesting temple, which is located close to the Tanah Lot Temple, which is only a 5-minute walk from Batu Bolong Temple. The name of this temple is Batu Bolong Temple, while the uniqueness of this temple is that it is located on a cliff with a hole in the middle so that seawater can enter the hole. A very spectacular sight. Many tourists also visit this Batu Bolong Temple first, then visit Tanah Lot Temple. As for the Batu Bolong Temple, there is still a unity with the Tanah Lot Temple, this can be seen from the ceremonies held in Tanah Lot along with the ceremonies in Batu Bolong, namely each Budda Wage/Cemeng Langkir. The Batu Bolong Temple was built to worship the God of Holiness and is always used for Melasti and Pakelem ceremonies which means to cleanse the world from negative auras.</p>\n</span>\n<a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\"><img src=\"images/bali-interest-place/batu-bolong-temple.jpg\" alt=\"BATU BOLONG TEMPLE | BALI GOLDEN TOUR\" width=\"1000\" height=\"500\" class=\"auto-width mb-3\" title=\"BATU BOLONG TEMPLE | BALI GOLDEN TOUR\"></a>\n<span id=\"why-called-batu-bolong\">\n<h3 class=\"font-small\">Why is it called Batu Bolong?</h3>\n<p class=\"text-justify\">The name of this stone hole is taken from the place where this temple was founded, which is located on a cliff that extends 30 meters long and under the cliff there is a hole where seawater can enter it. If you are afraid of heights, don't come here, because to get to the temple you will pass a long road leading to the temple which is only about 3 meters wide with a height of about 5 meters from the bottom. From here you can see the view of the Canggu beach which is so beautiful with views of the expanse of the sea making this place very often visited. Most tourists will visit this Batu Bolong temple first and walk through the garden in Tanah Lot and head to Tanah Lot. From a distance the view of Batu Bolong is so beautiful, especially at sunset, the resulting scenery is so beautiful that it is incomparable and very instagrammable</p>\n</span>\n<span id=\"unique-batu-bolong\">\n<h3 class=\"font-small\">The Uniqueness of Batu Bolong Temple</h3>\n<p class=\"text-justify\">The uniqueness of this Batu Bolong temple in addition to the hole under the cliff, it also has its own uniqueness that makes this temple believed to be sacred and has a mystical smell. Where the uniqueness lies in the temple where there is a stone, where this stone emits fresh water and fresh water is called Tirta Pakuluh and is often used for religious ceremonies such as Melasti, Pakelem, Purnama Kapat and Piodalan. The Batubolong temple can only be entered by people who want to pray and the administrators of this temple. This temple building is surrounded by a wall around the temple which aims to prevent people from entering and something unwanted happens. Tourists can only see from the outside, besides that the scenery here is very beautiful, enjoy this spectacular view before you head to Tanah Lot Temple. A very impressive sensation where you can visit two temples that are both unique and very beautiful</p>\n</span>\n<span id=\"dress-code\">\n<h3 class=\"font-small\">Tanah Lot Temple Dress Code</h3>\n<p class=\"text-justify\">Meanwhile, if you visit <a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\" title=\"Tanah Lot Temple\">Tanah Lot Temple</a>, there is no specific dress code, which is expected to respect the people here or the residents who will pray, with you wearing polite clothes and don't use swim suites to come here, because is open clothing and very inappropriate if you use it. the clothes to visit the temple area. And if you want to pray at Tanah Lot temple you can wear Balinese clothes where men wear sarong, shawl and udeng and for women wear kebaya, sarong and shawl. Where the clothes are mandatory if you want to worship in this sacred temple area. So if you visit Tanah Lot Temple, it is hoped that you can wear polite clothes</p>\n</span>\n<span id=\"facilities\">\n<h3 class=\"font-small\">Facilities at Tanah Lot Temple</h3>\n<p class=\"text-justify\">As for the facilities in Tanah Lot, it is very complete in supporting it as one of the most frequently visited tourist destinations. From the parking area you will walk to the Tanah Lot temple, along the way you will see many souvenir shops selling souvenirs of various kinds of handicrafts, and there are restaurants that you can visit if you want to eat, there are toilets that you can use and also attractions such as take pictures with the yellow python snakes are also here and also here there is an instant photo service that sells photo services in Tanah Lot, you can use the photo services if you want to capture the moment when you visit this very beautiful Tanah Lot temple. In addition there is also a restaurant on the beach with a view of Tanah Lot, very suitable if you want to spend time enjoying the view of Tanah Lot while drinking at this restaurant. A sensation that may not be forgotten for you where to see the natural wonders of the sunset on the island of the gods Bali</p> \n</span>\n<span id=\"best-time\">\n<h3 class=\"font-small\">Best Time to Visit Tanah Lot Temple:</h3>\n<p class=\"text-justify\">The most popular time  to pay a visit to Tanah Lot Temple is late afternoon when the sun begins to settle  over the horizon and the temple is silhouetted against the vibrant glow of the  sky. The site draws a crowd of travellers who come by bus load to witness this  magnificent temple scene against a background of crashing waves. We from <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a> offer tour packages to visit the Tanah Lot temple at affordable prices and satisfying services. You can check the details of the tour here <a href=\"https://www.baligoldentour.com/bali-tanah-lot-tour.php\" title=\"Bali Tanah Lot Tour\">Bali Tanah Lot Tour</a>, beside tanah lot temple, you also can visit <a href=\"https://www.baligoldentour.com/taman-ayun-temple.php\" title=\"Taman Ayun Temple\">Taman Ayun Temple</a> at mengwi village with beautiful view of garden and fish ponds, in addition to tour packages, we also offer private car charters that you can rent and visit tourist attractions on the island of Bali according to the itinerary you have</p> \n        </span>"
]