[
  "<h1><a href=\"https://www.baligoldentour.com/tirta-gangga.php\" title=\"TIRTA GANGGA WATER PALACE\">TIRTA GANGGA WATER PALACE</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/tirta-gangga.php\" title=\"TIRTA GANGGA WATER PALACEIS A BEAUTIFUL RECREATIONAL GARDEN IN EAST BALI, DERIVED FROM TWO WORDS &quot;TIRTA&quot; MEAN BLESSED WATER AND WORD &quot;GANGGA&quot; MEAN HOLY RIVER IN INDIA\">TIRTA GANGGA WATER PALACE IS A BEAUTIFUL RECREATIONAL GARDEN IN EAST BALI, DERIVED FROM TWO WORDS \"TIRTA\" MEAN BLESSED WATER AND WORD \"GANGGA\" MEAN HOLY RIVER IN INDIA</a></h2>\n<a href=\"https://www.baligoldentour.com/tirta-gangga.php\"><img src=\"images/bali-interest-place/tirta-gangga-park-bali-golden-tour.jpg\" alt=\"TIRTA GANGGA WATER PALACE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1000\" height=\"500\" class=\"full-width mb-3\" title=\"TIRTA GANGGA WATER PALACE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n<p class=\"text-justify\"><strong><a href=\"https://www.baligoldentour.com/tirta-gangga.php\" title=\"Tirta Gangga Water Palace\">Tirta Gangga Water Palace</a></strong> is one  of the famous tourist destinations in east part of Bali and it  is one the stop points of tourist object on <a href=\"https://www.baligoldentour.com/bali-east-tour.php\" title=\"Bali East Tour\">Bali East Tour</a> and <a href=\"https://www.baligoldentour.com/bali-lempuyang-tour.php\" title=\"Bali Lempuyang Tour\">Bali Lempuyang Tour</a> Itinerary.  In the middle of park, there are many small statues are intentionally set on  the stone to decorate the park in order to make a good looking. All of the  statues are taken from the Hindu Historical epos like Maha Bharata or Ramayana. On this page, we present the statue photo at Tirta Gangga Water Palace. A very popular place right now where many tourists come here to see the beauty of the pond with its very beautiful koi fish, and this place is very often used as a place to take Instagram photos because the resulting photos are so beautiful and very instagramable. If by chance you visit the eastern area of ​​​​the island of Bali, it would be nice if you stop here and take pictures in the pond with the beautiful koi fish</p>\n<p class=\"text-justify mb-2\"><strong>All you need to know Tirta Gangga Water Palace</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#part-of-tour\">Part of Tour Site in East Bali</a></li>\n<li><a href=\"#history-tirta-gangga\">History of Tirta Gangga</a></li>\n<li><a href=\"#location-tirta-gangga\">Location of Tirta Gangga</a></li>\n<li><a href=\"#complex-description\">Tirta Gangga Complex Description</a></li>\n<li><a href=\"#holy-water\">Holy Water at Tirta Gangga</a></li>\n<li><a href=\"#facility-tirta-gangga\">Facility at Tirta Gangga</a></li>\n<li><a href=\"#how-get-to-tirta-gangga\">How Get to Tirta Gangga</a></li>\n</ul>\n<span id=\"part-of-tour\">\n<h3 class=\"font-small\">Part of Tour Site in East Bali</h3>\n<p class=\"text-justify\">If we read about tours to the east of the island of Bali, you can definitely see that the Tirta Gangga Water Palace is always there, which means that this place is very popular among foreign and domestic tourists who want to see the uniqueness of the Tirta Gangga Water Palace. And this one site is one of the important sites that is often included in tours to the east of Bali. In addition to its very strategic location which is located on the main road to Lempuyang or Amed. When talking about tourist attractions in the East of the island of Bali, it certainly doesn't escape the name <strong>Tirta Gangga Water Palace</strong>, this is one of the famous tourist attractions in the eastern area of ​​​​the island of Bali. This place is often visited by foreign and domestic tourists. On holidays this place is very crowded, most tourists come here to see the beauty of the garden with ponds and large goldfish. Here there is a special pool for those of you who want to bathe in this pool, as for the water is clear and original from the springs that come from this Tirta Gangga Water Palace.</p>\n</span>\n<span id=\"history-tirta-gangga\">\n<h3 class=\"font-small\">History of Tirta Gangga Water Palace :</h3>\n<p class=\"text-justify\">A visit to Tirta Gangga is incomplete without knowing the history of this Tirta Gangga Water Palace, where based on the sources we read, we can describe that the history of Tirta Gangga began during the Karangasem Kingdom. Tirta gangga built in 1948 by King of karangasem, ;Anak  Agung Anglurah Ketut Karangasem. This water park is constructed  in a very unique architectural style of Bali and China. This palace has been shaped in the form of a  beautiful water garden and it is located near a natural spring. This spring  wells up under a hugh banyan tree which stands at the foot of a hill. At the  top of this hill stands a village temple. The scenery of the area is fantastic with great views and the  climate is relatively cool. These facts, together with the religious rites of  the spring, inspired the King to build himself a private country house nearby  this spring set amidst a beautiful recreational garden. He called it Tirta gangga - derived from the words 'Tirta' (blessed water) and 'Gangga' from  'Ganges', the holy river in India.</p>\n</span>\n<span id=\"location-tirta-gangga\">\n<h3 class=\"font-small\">Location of Tirta Gangga Water Palace :</h3>\n<p class=\"text-justify\">Tirta gangga located at Ababi Village, Abang Sub-district, Karangasem Regency in east part of Bali, about  83 km from Denpasar and 6 km from Amlapura to the north. If you travel from Denpasar city it will take about 2 hours by car to reach the Tirta Gangga Water Palace location lokasi. But on the way to Tirta Gangga, you can see the surrounding scenery leading to the countryside and see the activities of the local people in the countryside. The location of Tirta Gangga is very strategic, located on the main road to Lempuyang and Amed, where many tourists who have finished diving in Amed stopped for a moment here to see the beauty of this Tirta Gangga. Meanwhile, if you travel from the Kuta area, it will take about two hours to travel and if you are from Ubud it will take about 1 hour 30 minutes by car or motorbike. The journey is long and far away but the result will be very worth it where you will see the pool and shower water which is very instagrammable</p>\n</span>\n<span id=\"complex-description\">\n<h3 class=\"font-small\">Complex Description of Tirta Gangga Water Palace : </h3>\n<p class=\"text-justify\">Tirta gangga places in <em>1.2 hectares</em> in area which consists of <em>three complexes</em>. The first complex that is at the very bottom to find two lotus ponds and fountains. The second complex is the center where it can be found in a swimming pool, while, on the third part, namely the third we can find the resting place of kings. Before this water palace is found, there is big wellspring found in this area which the local society believe that this water come from the land is holy spring therefore they call this place is Embukan means wellspring. The spring is then enabled to meet the needs of the population will be water  and also as a<em>“pemurnian”(purification) </em>of the Gods. For this  purpose, the spring was considered holy and sacred. Religious aspects of constructing Tirta gangga park to break the king house and also to the general function of decent to watch. The King of Karangasem has got an idea to improve this park into a good looking and nowadays, it becomes one of the famous tourist destination in  east part of Bali.</p>\n<div class=\"row\">\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/tirta-gangga.php\"><img src=\"images/bali-tours-packages/bali-tirta-gangga-1.jpg\" alt=\"Tirta Gangga Water Palace\" title=\"Tirta Gangga Water Palace\" width=\"300\" height=\"225\" class=\"full-width mb-2\"></a></div>\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/tirta-gangga.php\"><img src=\"images/bali-tours-packages/bali-tirta-gangga-2.jpg\" alt=\"Tirta Gangga Water Palace\" title=\"Tirta Gangga Water Palace\" width=\"300\" height=\"225\" class=\"full-width mb-2\"></a></div>\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/tirta-gangga.php\"><img src=\"images/bali-tours-packages/bali-tirta-gangga-3.jpg\" alt=\"Tirta Gangga Water Palace\" title=\"Tirta Gangga Water Palace\" width=\"300\" height=\"225\" class=\"full-width mb-2\"></a></div>\n</div>\n<p class=\"text-justify\">The water gardens at <strong>Tirta Gangga Water Palace</strong> show a unique mix of Balinese and Chinese architecture. The grounds of the water garden (ca 1.2 ha.) consists of three separate complexes each with ponds and many sculptures. The complex on the lowest level has two large ponds and a water tower with clean and fresh water. At the second complex (middle level) are the swimming pools. The third level houses the main complex with the country home of the former King. Nowadays one can find a restaurant and four bungalow units (which are for rent) in this former country home of King A.A. Anglurah Ketut Karangasem. Building water gardens, including the designing and the labor work, was a favorite hobby of the King. As many of his visitors did not expect this, of course they were surprised to find the King himself working among his labourers, standing knee deep in mud digging out the earth.</p>\n<p class=\"text-justify\">A reservoir on the grounds receives the springwater and from  this reservoir drinking water is delivered via a pipe system to the town of  Amlapura. There is also an underground pipe system which leads to the upper  swimming pool, where it emerges through the mouth of a raksasa (a demon statue)  which stands at a corner of the pool. Here the water flows over into a lower  level pool. From this lower level pool it flows into some small fish ponds and  from there into the rice fields that border the gardens.</p>\n</span>\n<span id=\"holy-water\">\n<h3 class=\"font-small\">Holy Water at Tirta Gangga Water Palace :</h3>\n<p class=\"text-justify\">In Tirta Gangga there is a spring which is very purified by the local community, where every religious ceremony takes place, they always go to this spring to take holy water for ceremonial purposes because it is believed to be holy water. The water of <strong>Tirta Gangga Park</strong> has always been regarded as holy and is regularly used for religious temple ceremonies. With important celebration days Tirta gangga Park is the destination of colourful processions with offerings, umbrellas, flags and other tributes. Led by the local temple priests,  ceremonies are held at the spring, accompanied by chanting and the music of the 'Beleganjur', a gamelan gong group of small gongs with each musician striking a  specific, different note on the musical scale, all blending in harmony. You can see this ceremony on certain days only, where many villagers here will gather and pray to ask for safety and health.</p>\n</span>\n<span id=\"facility-tirta-gangga\">\n<h3 class=\"font-small\">Facilities of Tirta Gangga Water Palace :</h3>\n<p class=\"text-justify\">The facilities at Tirta Gangga are quite complete. Where there is a toilet that you can use by donating to the toilet keeper who is here. There is a restaurant with very delicious Indonesian food, you can enjoy lunch here after a long trip on the tour. there is not only one restaurant here, but several restaurants are here, each has its own characteristics which provide their own special cuisine with a very beautiful restaurant setting, will make you very comfortable enjoying lunch here  In addition there is also a shop that sells drinks or soft drinks located in the parking area. With a large parking area, making your visit even more enjoyable. There is a shop that sells souvenirs here, you can buy souvenirs for your relatives or family. Very complete facilities for those of you who want to visit Tirta Gangga without worrying. </p>\n</span>\n<span id=\"how-get-to-tirta-gangga\">\n<h3 class=\"font-small\">How to get to Tirta Gangga</h3>\n<p class=\"text-justify\">If you want to visit the Tirta Gangga Water Palace, which is located in the eastern part of the island of Bali, please contact us and we will be happy to take you to visit this phenomenal tourist spot with beautiful koi fish and an amazing garden setting. Produces amazingly beautiful photos. We from <strong><a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a></strong> provide tour packages to visit this place, while the package is <a href=\"https://www.baligoldentour.com/bali-east-tour.php\" title=\"East Bali Tour\">East Bali Tour</a> with affordable prices and very satisfying service, guaranteed you will not regret choosing this tour package. If you only want to visit a few objects and don't depend on the tour program, you can rent transportation with a driver, here we provide these facilities. If you are traveling to the eastern part of the island of Bali, don't forget to visit the Tirta Gangga Water Palace. So what are you waiting for, if you want to get amazing photos, we suggest coming in the morning when it's not too crowded here, so you can freely take pictures at this photo spot. What are you waiting for, contact us immediately and make your day very special by visiting Tirta Gangga and other attractions that are no less interesting</p>\n</span>"
]