[
  "<h1><a href=\"https://www.baligoldentour.com/tirta-empul-temple.php\" title=\"TIRTA EMPUL TEMPLE\">TIRTA EMPUL TEMPLE</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/tirta-empul-temple.php\" title=\"TIRTA EMPUL TEMPLE IS HOLY SPRING TEMPLE DEDICATED FOR GOD INDRA AND HAVE HOLY SPRING WATER THAT USED FOR CLEANSING BODY AND SOUL FROM NEGATIVE THINGS\">TIRTA EMPUL TEMPLE IS HOLY SPRING TEMPLE DEDICATED FOR GOD INDRA AND HAVE HOLY SPRING WATER THAT USED FOR CLEANSING BODY AND SOUL FROM NEGATIVE THINGS</a></h2>\n<a href=\"https://www.baligoldentour.com/tirta-empul-temple.php\"><img src=\"images/bali-interest-place/tirta-empul-temple-bali-golden-tour.jpg\" alt=\"TIRTA EMPUL TEMPLE | SPRING WATER TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"TIRTA EMPUL TEMPLE | SPRING WATER TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n\n<p class=\"text-justify\"> <strong><a href=\"https://www.baligoldentour.com/tirta-empul-temple.php\" title=\"Tirta Empul Temple\">Tirta Empul Temple</a></strong> is built around the sacred spring at  Tampak Siring. For  more than a thousand years, Balinese worshipers have been drawn to Tirta Empul Temple whose sacred spring is said to have been created by Indra and  to have curative properties. The tradition continues almost unchanged at the  temple today. Over 1000 years old, the temple and its two bathing places have  been used by the people for good health and prosperity because of the spring  water's curative powers. The most visited tourist destination in the Ubud area, to see the uniqueness of this Tirta Empul Temple, where holy water from springs in Tirta Empul Temple flows into the pool and is used by the local community to do physical self-cleaning. and the soul is believed to have a positive effect after soaking in this holy water which will make the negative things in your body and soul disappear and make your body and soul clean again</p>\n  <p class=\"text-justify mb-2\"><strong>If you visit Tirta Empul Temple, here all you need to know</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#mythology\">Mythology Of Tirta Empul Temple</a></li>\n<li><a href=\"#history\">History Tirta Empul Temple</a></li>\n<li><a href=\"#cleansing\">Cleansing Pool at Tirta Empul Temple</a></li>\n<li><a href=\"#geography\">Geography Tirta Empul Temple</a></li>\n<li><a href=\"#location\">Tirta Empul Temple Location</a></li>\n<li><a href=\"#facilities\">Tirta Empul Temple Facilities</a></li>\n<li><a href=\"#dress-code\">Dress Code at Tirta Empul Temple</a></li>\n</ul>\n<span id=\"mythology\">\n<h3 class=\"font-small\">Mythology Of Tirta Empul Temple</h3>\n<p class=\"text-justify\">It is narrated in the Usana Bali Lontar that Tirta Empul or Tirta Ri Air Hammpul was created by Bhatara Indra when he was at war with King Mayanadenawa of Be predecessor, the king is said to be very powerful and has the ability to disappear. Because of his supernatural powers, Mayanadenawa considered himself to be God, for that reason Bhatara Indra fought him. In a battle that took place in an area, Mayanadenawa and his troops were pressed, then they walked with their feet tilted, therefore, the area where the battle was then called Tampaksiring. In an unfavorable and life-threatening situation, Mayanadenawa came up with a bad idea by creating a poisonous spring (Yeh Cetik) for the purpose of destroying the troops of Bhatara Indra. And the bad idea turned out to be successful and because of fatigue due to constant fighting, finally many of Bhatara Indra's troops drank Yeh Cetik. Not a few of Bhatara Indra's troops were poisoned by drinking the poisoned water, which reduced the strength of Bhatara Indra's troops a lot. To deal with the problem, Bhatara Indra then stuck a pennant-shaped weapon into the ground. Instantly a spring appeared that pooled upwards from the former stab of the celestial king's weapon. After drinking the spring, Bhatara Indra's troops recovered as usual. From this myth and centuries later the spring was arranged and perfected into a water garden by king Indrajaya Sigha Warmadewa in 882 aka and was given the name \"Tirta Ri Air Hampul\" or \"Tirta Empul\" which means steaming Pathirtaan. And until now this temple is known as Tirta Empul or also often referred to as Tampak Siring Temple because it is located in the village of Tampak Siring and the location is adjacent to the palace of the first president Sukarno, which is in Tampak Siring.</p>\n</span>\n<span id=\"history\">\n<h3 class=\"font-small\">History Tirta Empul Temple</h3>\n<p class=\"text-justify\">\nBased on the inscriptions found, it can be concluded that Tirta Empul Temple was built during the reign of King Masula and Masuli which can be seen from Usana Bali's papyrus which reads \"At that time all Balinese were happy, led by His Majesty Raja Masula Masuli, and the people all felt happy, all the people are equally issued padas, as well as other building materials, such as from Blahbatuh, Pejeng, Tampaksiring\". From the contents of this Balinese lontar usana Bali, it can be traced the reign of King Masula and Masuli in Bali and found in the Sading inscription which states that King Masula Masuli reigned in Bali starting in 1100 AD or 1178 AD, who ruled for 77 years. This means that there is a time difference of about 216 years between the construction of the Tirta Empul baths and the construction of the temple. Architecturally, the Tirta Empul Bath and Temple have historical values, spiritual vibrations, distinctive characters, and are friendly and friendly to the environment. The architectural appearance breathes tradition, and blends with the surrounding natural conditions. The spaces also imply a religious meaning.</p>\n\n<p class=\"text-justify\">Archaeological research that began in the early twentieth century has found evidence that the area in Tampak Siring does store a number of archaeological remains which are still functioning sacred (sacred living monuments), scattered in Panempahan Village, Manukaya Village, and Tampaksiring. The dense population of cultural heritage in this area can be seen as an indication of community settlements and dense occupancy or high social mobility that occurred in the past. The concentration of cultural heritage in this village can also be considered that Ancient Balinese civilization was born in this cultural area. One of the cultural heritages scattered in this area is <a href=\"https://www.baligoldentour.com/tirta-empul-temple.php\" title=\"Tirta Empul Temple\">Tirta Empul Temple</a>.</p>\n</span>\n<span id=\"cleansing\">\n<h3 class=\"font-small\">Cleansing Pool at Tirta Empul Temple</h3>\n<p class=\"text-justify mb-2\">The holy water pool in <a href=\"https://www.baligoldentour.com/tirta-empul-temple.php\" title=\"Tirta Empul Temple\">Tirta Empul Temple</a> comes from a holy spring in the main courtyard of the temple where there is a large pool where this spring comes out, you can see this spring coming out in the pool. but this pool is not used for bathing, but there is another pool that is used, where the water from this spring pool is flowed through a pipe and goes to the purification pool, and in this self-purification pool you can soak and feel the positive aura there is. in this tirta empul spring. This pool is divided into 3 pools with different functions. The present temple as a common temple of Bali, the layout is divided into 3  courtyards. At the middle courtyard is constructed and first courtyards were  constructed:</p>\n<ol class=\"text-justify mb-3\">\n<li class=\"text-justify mb-2\">Pool with 13 fountains, used as holy water for cremation or dead ceremony, Where if the local community will perform a cremation or burial ceremony then they will come here to ask for holy water that will be used as a means for the ceremony, and also for members whose family has died, they will come here to perform body cleansing which in Bali is called by the name \" Melukat\" from all negative things in the body, because if in Bali if a family dies then that family member has bad luck in Bali known as \"Sebel\" for that they will come here so that bad luck does not spread to other families. </li>\n<li class=\"text-justify mb-2\">Pool with 8 fountains, used as water for symbolic cleaning ( spiritual  purification ), when a person is sick it is believed he is infected by  immaterial dirt. As for if there is one of the family who is sick and has been taken to the doctor and does not recover, it is believed that there is a negative spiritual thing in the body, and they will come here to do a procession called \"Melukat\" to clean the negative aura that makes the body sick and local people believe that the holy water of Tirta Empul temple has a positive effect on someone who sick and healing the body and soul in this pool</li>\n<li>Pool with 5 fountains for holy water used people from outside  come to pray. As for this pool, it can be used by outsiders who come to pray here and ask for holy water as a blessing so that the family is always given health, and soaking in this shower water to get a positive aura from the holy waters of tirta empul and is believed to cleanse the body from all kinds of things. negative impurities that are inherent in the soul and you will return to physical health</li>\n</ol>\n<p class=\"text-justify\">Those are some of the functions of the pool in this <a href=\"https://www.baligoldentour.com/tirta-empul-temple.php\" title=\"Tirta Empul Temple\">Tirta Empul Temple</a>, from long time ago Tirta Empul has often been visited by foreign and domestic tourists with all its uniqueness and wonders that always make tourists stunned. If you visit the island of Bali and want to do a cleansing body, you can visit this Tirta Empul temple, if in your heart you believe in the efficacy of this holy water, surely it will be proven. Here you will see many people who come here and perform cleansing rituals in this tirta empul pond</p>\n  <div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/tirta-empul-temple.php\"><img src=\"images/bali-interest-place/tirta-empul-temple-1.jpg\" alt=\"Koi Fish Fonds Tirta Empul | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width\" title=\"Koi Fish Fonds Tirta Empul | Gianyar Places of Interest | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Koi Fish Fonds</p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/tirta-empul-temple.php\"><img src=\"images/bali-interest-place/tirta-empul-temple-2.jpg\" alt=\"Holy Spring Water Tirta Empul | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width\" title=\"Holy Spring Water Tirta Empul| Gianyar Places of Interest | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Holy Spring Water Tirta Empul</p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/tirta-empul-temple.php\"><img src=\"images/bali-interest-place/tirta-empul-temple-3.jpg\" alt=\"Cleansing Pool Tirta Empul | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width\" title=\"Cleansing Pool Tirta Empul | Gianyar Places of Interest | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Cleansing Pool Tirta Empul</p></div>\n</div>\n</span>\n<span id=\"geography\">\n<h3 class=\"font-small\">Geography Tirta Empul Temple</h3>\n<p class=\"text-justify\">Tirta Empul Temple has three courtyard, when you just arrive at this tirta empul, you will walk from the entrance ticket to the first page, on the first page you will see there is a large sacred tree and on the right there is a Wantilan or what is called a place rest and in the middle there is a small canteen with a pond filled with colorful koi fish, you can feed these koi fish, becoming one of the tourist attractions in this tirta empul. On the second page you will see a row of pools with various showers with different functions from each of these showers, you will see a pool where many people do cleansing here with the aim of cleansing the body of the negative aura inherent in the body and soul. On the third page is the holiest page here you can see a pool where people are not allowed to enter this pool, because in this place the holy spring is located you can see a spring here that never runs out, and there is a holy temple here whose function is to worshiping the god Indra as a manifestation of Ida Sang Hyang Widhi Wasa. With a natural and natural atmosphere, this place is very cool and you will feel at home for a long time here while seeing the beauty of the temple with springs that have healing and spiritual cleansing effects. Total number of shrines at Tirta Empul Temple are 30 nits currently, after later addition by local people who have  the responsibility for the temple. The ceremony is performed every 210 days,  and fixed date can be read in Balinese calendar. </p>\n<p class=\"text-justify\">In <a href=\"https://www.baligoldentour.com/tirta-empul-temple.php\" title=\"Bali Tirta Empul Temple\">Bali Tirta Empul Temple</a> there is a sacred relic, namely the buffalo which is considered the vehicle of Lord Shiva. The condition of the carving is badly damage, so  it can not be observed in detail to fix the type. Buffalo in the pantheon of  Hindu is considered as the mount of god Shiwa and this animal is called ” Nandi. The name \"Tirta Empul\" signifies a crystal clear stream which  is used as the holy water for various religious ceremony. Visitors are allowed only  up to the main courtyard. From here, one could enjoy the twin shrines and split  gate, common in most temples in Bali. Inside the inner sanctum, there are a  number of bathing pools for the Hindus. The Tirta Empul Temple includes the traditional Balinese split gate along with  shrines to Shiva, Vishnu, Braham, Mt. Batur, and Indra. There is also a large  open pavilion in the main courtyard, useful for relaxing in the shade. But  the main attraction at Tirta Empul Temple is a long rectangular pool carved of stone, filled  with koi and fed by the sacred spring via 12 fountains. Worshippers first make  an offering at the temple, then climb into the main pool to bathe and pray.  Many collect the holy water in bottles to take home. Nearby there are two  smaller pools fed by the spring.</p>\n  </span>\n  <span id=\"location\">\n<h3 class=\"font-small\">Tirta Empul Temple Location</h3>\n<p class=\"text-justify\">The location of the Tirta Empul Temple is located in the village of Tampak Siring, Gianyar Regency and the location is not far from the tourist destination of Gunung Kawi Temple, and is located on a strategic road where on the main road leading to Gunung Kawi Temple and Kintmani Village, where Kintamani is a tourist destination. to see the beauty of the beautiful view of Mount Batur and Lake Batur. If you drive yourself by car or motorbike, you can use the google map guide, because on the google map you will be guided to this place. If you don't want to bother driving yourself, we from <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a> are ready to take you to Tirta Empul using a comfortable car and accompanied by an experienced driver that will make this trip even more enjoyable. And if you want to combine visiting the Tirta Empul Temple with other tourist destinations, you can take the <a href=\"https://www.baligoldentour.com/bali-ubud-kintamani-tour.php\" title=\"Ubud and Kintamani Tour\">Ubud and Kintamani Tour</a> package which combines the best tourist destinations in one day and of course with very cheap prices and satisfying service.</p>\n  </span>\n  <span id=\"facilities\">\n  <h3 class=\"font-small\">Tirta Empul Temple Facilities</h3>\n  <p class=\"text-justify\">The facilities at Tirta Empul are very complete, where there is a very large parking area, so you don't need to be confused anymore to park the vehicle, and in the parking area there are many shops selling various handicrafts and souvenirs and there are also many small shop selling food and soft drinks. There is also a large number of toilets which is very important, considering that Tirta Empul is a very popular tourist destination and almost every day is never empty of visitors. This complete facility is very supportive in the development of tirta empul so that it becomes the second tourist destination that is often visited besides <a href=\"https://www.baligoldentour.com/ubud-monkey-forest.php\" title=\"Ubud Monkey Forest\">Ubud Monkey Forest</a> which is located in the center of Ubud. So you don't need to hesitate anymore to visit this tirta empul with all its natural beauty and uniqueness will make your holiday on the island of Bali so much fun.</p>\n    </span>\n    <span id=\"dress-code\">\n  <h3 class=\"font-small\">Dress Code at Tirta Empul Temple</h3>\n  <p class=\"text-justify\">The dress code at the Tirta Empul Temple is the same as when visiting other tourist destinations on the island of Bali, where you will dress politely because you are entering a holy place and also for women who in periode (menstruation) are unable to enter the temple which will affect the sanctity of the temple and can be spiritually bad for those who violate this taboo. In addition, if you want to use the pool for cleaning, you will need a sarong to use to go down to the pool, and don't worry because the sarong is provided here. You just have to pay for the sarong rental and you can go down to the pool, and there is a changing room here for you. who wants to change your clothes before plunging into the pool. In addition there is also a locker that you can rent here to store your valuables. very supportive facilities for those of you who want to do a cleansing ritual in this holy tirta empul pool</p>\n  </span>"
]