[
  "<h1 class=\"text-uppercase\"><a href=\"https://www.baligoldentour.com/tohpati-village.php\" title=\"Tohpati Village\">Tohpati Village</a></h1>\n<h2 class=\"text-uppercase\"><a href=\"https://www.baligoldentour.com/tohpati-village.php\" title=\"Bali Tohpati Village is a Village That Focuses on Batik Crafts With Such a Beautiful and Artistic Design\">\nBali Tohpati Village is a Village That Focuses on Batik Crafts With Such a Beautiful and Artistic Design</a></h2>\n<a href=\"https://www.baligoldentour.com/tohpati-village.php\"><img src=\"images/bali-interest-place/tohpati-batik-art-village.jpg\" alt=\"Tohpati Village | Bali Batik Art | Bali Interest Place | Bali Golden Tour\" width=\"1200\" height=\"500\" class=\"auto-width mb-3\" title=\"Tohpati Village | Bali Batik Art | Bali Interest Place | Bali Golden Tour\"></a>\n\n<p class=\"text-justify\"><strong><a href=\"https://www.baligoldentour.com/tohpati-village.php\" title=\"Tohpati Batik Art Village\">Tohpati Batik Art Village</a></strong> is just  about 12 kilometers from Kuta, and famous for Bali's Batik Wand Weaving Center. Batik is a traditional form of  painting fabric. They painstakingly use dots and lines from wax to decorate the  cloth. It is very impressive to watch. It would be impossible to visit or live  in Indonesia and not be exposed to one of the country's most highly developed  art forms, batik.Tohpati  Village is a batik home industry, you will undoubtedly experience an overwhelming  stimulation of the senses – due to the many colors, patterns and the actual  smell of batik. Only through repeated visits and a bit of study will the types  of designs and their origins become apparent. An unforgettable experience on a vacation in Bali by seeing one of the traditional Indonesian clothing manufactures called \"Batik\" on the island of Bali, besides seeing batik making you can also see the batik collections here and even buy them if you are interested</p>\n<h3 class=\"font-small mb-2\"><strong>All you need to know about Batik Art at Tohpati Village</strong> :</h3>\n<ul class=\"mb-4\">\n<li><a href=\"#what-is-batik\">What is Batik?</a></li>\n<li><a href=\"#history-batik\">History of Batik Technique</a></li>\n<li><a href=\"#batik-techniques\">Batik Techniques in Indonesia</a></li>\n<li><a href=\"#types-batik\">Types of Batik in Indonesia</a></li>\n<li><a href=\"#tools-batik\">Tools Making Batik in Indonesia</a></li>\n<li><a href=\"#history-batik-bali\">History of Balinese Batik</a></li>\n<li><a href=\"#balinese-batik-motif\">Balinese Batik Motif</a></li>\n<li><a href=\"#tohpati-center-batik\">Tohpati Village is Center of Batik Art in Bali</a></li>\n<li><a href=\"#kind-batik\">What kind of batik are available at Tohpati Batik Art</a></li>\n<li><a href=\"#location\">Location of Tohpati Batik Art</a></li>\n<li><a href=\"#facilities\">Facilities at Tohpati Batik Art</a></li>\n</ul>\n<span id=\"what-is-batik\">\n<h3 class=\"font-small\">What is Batik?</h3>\n<p class=\"text-justify\">Before starting the reading, it's better if you know what Batik is, so that the flow of this page becomes easy for readers to digest and understand. Batik is one of the typical arts belonging to Indonesia in the form of illustrated cloth with a very traditional manufacturing process and requires high accuracy by drawing cloth with certain patterns and designs using ink. The lines and curves of the colors are so dazzling. This batik has also been designated by Unesco as Masterpieces of the Oral and Intangible Heritage of Humanity which was set on 02nd October 2009, and since that day, it has also been designated as a national batik day on that date. A very beautiful cultural heritage, and to maintain and preserve this culture, the government enforces certain days where government employees wear batik when on duty, a good step in preserving cultural heritage and as a reminder for generations that Indonesia has a very rich cultural heritage. very beautiful</p>\n</span>\n<span id=\"history-batik\">\n<h3 class=\"font-small\">History of Batik Technique</h3>\n<p class=\"text-justify\">Batik is one of the techniques of dyeing cloth using wax. It is an ancient form of craft that was discovered in the 4th century BC in Egypt where mummy wrapping cloth was also coated with wax or wax to form a pattern. In Asia a similar technique was also found in China during the Tang dynasty (6180907) as well as in the Inid and Japan during the Nara Period (645-794), in Africa a technique similar to batik was also known by the Yoruba tribe in Nigeria. And in Indonesia batik is believed to have been found since the Majapahit era and became very popular at the end of the XVII century or the beginning of the XIX century, batik produced during the Majapahit era was written batik until the early twentieth century and stamped batik was only known after World War 1 or around 1920. Although the word batik comes from Indonesian Java, but the presence of batik is not recorded, G.P Rouffer argues that the batik technique was probably introduced from India or Sri Lanka in the 6th and 7th centuries, but another opinion says that J.L.A Brandes and F.A Sutjipti believe that the tradition of batik technique is native to the Toraja area, Flores, Halmahera and Papua because these areas are not areas influenced by Hinduism but are known to have ancient traditions in batik making</p>\n</span>\n<span id=\"batik-techniques\">\n<h3 class=\"font-small\">Batik Techniques in Indonesia</h3>\n<p class=\"text-justify\">The oldest batik art found in Indonesia was in the 17th and 18th centuries during the reign of the Majapahit kingdom, which at that time batik was only used by the people of the palace and their followers, over time this batik art spread outside the kingdom and become clothes that are also worn by the general public. Actually the motif of this batik is not only found on the cloth used as clothing, but the motif is also found in the reliefs of the Prambanan temple and Borobudur temple which can be concluded that batik actually already exists in Indonesia and does not originate from India, although with these findings it cannot be stated accurately the origins of batik techniques in Indonesia, whether the original Indonesian crafts in ancient times or from outsiders who introduced batik techniques in Indonesia, this is still a question mark, pending the results of research that can prove the origin of batik in Indonesia.</p>\n</span>\n<span id=\"types-batik\">\n<h3 class=\"font-small\">Types of Batik in Indonesia</h3>\n<p class=\"text-justify mb-2\">As for the types - the types of batik are very diverse and are the result of creations from the development of the era - to the era that makes the types of batik become very diverse at all. All these types of batik still retain the characteristics of the painting on the cloth which is one of the characteristics of the batik with carvings with patterns and colors that used to be only black and white and now can be colored because of the development of the era that makes dyes vary, in ancient times only know only a few colors are used. A work of art that is very beautiful and is a cultural heritage that will not be lost to the times, and is still preserved by batik artisans in Indonesia, as for the types of batik are:</p>\n<ol class=\"mb-3\">\n<li class=\"text-justify mb-2\">Batik Tulis (Written Batik) : It is one of the earliest types of batik that existed and was used in the ancient kingdoms, which still used it manually, namely using hands and the help of canings to paint pictures on cloth. As for this type of batik, the price is quite expensive, because the manufacturing process is very unique and cannot be the same as the others due to the manual manufacturing process.</li>\n<li class=\"text-justify mb-2\">Batik Cap (Batik Stamp): Is a type of batik whose manufacturing process uses a stamp or stamp with a certain batik motif as a substitute for canting, usually this stamp is made of copper which is carved in advance with a certain motif which will later be colored and stamped onto the fabric, so that for a manufacturing process like this it will save time and be fast in production</li>\n<li class=\"text-justify mb-2\">Batik Printing (Batik Printing): Is a type of batik whose process is very modern, which uses a screen printing tool in its production so that it can produce many productions in a short time, usually this type of batik is sold in the market at a relatively cheap price. You can find this type of batik in clothing stores, supermarkets and markets</li>\n<li class=\"text-justify mb-2\">Batik Kombinasi (Combination Batik): Is a type of batik that combines the technique of written batik with stamped batik with the aim of making batik to cover the shortcomings produced by stamped batik by painting the missing part with the written batik technique, this batik is more classy because the manufacturing process is quite complicated and the price of this type of batik is not much different from the price of stamped batik</li>\n</ol>\n</span>\n<span id=\"tools-batik\">\n<h3 class=\"font-small\">Tools Making Batik in Indonesia</h3>\n<p class=\"text-justify mb-2\">The tools in making batik are very diverse and the materials used are also very diverse, as for making batik it is not so complicated the most difficult thing is painting it requires very good painting skills so that the resulting patterns are similar and this skill is really the same like painting painting skills, it takes very high patience, and very focused concentration, because if something goes wrong it can't be erased because once the ink is attached it will be permanent, if you make a mistake in painting you need to use new materials again to make from scratch. So do not be surprised if the price of this batik is very expensive. The tools and materials used in batik painting</p>\n<ol class=\"mb-3\">\n<li class=\"text-justify mb-2\">Lilin Malam (Wax) is a barrier material in batik art, what is meant by barrier is to prevent the color liquid from touching the mori cloth which is coated with night wax so that after it is removed the cloth remains white. Heating wax using a stove fire as a container using a small skillet</li>\n<li class=\"text-justify mb-2\">Canting is a tool used to make written batik patterns, you could say this is the pen from batik painting, while wax is the ink, where the melted wax that is heated earlier is placed in a canting which has a wax storage tube and is used to paint batik patterns that are made of batik. wanted</li>\n<li class=\"text-justify mb-2\">Gawangan is a tool like wood that is used to put the mori to be painted, you could say this is a tool for painting, where the cloth to be painted will be placed in the goal so it is easier to paint the desired pattern, usually made of wood or bamboo</li>\n<li class=\"text-justify mb-2\">Canting Cap is a tool used in the batik stamp technique, which is made of copper that is formed with a certain desired pattern, there can only be one pattern in this canting stamp, where the canting cap is first engraved with the pattern to be made and one one cap pattern</li>\n<li class=\"text-justify mb-2\">Mori cloth is a cloth used in batik-making material, this mori cloth is not like clothing cloth as usual, but a special cloth used in making batik where the mori cloth is made of cotton or better known as cotton, because This material is most suitable for batik</li>\n<li class=\"text-justify mb-2\">Pewarna (Dye) is a dye used in giving color in batik painting, as for this dye there are two types, namely Alan dye which is made from natural natural materials such as leaves, bark, fruit tubers and fruit skins and also synthetic material made from chemicals to produce a certain color</li>\n</ol>\n</span>\n<div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/tohpati-village.php\"><img src=\"images/bali-interest-place/tohpati-batik-art-village-1.jpg\" alt=\"Tohpati Batik Art Village | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width mb-3\" title=\"Tohpati Batik Art Village | Gianyar Places of Interest | Bali Golden Tour\"></a>\n</div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/tohpati-village.php\"><img src=\"images/bali-interest-place/tohpati-batik-art-village-2.jpg\" alt=\"Tohpati Batik Art Village | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width mb-3\" title=\"Tohpati Batik Art Village | Gianyar Places of Interest | Bali Golden Tour\"></a>\n</div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/tohpati-village.php\"><img src=\"images/bali-interest-place/tohpati-batik-art-village-3.jpg\" alt=\"Tohpati Batik Art Village | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width mb-3\" title=\"Tohpati Batik Art Village | Gianyar Places of Interest | Bali Golden Tour\"></a>\n</div>\n</div>\n<span id=\"history-batik-bali\">\n<h3 class=\"font-small\">History of Balinese Batik</h3>\n<p class=\"text-justify\">The techniques for making batik in Indonesia are all the same, what distinguishes batik made in a region is the motif of the painting on batik, and the island of Bali has its own motif that distinguishes it from batik from outside the region. The development of Balinese batik is also very fast, this depends on the very high market demand for batik, where in Bali there is more demand for foreign markets, which many foreign tourists buy batik as Balinese souvenirs. At first the Balinese made batik in groups with patterns handed down by their ancestors or their own creations which made it one of the characteristics of their batik products. Previously, they still used the traditional written batik technique and this process was quite long and could not produce much and were overwhelmed in the face of very high market demand, Then in 1970 the stamp technique was introduced with traditional equipment by Pande Ketut Khrisna and since then Balinese batik is becoming more and more developed, and many entrepreneurs have also opened Balinese batik shops specifically for sale to tourists, while the location chosen is Tohpati village which is located on the main road to Ubud, and now this village know as the <a href=\"https://www.baligoldentour.com/tohpati-village.php\" title=\"Tohpati Batik Art Village\">Tohpati Batik Art Village</a>, so tourists who are going to Ubud can stop by this place. This is just to see the uniqueness of Batik craft in Bali</p>\n</span>\n<span id=\"balinese-batik-motif\">\n<h3 class=\"font-small\">Balinese Batik Motif</h3>\n<p class=\"text-justify mb-2\">Batik as one of Indonesia's cultural heritages that still exists today and is preserved in each region, including Bali which preserves the art of Batik, what distinguishes Balinese batik from batik from outside the region is the image on the batik, where the image of Balinese batik has its own characteristics. which is different from a picture full of curves and very beautiful, and is not limited to just lines, floral motifs, but there are also motifs such as puppets and mythical animals. This beautiful process of painting batik uses a written batik technique which is known to have a very high level of difficulty and is also very complicated in designing a pattern on the fabric before proceeding with painting. There are several Balinese batik motifs that are characteristic of it</p>\n<ol class=\"mb-3\">\n<li class=\"text-justify mb-2\">Singo Barong: Is a batik motif with the presence of a distinctive barong head pattern with a grin and sharp fangs, the scary appearance of the mythical creature <a href=\"https://www.baligoldentour.com/barong-dance.php#what-is-barong\" title=\"Barong\">Barong</a>, which when painted on cloth becomes a very beautiful and very beautiful work.</li>\n<li class=\"text-justify mb-2\">Bouquet: This is a batik motif that draws floral patterns, as the name implies, bouquetan which means a collection of flowers, while the types of flowers drawn are very diverse, from small flowers to large flowers, and most of what we see are small flowers with beautiful colors.</li>\n<li class=\"text-justify mb-2\">Balinese dancers: This is a batik motif that is painted with pictures of very beautiful Balinese dancers on this mori cloth, with dance movements painted here, this batik is very beautiful and reflects the characteristics of the island of Bali. dancer</li>\n<li class=\"text-justify mb-2\">Ulamsari: Is a batik motif that paints pictures of marine flora and fauna in the form of small leaves with cute stems that make the motif even more sweet and unique, wrapped in striking colors making this distinctive batik very attractive to teenagers.</li>\n<li class=\"text-justify mb-2\">Abyor Hokokai: Is a batik motif which is an acculturation of Japanese culture that had colonized Indonesia long ago, which is also absorbed in the art of batik where the motif is a mixture of colors with a very iconic peacock ornament and combined with a painting of leaves with beautiful stalks</li>\n<li class=\"text-justify mb-2\">Pisan bali: This is a very beautiful Balinese batik motif, this motif with very beautiful curves and Balinese batik is often used as a gift to couples who are going to travel, in the hope that the couple will return safely.</li>\n</ol>\n</span>\n<span id=\"tohpati-center-batik\">\n<h3 class=\"font-small\">Tohpati Village as the Center for Batik Art in Bali</h3>\n<p class=\"text-justify\">As for the village of Tohpati, which was the first to introduce the process of making batik in Bali, where in this village of Tohpati there used to be a shop that introduced batik making to foreign tourists, and because the response from tourists was very good about this batik craft, many entrepreneurs who opened a batik craft shop in Tohpati which made Tohpati the center of Batik art crafts, along this Tohpati village road, left and right you will see many batik art shops here. With very cheap prices and very good quality goods, this makes Tohpati village more and more famous for batik from year to year. If you are on vacation in Bali and ask where you can get batik, then the answer is Tohpati Village. This is a sign that the Tohpati village is already very famous for batik handicrafts, as for the batik craft here, what is available is written batik which is very difficult and very complicated to make, and here also accepts orders with certain patterns, here you can see the process of making batik from the beginning in detail. traditional and there are also written batik works on display in the gallery which are sold for tourists who want to buy Indonesian Balinese souvenirs, namely Batik clothes</p>\n</span>\n<span id=\"kind-batik\">\n<h3 class=\"font-small\">What kind of batik are available at Tohpati Batik Art</h3>\n<p class=\"text-justify\">The batik crafts found in the village of Tohpati Batik Art are very diverse, as you know that batik is an art craft that paints cloth with certain patterns that are very beautiful, and this batik cloth is not only made into clothes, but can be made into a variety of different works. you can use. As for what can be made from this batik material, such as batik shirts, batik bags, batik wallets and others. And in Tohpati, this batik art also accepts special orders using materials from batik. In addition, you can also see the typical Balinese motifs which are the characteristic batik of the island of Bali. If you are on vacation on the island of Bali and really like cultural tourism, it would be nice if you visit the village of Tohpati Batik Art and see a very beautiful cultural art with amazing skills, this very beautiful work makes it even more popular with foreign and domestic tourists.</p>\n</span>\n<span id=\"location\">\n<h3 class=\"font-small\">Location of Tohpati Batik Art</h3>\n<p class=\"text-justify\">The location of <a href=\"https://www.baligoldentour.com/tohpati-village.php\" title=\"Tohpati Batik Art Village\">Tohpati Batik Art Village</a> is close to Batubulan village, which is right before the Batubulan bus terminal, which is located on Tohpati Village, Batubulan District, Bali. If you depart from Kuta or Seminyak it will take about 45 minutes of travel time, if you want to explore on your own you can use the help of Google Maps to go to the location of this Tohpati Batik Art. And if you don't want to bother looking for the location of this place, you can use <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a> services, namely <a href=\"https://www.baligoldentour.com/bali-car-charter.php\" title=\"Hire Car and Driver\">Hire Car and Driver</a> at low and affordable prices and of course the services provided are very satisfying. With a very comfortable car and an experienced driver will make this trip very enjoyable. If you really like the art of cloth, then this batik art is the right choice because batik is the hallmark of art crafts in Indonesia.</p>\n</span>\n<span id=\"facilities\">\n<h3 class=\"font-small\">Facilities at Tohpati Batik Art</h3>\n<p class=\"text-justify\">The facilities in Tohpati Village are very complete, as one of the villages with batik culture tourism in Bali, if you go to Tohpati Village you can visit one of the batik arts here, while the facilities provided in most Tohpati Batik Art are very complete like places to see the process of making traditional batik, here you can see from the beginning of making batik which will be guided by a batik officer to explain you the process of making batik from start to finish, there is also a gallery which displays the results of written batik produced here in the form and the pattern is very artistic and will surely make you so fascinated and impressed by the uniqueness of this batik. It is a very impressive experience to see Indonesian cultural heritage that is included in Unesco as a cultural characteristic of Indonesia. If you go to Indonesia, then buy batik which is the hallmark of this cultural clothing in Indonesia.</p>\n</span>"
]