[
  "<h1><a href=\"https://www.baligoldentour.com/saraswati-temple.php\" title=\"SARASWATI TEMPLE\">SARASWATI TEMPLE</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/saraswati-temple.php\" title=\"SARASWATI TEMPLE UBUD IS HINDU TEMPLE WITH AMAZING DESIGN DAN BEAUTIFUL LOTUS PONDS IN UBUD VILLAGE\">SARASWATI TEMPLE UBUD IS HINDU TEMPLE WITH AMAZING DESIGN DAN BEAUTIFUL LOTUS PONDS IN UBUD VILLAGE</a></h2>\n<a href=\"https://www.baligoldentour.com/saraswati-temple.php\"><img src=\"images/bali-interest-place/saraswati-temple-ubud.jpg\" alt=\"SARASWATI TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"SARASWATI TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n\n\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/saraswati-temple.php\" title=\"Saraswati Temple Ubud\"><strong>Saraswati Temple Ubud</strong></a> with real name <strong>Pura Taman Saraswati</strong> is a Hindu temple located in the village of Ubud and dedicated to Goddess Saraswati who is the protective goddess of mankind according to the beliefs of Hindus in Bali. Located in the center of Ubud, which is often visited by tourists who want to visit the uniqueness of the Saraswati Temple, Ubud with all its beauty makes it a favorite tourist destination to visit in this Ubud village. With a large lotus fond that adds to the beauty of this Saraswati temple, if you visit Ubud village, you shouldn't miss this tourist destination, you can walk around this Saraswati temple and see the beauty of the temple here with a typical Balinese design shape and in front there is a lotus pond that is so beautiful</p>\n<p class=\"text-justify mb-2\"><strong>If you visit Saraswati Temple Ubud, here's what you need to know</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#location\">Location of Saraswati Temple Ubud</a></li>\n<li><a href=\"#history\">History of Saraswati Temple Ubud</a></li>\n<li><a href=\"#attraction\">The Attraction of Taman Saraswati Temple</a></li>\n<li><a href=\"#geography\">Geography Saraswati Temple Ubud</a></li>\n<li><a href=\"#dance\">Balinese Dance Show at Saraswati Temple Ubud</a></li>\n<li><a href=\"#facilities\">Facilities of Saraswati temple ubud</a></li>\n</ul>\n\n<span id=\"location\">\n<h3 class=\"font-small\">Location Saraswati Temple Ubud</h3>\n<p class=\"text-justify\">The location of the Saraswati Temple is located in the center of Ubud, which is very strategic so that this temple is often visited by tourists who are visiting Ubud Village, with all its uniqueness making this Saraswati Temple one of the must-visit tourist destinations. Located in the city center, close to the Ubud Market and Ubud Palace, and it's very easy to find the location. If you drive from Kuta to Seminyak it will take about 2 hours driving a car or motorbike, with the help of Google Maps you will easily find the location of this Saraswati temple. If you don't want to bother looking for a location, we from <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a> are ready to take you here by offering <a href=\"https://www.baligoldentour.com/bali-car-charter.php\" title=\"Hire Car and Driver\">Hire Car and Driver</a> with private car services with a very experienced driver who will make the trip to the Saraswati temple very enjoyable.</p>\n</span>\n\n<span id=\"history\">\n<h3 class=\"font-small\">History of Saraswati Temple Ubud</h3>\n<p class=\"text-justify\">The history of the <a href=\"https://www.baligoldentour.com/saraswati-temple.php\" title=\"Saraswati Temple Ubud\">Saraswati Temple Ubud</a> began with the desire of the Ubud Prince Cokorde Gede Agung Sukawati who wanted to build the Saraswati Temple in Ubud Village so that the Ubud community could pray in this place during the Saraswati ceremony day which is every six months (Balinese calendar time). Prince ubud ordered a sculptor and undagi named I Gusti Nyoman Lempad who arrived in ubud after previously settling in the Blahbatuh royal palace, the initial construction began in 1951 using the basic materials of red bricks and sandstone with beautifully carved and thick designs. Balinese carvings in front are made of a lotus pond where the inspiration comes from the place of god saraswati which is surrounded by lotus. The pond was built so beautifully with lotus trees placed which when the blooming season will make this Saraswati temple full of color. The construction of the Saraswati temple was completed in 1952. And this temple is dedicated to Dewi Saraswati who is wife from God Brahma and also Dewi Saraswati as the god of science, literature and Hinduism. Usually on the day of the Saraswati ceremony many students pray here and ask for blessings so that in learning always positive things are given</p>\n</span>\n\n<span id=\"attraction\">\n<h3 class=\"font-small\">The Attraction of Saraswati Temple</h3>\n<p class=\"text-justify\">Saraswati Temple or also known as Taman Saraswati Temple is a temple for Hindus that is functioned to worship the god of science, namely Dewi Saraswati who is the wife of Lord Vishnu. As one of the most famous tourist destinations in the village of Ubud with the beauty of the lotus pond and temples that are magnificent and very beautiful. As for when you enter this Saraswati temple you will see a very beautiful temple with lotus ponds on the left and right making the appearance of this Saraswati temple very instagrammable. The main temple is located inside and cannot be entered, only those who want to pray can go to the inner area which is sanctified by the local community. You can only see from the outside, which is where the temple and lotus pond are located, even so from here it is enough to see the beauty of this very sacred temple and as a temple to worship science, you can take pictures with the background of this temple and lotus pond and the resulting photos are very instagrammable.</p>\n<span id=\"geography\">\n<div class=\"row\">\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/saraswati-temple.php\"><img src=\"images/bali-interest-place/saraswati-temple-1.jpg\" alt=\"Saraswati Temple Ubud | Gianyar Places of Interest | Bali Golden Tour\" width=\"370\" height=\"250\" class=\"full-width mb-3\" title=\"Saraswati Temple Ubud | Gianyar Places of Interest | Bali Golden Tour\"></a></div>\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/saraswati-temple.php\"><img src=\"images/bali-interest-place/saraswati-temple-2.jpg\" alt=\"Saraswati Temple Ubud | Gianyar Places of Interest | Bali Golden Tour\" width=\"370\" height=\"250\" class=\"full-width mb-3\" title=\"Saraswati Temple Ubud | Gianyar Places of Interest | Bali Golden Tour\"></a></div>\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/saraswati-temple.php\"><img src=\"images/bali-interest-place/saraswati-temple-3.jpg\" alt=\"Saraswati Temple Ubud | Gianyar Places of Interest | Bali Golden Tour\" width=\"370\" height=\"250\" class=\"full-width mb-3\" title=\"Saraswati Temple Ubud | Gianyar Places of Interest | Bali Golden Tour\"></a></div>\n</div>\n<h3 class=\"font-small\">Geography Saraswati Temple Ubud</h3>\n<p class=\"text-justify\">The <a href=\"https://www.baligoldentour.com/saraswati-temple.php\" title=\"Saraswati Temple Ubud\">Saraswati Temple Ubud</a> is one of the most popular landmarks in Ubud Village, while what is very interesting about this Saraswati Temple is the lotus pond and water garden that we can see when we just enter the Saraswati Temple area. Decorated with frangipani trees placed on the edge of the pond will add to the beauty of this lotus pond. And to go to the temple there is a jecil bridge made of concrete and designed in such a way that makes the appearance of this temple become so beautiful. On the edge of the small bridge above it are placed small statues that are lined up along the bridge, making this view very beautiful. As for all the sculpture designs and carvings and layouts built by Lepat. The main view is located in this big kori agung and there are frangipani trees on the left and right which make the appearance of the Saraswati temple very instagramable. The straight route to the inner courtyard is blocked by the unusual aling-aling, a set of walls used to confuse evil spirits in Balinese architecture. This wall is actually the back of a 3-meter-high statue of the rakshasha figure Jero Gede Mecaling. The main temple is located in the most sacred area, which is located inside the Kori Agung, and can only be entered by people who want to pray here. Padmasana temple is located on the northeast side of the temple which is decorated with facial carvings that look like the shape of a cosmic turtle and several dragons which have the meaning of representing the demon world called Bhur and the pali Atasa of Padmasana there is an empty golden throne drawn with a picture of Acintya, the supreme god. which is in Hindu belief. As for a pavilion (bale) with three empty thrones inside dedicated to the Hindu Trimurti Brahma, Vishnu and Shiva. Several Meru towers are also located on this side. In this temple there is also a bale barong, a pavilion to store barong figures used by villagers for exorcism rituals. Usually there are two barong figures in the bale barong: Barong Ket who is like a lion and Barong Pangkal is like a wild boar) and there is also a statue of the goddess Saraswati which is very beautiful.</p>\n<span id=\"dance\">\n<h3 class=\"font-small\">Balinese Dance Show at Saraswati Temple Ubud</h3>\n<p class=\"text-justify\">Here there are Balinese dance performances that are held every night and the Balinese dance that is held is the Legong dance which is often performed here and sometimes it can change to other performances such as Kecak, but this depends on the situation and the high demand, but what is often shown is Balinese dance performances are legong dance. Held on Monday - Thursday and Saturday - Sunday, on Friday there are no Balinese dance performances here and also certain days such as holidays at this Saraswati temple. So if you want to watch the dance at Saraswati Temple, you should check the schedule, because it is not open every day. As for the dance ticket, you can buy it at the location where the officer will guard the entrance to this Saraswati temple and also you can see this dance performance from the lotus cafe which is located in front of this Saraswati temple. You can see this free Kecak dance from this lotus cafe, with a note You have to spend a certain amount to be able to watch this Balinese dance from this lotus cafe. The Legong Dance at Saraswati Temple is performed by very professional dancers and brings a very beautiful storyline, for those of you who travel to Ubud village and don't have time to watch other dances. You can watch it at Saraswati Temple</p>\n<span id=\"facilities\">\n<h3 class=\"font-small\">Facilities of Saraswati Temple Ubud</h3>\n<p class=\"text-justify\">As one of the most popular tourist destinations in Ubud Village, Saraswati Temple has quite complete facilities that will make tourists feel at home to linger in this place. From the clean toilets that you can use, there is a restaurant in front of the Saraswati Cafe called Lotus Fond Cafe, you can buy drinks here while looking at the beautiful view of Kori Agung and the Lotus Pond at the Saraswati Temple from this lotus cafe, because the Saraswati Temple is located behind this lotus fond cafe. There is an open stage which at night is used as a fantastic Kecak dance performance, you can see this Kecak dance performance from the lotus cafe with the provision of buying food at a certain price. There are many artshops lined along the road selling various kinds of very beautiful handicrafts. So you don't need to hesitate anymore if you want to visit the Saraswati Temple in Ubud. Don't miss this opportunity if you happen to be in Ubud village and stop by the Sarasawati Temple to see the beauty of this magnificent lotus fond and kori agung</p>\n</span></span></span></span>"
]