[
  "<h1><a href=\"https://www.baligoldentour.com/ubud-royal-palace.php\" title=\"UBUD ROYAL PALACE\">UBUD ROYAL PALACE</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/ubud-royal-palace.php\" title=\"BALI UBUD ROYAL PALACE IS UBUD KINGDOM PALACE WITH BEAUTIFUL TRADITIONAL HOUSE AS A RESIDENCE OF UBUD KING\">BALI UBUD ROYAL PALACE IS UBUD KINGDOM PALACE WITH BEAUTIFUL TRADITIONAL HOUSE AS A RESIDENCE OF UBUD KING</a></h2>\n<a href=\"https://www.baligoldentour.com/ubud-royal-palace.php\"><img src=\"images/bali-interest-place/ubud-royal-palace-bali-golden-tour.jpg\" alt=\"UBUD ROYAL PALACE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"UBUD ROYAL PALACE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/ubud-royal-palace.php\" title=\"Puri Saren Ubud\"><strong>Puri Saren Ubud</strong></a> or more popular name as a <a href=\"https://www.baligoldentour.com/ubud-royal-palace.php\" title=\"Ubud Royal Palace\"><strong> Ubud Royal Palace</strong></a> is an Ubud Kingdom Palace with beautiful Balinese  traditional houses as a residence of Ubud King. It is set in the center of Ubud Bali with traditional art  market just in front of it and it is found by Ida Tjokorda Putu Kandel who has  commanded from year 1800 - 1823. Ubud Royal Palace is an artistic cultural life  center, while the traditional market is the symbol of local economics resident.  The existence of Ubud Royal Palace as a palace is equipped  by a Wantilan/auditorium that is a large building of meeting room and a banyan  tree as shelter place at the daytime. The traditional market is the place of  society economics and its existence is always border on palace as artistic cultural  life center. It means that the both pole meeting is describing the dynamics of  society and kingdom life. </p>\n  <p class=\"text-justify mb-2\"><strong>If you visit Ubud Royal Palace, here all you need to know</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#ubud-village-history\">Ubud Village History</a></li>\n<li><a href=\"#ubud-name-history\">Ubud Village Name History</a></li>\n<li><a href=\"#kingdom-period\">Kingdom Period in Bali</a></li>\n<li><a href=\"#ubud-kingdom\">Establishment Kingdom in Ubud Village</a></li>\n<li><a href=\"#construction\">Construction of Puri Saren Ubud</a></li>\n<li><a href=\"#ubud-famous\">Beginning Ubud Village Famous</a></li>\n<li><a href=\"#puri-saren\">Puri Saren Ubud is Ubud Palace</a></li>\n<li><a href=\"#what-you-can-see\">What You Can See at Ubud Palace</a></li>\n<li><a href=\"#location\">Location Ubud Palace</a></li>\n<li><a href=\"#dance\">Traditional Dance at Ubud Palace</a></li>\n<li><a href=\"#facilities\">Ubud Palace Facilities</a></li>\n</ul>\n\n<span id=\"ubud-village-history\">\n<h3 class=\"font-small\">Ubud Village History</h3>\n<p class=\"text-justify\">It would be nice if we knew the history of Ubud village first, before reading anything else further, we can say that the history of Ubud village started from the 8th century which was written in lontar in ancient times, which tells about Rsi Markandeya who before to the island of Bali, first first visited the island of Java, and when on the island of Java he received a revelation that at the foot of Mount Agu there were 5 types of sick metal, he headed to the island of Bali and went straight to the location of the foot of Mount Agung which now stands Besakih Temple, while here, he felt the energy located in the village of Campuhan Ubud which is currently the location of the Gunung Lebah Temple. Rsi Markandeya lives in Ubud and teaches religious teachings to the people in Ubud and introduces irrigation systems, terrace farming and also teaches social systems such as Banjar, a community organization that is responsible for matters of religion and customs. Until now, Banjar community organizations still exist on the island of Bali. So is the initial story of Ubud Village which found first by Rsi Markandeya and teach religion, agriculture and social organizations.</p>\n</span>\n<span id=\"ubud-name-history\">\n<h3 class=\"font-small\">Ubud Village Name History</h3>\n<p class=\"text-justify\">As for the first time Rsi Markandeya came to Campuhan ubud and taught all about religion and others, so the name Campuhan ubud village became highly respected by the Balinese people and also in the past in this campuhan village there were many medicinal plants used for traditional medicine, so the name of the village \"Ubud \" comes from the word \"Ubad\" which means medicine, and in this campuhan village there are many ancient medicinal plants, so it is called Ubad which gradually turned into Ubud. If you travel to Ubud village, it would be nice to also visit Campuhan Village, where there are also interesting tourist destinations in this Campuhan such as Campuhan Ridge Walk, Campuhan River and others which are very interesting and will certainly make your trip to Ubud very enjoyable</p>\n</span>\n<span id=\"kingdom-period\">\n<h3 class=\"font-small\">Kingdom Period in Bali</h3>\n<p class=\"text-justify\">The period of the kingdom in Bali is known to have started from the 15th century when there was a large-scale exodus of Javanese aristocrats to migrate to the island of Bali. As for some nobles who founded a kingdom called Gelgel which is located in Klungking district, this Gelgel kingdom provided protection for the nobles who came from Java to migrate to the island of Bali, and the nobles who came with the caste system in Bali. Over time the development continued and in the 17th century many new kingdoms emerged on the island of Bali and many houses were also built by nobles called Puri. In addition, at this time there were also many wars between kingdoms fighting for power over regional expansion and other conflicts between kingdoms on the island of Bali.</p>\n</span>\n<span id=\"ubud-kingdom\">\n<h3 class=\"font-small\">The History of the Establishment of the Kingdom in Ubud Village</h3>\n<p class=\"text-justify\">During the war and power struggle between kingdoms in Bali in the 17th century, a prince from the Gelgel kingdom of Klungkung was sent to Sukawati village to build a kingdom that had a palace with architectural beauty aimed at encompassing power in the Gianyar area, the process of building a royal palace in Sukawati This involved many artists from various regions who were sent to Sukawati to make the palace appearance very beautiful in ancient times. After completion of construction, many artists choose to live in the Sukawati area and therefore Sukawati as one of the art centers of the island of Bali, from painting, sculpture, music and others we can see in Sukawati village. After successfully building the palace, the soldiers were sent to ubud to secure ubud where there was a conflict between two cousins ​​namely those in the Padang Tegal area of ​​Ubud and the Taman Ubud area, this conflict attracted the attention of King Sukawati and sent two of his brothers to reconcile the two cousins ​​involved This conflict, and establishing a kingdom in the Ubud area, namely Tjokorde Ngurah Tabanan establishing a kingdom in Peliatan Ubud and Tjokorde Tangkeban establishing a kingdom in the Samabahan area of ​​Ubud with the aim of securing the Ubud area from various kinds of conflicts. Tjokorde Ngurah Tabanan who founded the kingdom in Ubud assisted by King Mengwi filled the Ubud area with residents and with the increase in population here, the economy began to develop and Ubud became very famous in its time.</p>\n<p class=\"text-justify\">Although the old Balinese feudal system was superseded by the Dutch colonial government more that eighty years ago, the Tjokordas still retain a special role in Ubud society. Many leadership roles, both sacred and secular are held by Tjokordas. They also figure prominently in the local business community, arts institutions, and professional circles. While no formal power is automatically granted to someone because they come from a puri, the Ubud royals still command respect solely on the basis of their heredity. They also command respect from some quarters on the basis of their rather disproportionate wealth.</p>\n<p class=\"text-justify\">The Tjokordas are no longer the physical embodiment of The State, they are just private citizens, with the same concerns as other private citizens, plus a few more. Accordingly, the Ubud palaces are essentially just family homes, and none have yet been turned into museums of public tourist attractions. While some of them are fine examples of traditional architecture, none are \"historical\" in terms of age. In fact, most are pretty new. The oldest Ubud palace was located a little to the east of Pura Dalem Ubud, above the main road. It collapsed in an earthquake early this century, and nothing remains but a flat place with traces of foundation here and there.</p>\n</span>\n<span id=\"construction\">\n<h3 class=\"font-small\">Construction of Puri Saren Ubud</h3>\n<p class=\"text-justify\">After going through a period of succession of kings in Ubud, and finally during the reign of Ida Tjokorda Putu Kandel in (1800 - 1823) the Puri Saren Agung or known as <a href=\"https://www.baligoldentour.com/ubud-royal-palace.php\" title=\"Ubud Royal Palace\">Ubud Royal Palace</a> was built, which involved many artists in Ubud at that time to build the establishment of Puri Saren Agung and the function as a place for preserving traditional Balinese culture such as dances and literary works as well as being the residence of the King of Ubud, and after Ida Tjokorde Putu Kandel died there was a change of leadership led by his son, Tjokorde Putu Sukawati, whose reign was from 1823 to 1850, During this reign, the village of ubud became very advanced in all fields, the most prominent being in the fields of painting, carving and dance which made the village of ubud very famous long time ago.</p>\n</span>\n<span id=\"ubud-famous\">\n<h3 class=\"font-small\">Beginning Ubud Village Famous</h3>\n<p class=\"text-justify\">The first time that the village of Ubud was famous in foreign countries occurred in the early 1930s where many tourists visited the village of Ubud, which at that time the first Ubud Village was more ready to accommodate tourists. Focused on the village of ubud because of the business trust of Tjokorde Gede Agung Sukawati who is fluent in English and Dutch, he set up a small guest house and along with his older brother Tjokorde Raka Sukawati who lives across the street took the initiative to invite famous artist composers such as Walter Spies to come. to ubud and stay in ubud while working. This made the village of ubud very well known in foreign countries, and soon many famous people came to ubud such as Rudolf Bonnet and Williem Hofker who also came to ubud and presented modern painting. And with this, the village of ubud became very famous, and finally famous artists such as Noel Coward, Charlie Chaplin, H.G Wels and also famous anthropologists such as Margaret Mead came. In 1936 Tjokorde Gede Agung formed an association of painters and collaborated between local artists and foreign artists such as Spies, Bonnet and the help of American composer Colin Mcphee who had built a house along Sayan Rdige which was very amazing. Ubud developed a reputation as the pulse of Balinese culture and that image still persists today.</p>\n</span>\n<span id=\"puri-saren\">\n<h3 class=\"font-small\">Puri Saren Ubud known as Ubud Palace</h3>\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/ubud-royal-palace.php\" title=\"Ubud Royal Palace\">Ubud Royal Palace</a> with another name is Puri Saren Ubud di Ubud has been a \"royal town\" for over a hundred years. Its princes, who bear the title \"Tjokorda\" or \"Agung\" still live in traditional palaces, called \"Puris\". Be aware, however, that every place called \"puri\" is not a royal palace. The word has been used quite liberally of late. Also be aware that there is not one palace in Ubud, but many, most of them clustered around the main cross-roads near the Ubud market. There are several other \"royal\" towns in the Ubud area, too, with their own palaces, most of which have close family ties to the Ubud Tjokordas. A web of connections is maintained by incidental and arranged marriages among the respective offspring of princes in Sayan, Pejeng, Singapadu, Peliatan, and Payangan's puris. Although the old Balinese feudal system was superseded by the Dutch colonial government more that eighty years ago, the Tjokordas still retain a special role in Ubud society. Many leadership roles, both sacred and secular are held by Tjokordas. They also figure prominently in the local business community, arts institutions, and professional circles. While no formal power is automatically granted to someone because they come from a puri, the Ubud royals still command respect solely on the basis of their heredity. They also command respect from some quarters on the basis of their rather disproportionate wealth. In pre-colonial Bali, palaces were the primary patrons of art, music, dance and literature. The Ubud palaces consciously continue this tradition. They act as repositories of traditional culture, and develop artistic endeavours throughout the area, much to the benefit of both Ubudians and visitors. </p>\n</span>\n<div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/ubud-royal-palace.php\"><img src=\"images/bali-interest-place/ubud-royal-palace-1.jpg\" alt=\"Entrance Gate Ubud Palace | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width\" title=\"Entrance Gate Ubud Palace | Gianyar Places of Interest | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Entrance Gate Ubud Palace</p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/ubud-royal-palace.php\"><img src=\"images/bali-interest-place/ubud-royal-palace-2.jpg\" alt=\"Kori Agung Ubud Palace | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width\" title=\"Kori Agung Ubud Palace | Gianyar Places of Interest | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Kori Agung Ubud Palace</p></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/ubud-royal-palace.php\"><img src=\"images/bali-interest-place/ubud-royal-palace-3.jpg\" alt=\"Ubud King Throne | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width\" title=\"Ubud King Throne | Gianyar Places of Interest | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Ubud King Throne</p></div>\n</div>\n<span id=\"what-you-can-see\">\n<h3 class=\"font-small\">What You Can See at Ubud Palace</h3>\n<p class=\"text-justify mb-2\"><a href=\"https://www.baligoldentour.com/ubud-royal-palace.php\" title=\"Ubud Royal Palace\">Ubud Royal Palace</a> is a historical building that tells the story of the king of Ubud who governed the government in Ubud village in ancient times, and the Ubud Palace building is still standing strong and awake until now, you can see it when visiting Ubud Village, by maintaining the characteristics of the building from the past. with thick stone carvings that are very beautiful, making this ubud palace one of the popular tourist destinations in ubud village. There are several things that you can see in Ubud palace with all the beauty and uniqueness of this historical building that will complete your adventure in this Ubud village.</p>\n<ol>\n<li class=\"text-justify mb-2\"><strong>Wantilan</strong>: In front of the Ubud Palace you will see a large wantilan which is an open building as a resting place and also functions as a place for events such as traditional religious dances in Ubud village that use gamelan instruments (traditional Balinese musical instruments)</li>\n<li class=\"text-justify mb-2\"><strong>Entrance</strong>: The first thing we see is the entrance that is so magnificent with the shape of the design and with the reliefs and carvings that have a very high historical significance with the color of the red brick pattern and a little decoration making this entrance very luxurious.</li>\n<li class=\"text-justify mb-2\"><strong>Statue</strong>: There is a statue with a high aesthetic as if to say welcome which is located on the side of the entrance with a frangipani tree which is very identical to the characteristics of the island of Bali, you can capture the moment when you just enter the door with the statue on the right and left</li>\n<li class=\"text-justify mb-2\"><strong>Kori Agung</strong>: In the middle you can see a very magnificent Kori Agung made of dark red bricks, and on the door made of wood with gold paint decorations that make this Kori Agung very beautiful, many tourists take their time to take pictures in front of Kori Agung, in addition to the very enchanting scenery, it will make the photos very instagramable.</li>\n<li class=\"text-justify mb-2\"><strong>Throne</strong>: If you enter through the door on the left of Kori Agung you will come to the second page where you can see the throne of the ancient king of Ubud, which is located in a building and there are two throne chairs used by the ancient kings of Ubud inside. run his government during the kingdom in Ubud</li>\n<li class=\"text-justify mb-2\"><strong>Gamelan</strong>: In addition to the throne, there is also a complete gamelan instrument that was used by the kingdom when holding religious ceremonies or dance performances, gamelan is a traditional musical instrument in Bali, and is used for religious ceremonies, dance performances and others.</li>\n</ol>\n</span>\n<span id=\"location\">\n<h3 class=\"font-small\">Location Ubud Palace</h3>\n  <div class=\"row\">\n    <div class=\"col-md-8\">\n\n<p class=\"text-justify\">The location of the <strong>Ubud Royal Palace</strong> is located in the center of Ubud, which is close to the location of the <a href=\"https://www.baligoldentour.com/ubud-market.php\" title=\"Ubud Market\">Ubud Market</a>. It is not so difficult to find the location of this Ubud palace, due to its very strategic location which is close to tourist destinations such as <a href=\"https://www.baligoldentour.com/ubud-monkey-forest.php\" title=\"Ubud Monkey Forest\">Ubud Monkey Forest</a> and <a href=\"https://www.baligoldentour.com/saraswati-temple.php\" title=\"Saraswati Temple\">Saraswati Temple</a>. If you come from Kuta you will need about 2 hours drive to reach the location of this Ubud palace, with the help of google map, then you will easily find the location of this Ubud palace, besides that at every crossroads, there are directions which directs to the location of this ubud palace. If you don't want to be confused about driving yourself, we from Bali Tour are ready to take you to this location from Ubud palace by offering a Hire Car and Driver program that you can take at a relatively cheap price and of course the service we provide is very satisfying, accompanied by an experienced driver will make this trip even more enjoyable</p>\n</div>\n<div class=\"col-md-4\">\n<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3945.9244223912438!2d115.2605335146034!3d-8.506719393884174!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x2dd23d6af37eb24b%3A0x4bcdf69a281c3f32!2sUbud%20Palace!5e0!3m2!1sen!2sid!4v1660805295484!5m2!1sen!2sid\" class=\"full-width\" width=\"400\" height=\"225\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>\n\n</div>\n</div>\n<span id=\"dance\">\n<h3 class=\"font-small\">Traditional Dance at Ubud Palace</h3>\n<p class=\"text-justify\">Apart from being a tourist destination for historic buildings in Ubud, here there are also traditional dance performances danced by professional dancers who will make the show very beautiful to look at. The dance performances here are of the type of Legong dance which takes the story from Mahabrata, Ramayana. The show is held in the afternoon at 19.30 - 21.00 pm which is located in front of Kori Agung in Ubud Palace. A dance performance that is very enchanting and beautifully performed by the dancers that will make you immersed in the story that is delivered, if you want to watch this dance, please come early and buy tickets at the ticket booth in Ubud Palace, at a price which is affordable you can see this very beautiful and enchanting traditional dance. Because the location of the place is not too big, so you should come early and buy a ticket, if you arrive late, the ticket may run out because the place is not that big. It is a very special experience to see a dance performance in the center of Ubud with the beauty of the curves of the dancers will make you dissolve in the emotions of this story.</p>\n</span>\n<span id=\"facilities\">\n<h3 class=\"font-small\">Ubud Palace Facilities</h3>\n<p class=\"text-justify\">As for being one of the most popular tourist destinations in this Ubud village, Ubud Palace has very complete facilities and will make you feel at home for a long time in this location. There is a parking facility located in the north beside the road, and you can also park at the ubud market first and walk to the ubud palace, due to its location in the city center and lots of cars passing by here, so it's best if you drive yourself can park at ubud market and walk to get here. In addition, there are also toilet facilities located in Wantilan which is located in front of this <a href=\"https://www.baligoldentour.com/ubud-royal-palace.php\" title=\"Ubud Royal Palace\">Ubud Royal Palace</a>, by paying a donation you can already use this toilet. There are many small shops selling various kinds of cold food and drinks, and also if you want to buy handicrafts or souvenirs you can walk to the Ubud market, there sells a complete variety of handicrafts that you can buy at cheap prices. A facility that is quite complete, so it will make you very comfortable to linger in the city of Ubud. If a vacation in Bali is incomplete, it feels like you don't visit Ubud Palace and other tourist destinations in the city of Ubud</p>\n</span>\n        </span>"
]