[
  "<h1><a href=\"https://www.baligoldentour.com/ubud-monkey-forest.php\" title=\"BALI UBUD MONKEY FOREST\">BALI UBUD MONKEY FOREST</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/ubud-monkey-forest.php\" title=\"BALI UBUD MONKEY FOREST IS A NATURE RESERVE AND TEMPLE COMPLEX IN UBUD VILLAGE ALSO AS A PLACE OF SACRED MONKEY FOREST SANCTUARY\">BALI UBUD MONKEY FOREST IS A NATURE RESERVE AND TEMPLE COMPLEX IN UBUD VILLAGE ALSO AS A PLACE OF SACRED MONKEY FOREST SANCTUARY</a></h2>\n<a href=\"https://www.baligoldentour.com/ubud-monkey-forest.php\"><img src=\"images/bali-interest-place/ubud-monkey-forest-bali-golden-tour.jpg\" alt=\"UBUD MONKEY FOREST | SACRED MONKEY FOREST | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"UBUD MONKEY FOREST | SACRED MONKEY FOREST | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n\n<p class=\"text-justify\"> <strong><a href=\"https://www.baligoldentour.com/ubud-monkey-forest.php\">Bali Ubud Monkey Forest</a></strong> is a nature reserve temple complex in Ubud Bali. Its full name as written on a welcome sign is the <em>Padangtegal Mandala Wisata</em>. Bali Ubud Monkey Forest is a small rain forest dwelt by some group of monkeys and other  tropical animals. It is strategically located in the hearth of Ubud Village. Monkey Forests in Balinese language called Wanara Wana are  spread out in the island and Ubud Monkey Forest itself own very important  function of the continuity the monkey habitat in Bali. Meanwhile the local  community own important role to keep this forest naturally in order to all wild  animals able to live smoothly. A small tropical forest in the center of Ubud city offers very beautiful natural beauty, besides the monkeys here you can also visit the temple inside and also see the beauty of the green trees around this place which is a playground for the monkeys. the one here</p>\n  <p class=\"text-justify mb-2\"><strong>If you visit Ubud Monkey Forest, here all you need to know</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#location\">Location Ubud Monkey Forest</a></li>\n<li><a href=\"#history\">Ubud Monkey Forest History</a></li>\n<li><a href=\"#wanara\">The Wanara Wana Ubud</a></li>\n<li><a href=\"#long-tail-macaques\">Long Tail Macaques at Ubud Monkey Forest</a></li>\n<li><a href=\"#conservation\">Conservation at Ubud Monkey Forest</a></li>\n<li><a href=\"#tri-hita-karana\">Tri Hita Karana Concept at Ubud Monkey Forest</a></li>\n<li><a href=\"#temple\">Temple at Ubud Monkey Forest</a></li>\n<li><a href=\"#facilities\">Facilities at Ubud Monkey Forest</a></li>\n<li><a href=\"#need-to-know\">Need to Know about Ubud Monkey Forest</a></li>\n</ul>\n<span id=\"location\">\n<h3 class=\"font-small\">Location Ubud Monkey Forest</h3>\n<p class=\"text-justify\">The sacred sanctuary of Monkey Forest is located on the southern border of Ubud  town around 3 kms south of central town with a leading road also with the name  ofMonkey Forest. The site can be reached by many sides besides from central  town of Ubud, from eastern corner of Ubud and from southern area of Ubud. The  distance from Kuta is around 55 kms, from Sanur around 40 kms, and from Nusa  Dua area around 65 kms. The location is located in the center of Ubud, so it's very easy to find the location of Ubud Monkey Forest, armed with a google map and directions at each crossroads will make it very easy for you to find this place. And if you want to visit Ubud Monkey Forest, you visit other tourist destinations in Ubud, you can take the <a href=\"https://www.baligoldentour.com/bali-ubud-tours.php\" title=\"Full Day Ubud Tour\">Full Day Ubud Tour</a> package and if you only want to visit it within half a day, you can take the <a href=\"https://www.baligoldentour.com/bali-ubud-tour.php\" title=\"Half Day Ubud Tour\">Half Day Ubud Tour</a> package and of course the price very cheap and friendly on your pocket. In addition, we from <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a> provide transportation at low prices that you can rent if you only want to visit this Ubud monkey forest tourist destination.</p>\n</span>\n<span id=\"history\">\n<h3 class=\"font-small\">Ubud Monkey Forest History</h3>\n<p class=\"text-justify\">As for the establishment of <a href=\"https://www.baligoldentour.com/ubud-monkey-forest.php\" title=\"Ubud Monkey Forest\">Ubud Monkey Forest</a>, it is not known exactly when it was founded, but based on the lontar Pura Purana records that the temples in Monkey Forest based on an analysis of a manuscript called Pura Purana ( meaning  history of a Pura ) which is considered a holy writing the temple was built  around 14th century during the reign of  Pejeng Dynasty or it could also be called the beginning of the Gelgel Dynasty. If this assumption is taken the establishment of the temple would be before 1343 AD, not at the beginning of Gelgel Palace which is far behind around 17th  century. The purpose for building the Ubud Monkey Forest is based on the teachings of Tri Hita Karana which emphasizes the relationship between humans and their environment. Located in a sacred area with an area of ​​12.5 hectares, where this sacred area is referred to as a sacred area where temples are located, in this area there are 3 holy temples that are sanctified by local people, including Pura Dalem Agung, Pura Beji and Pura Prajapati. Research from Udayana University in Bali also identified 115 tree species in the Ubud Monkey Forest. Some trees are considered sacred and are included in the Balinese Hindu worship rituals. For example the majegan tree whose trunk is used specifically to make temples, the banyan tree which is used for cremation ceremonies, and the pule bandak tree which symbolizes the spirit of the forest and is used to make sacred masks. In addition, there is also a long-tailed monkey habitat here, a total of about 800 monkeys that inhabit this Ubud Monkey Forest</p>\n</span>\n<span id=\"wanara\">\n<h3 class=\"font-small\"><strong>The Wanara Wana Ubud</strong></h3>\n<p class=\"text-justify\">Wanara Wana is a Balinese language where the word \"<strong>Wanara</strong>\" means \"<strong>Monkey</strong>\" and the word \"<strong>Wana</strong>\" which means \"<strong>Forest</strong>, so Wanara Wana if translated into English means Monkey Forest. Wanara Wana is Sanskrit language, as the language  ever influenced the layers of religious and ruling class of Indonesian  archipelago before the fall into islam, and only Bali that strongly maintains  the tradition. It is important to treat the monkeys with respect as this forest is their home  and you are a guest in it. Please remain on the paved paths. The monkeys may become aggressive if you invade their private areas. Ubud monkey forest staff and researcher may occasionally be seen in this areas please do not follow them, \nbecause they are on duty to guard every corner of the Ubud Monkey Forest so that the monkeys don't get out of control and also to monitor the state of the tourists in this area and always be alert if something unexpected happens.</p>\n</span>\n<div class=\"row row-tour\">\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/ubud-monkey-forest.php\"><img src=\"images/bali-interest-place/ubud-monkey-forest-1.jpg\" alt=\"Ubud Monkey Forest | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width mb-3\" title=\"Ubud Monkey Forest | Gianyar Places of Interest | Bali Golden Tour\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/ubud-monkey-forest.php\"><img src=\"images/bali-interest-place/ubud-monkey-forest-2.jpg\" alt=\"Ubud Monkey Forest | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width mb-3\" title=\"Ubud Monkey Forest | Gianyar Places of Interest | Bali Golden Tour\"></a></div>\n<div class=\"col-lg-4 col-md-6 col-sm-12 pad-tour\"><a href=\"https://www.baligoldentour.com/ubud-monkey-forest.php\"><img src=\"images/bali-interest-place/ubud-monkey-forest-3.jpg\" alt=\"Ubud Monkey Forest | Gianyar Places of Interest | Bali Golden Tour\" width=\"350\" height=\"250\" class=\"full-width mb-3\" title=\"Ubud Monkey Forest | Gianyar Places of Interest | Bali Golden Tour\"></a></div>\n</div>\n<span id=\"long-tail-macaques\">\n<h3 class=\"font-small\">Long Tail Macaques at Ubud Monkey Forest</h3>\n<p class=\"text-justify\">In this world there are approximately 200 species of primates (apes and monkeys) and 40 species or almost 25% of them live in Indonesia. One of them is the long-tailed macaque (Macaca fascicularis), which is native to Southeast Asia, although it is now scattered in various parts of Asia. Macaca fascicularis or long-tailed macaques are the most common species of monkeys or macaques found in mainland Southeast Asia, such as in Brunei Darussalam, Cambodia, Indonesia, Laos, Malaysia, Myanmar, the Philippines, Singapore, Thailand, Timor Leste and Vietnam. In addition to Southeast Asia, Macaca fascicularis is also found in Bangladesh and India. This species often forms groups of up to 20-30 tails in number, with 2-4 adult males and the rest females and children. They eat various fruits and prey on various types of small animals such as crabs, insects, eggs and others.</p>\n<p class=\"text-justify\">The <strong>monkeys that live in this sanctuary are called long tail macaques</strong>. Their scientific name is macaca fascicularis and  aside from humans, macaques are the most widespread and successful of all  primates. These macaques  live primarily in three clusters of females and males. Each of these groups  tends to use different areas of the forest at different ties of the day. All  macaques use all of the forest. Conflicts sometimes arises when two groups are  in same area. Adult males weight up to 8 to 10 kgs and have large canines  teeth, broad shoulders and facial hair that resembles a mustache. The adult females  are smaller then the males ( 4-8 kgs ) and have long facial hair resembling  beads. Balinese macaques group is centered around groups of related females  called \"matriline\" Male macaques usually migrate in from other area  and attempt to associate themselves with the female matriline Both males and  females, have st of dominance relationship, but they are not always clear or  consistent. Mating can take place all year round but most infants are born during the  months of May - August. Macaques mothers range from very protective to very  permissive with their infants. Many females who are not the mother spend time  holding and caring for infants. Sometimes you will even see an adult male  \"mothering\" as well.</p>\n<span id=\"conservation\">\n<h3 class=\"font-small\">Conservation at Ubud Monkey Forest</h3>\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/ubud-monkey-forest.php\" title=\"Ubud Monkey Forest Sanctuary\">Ubud Monkey Forest Sanctuary</a> with complex houses approximately 340 (<em>Macaca fascicularis</em>) monkeys (32 adult males, 19 male sub  adult, 77 adult females, 122 juvenile and 54 infants). Crab-eating Macaque. It can often seen how the Balinese Macaques are cracking open coconuts. If  available they like to eat bananas and papayas, too. Once taken please leave  the fruit with the monkeys. If you with to feed the macaques please do so  carefully, and if they take food from you, please do not attempt to retrieve it  back. It is also of great importance that you treat the trees, the plants and  other animals and structures within the Sacred Monkey Forest with great respect. The Sacred Ubud Monkey Forest Sanctuary  serves not only as an important component in the  spiritual and daily life of the villagers, but is the site of several research  and conservation programs. The maintenance and management of special place like  this attract the attention of researchers from all over the world, especially  the interaction between human beings and the monkeys of this sacred place are  subject to surveys and research studies. This is holy area and an important ecological preservation. please enjoy the  beauty and magic of this place. while at the same time respecting what lives in  it. If you have any question or if you should need assistance, please asked the  Wenara wana personnel ( identified by their green uniforms ) or a member of the  research project.</p>\n</span>\n<span id=\"tri-hita-karana\">\n<h3 class=\"font-small\">Tri Hita Karana Concept at Ubud Monkey Forest</h3>\n<p class=\"text-justify mb-2\">The concept of Tri Hita Karana which is interpreted word for word where the word Tri which means Tiga and Hita which means Happiness and Karana which means Cause, thus the meaning of Tri Hita Karana is the Three Causes of the creation of happiness. The concept of Tri Hita Karana is a responsible philosophy of life that has a concept that can preserve cultural and environmental diversity in the midst of globalization and homogenization. Basically, the essence of the teachings of Tri Hita Karana emphasizes three human relationships in life in this world. The three relationships include</p>\n<ol class=\"text-justify mb-2\">\n<li class=\"text-justify mb-2\"><strong>Humans With God</strong>: Man is God's creation, while the Atman in man is a spark of the holy light of God's greatness that causes man to live. Seen from this point of view, man actually owes his life to God. Therefore, every human being must be grateful, devoted and always prostrate to God Almighty. The gratitude and prostration of devotion can be expressed in the form of puja and praise for His greatness, such as worshiping and carrying out his orders, tirtha yatra or dharma yatra (visits to holy places), practicing yoga samadhi and practicing religious teachings.</li>\n<li class=\"text-justify mb-2\"><strong>Humans with Natural Environment</strong>: Humans live in a certain environment. Humans obtain the necessities of life from their environment. Humans are thus very dependent on their environment. The environment must always be maintained and maintained and not damaged. The environment should not be polluted or damaged. Forests should not be cut down entirely, animals should not be hunted arbitrarily, because it can disturb the balance of nature. Instead, the environment must be maintained for its neatness, harmony and sustainability. A neat and clean environment will create beauty. The beauty of the environment can cause a sense of calm and serenity in humans.</li>\n<li class=\"text-justify mb-2\"><strong>Humans with Others</strong>: As social beings, humans cannot live alone. They need help and cooperation with others. Therefore, the relationship between each other must always be good and harmonious. Relationships between humans must be regulated on the basis of mutual honing, mutual love and mutual care, which means mutual respect, mutual love and mutual guidance. Relations between families at home must be harmonious. Relations with other communities must also be harmonious. This good relationship will create security and inner peace in society.</li>\n</ol>\n<p class=\"text-justify\">As for the Ubud monkey forest, it emphasizes the relationship between humans and their environment, where what is meant here is the relationship between humans and the forest and monkeys that are here, where the animal life here is maintained and preserved so that the balance of nature can be maintained and life can be harmonious and peaceful, besides the beauty of the environment. In Ubud Monkey Forest, this can also add to the heart of peace and comfort when you see it, this is one of the teachings of Tri Hita Karana which emphasizes the relationship between humans and the surrounding environment, and here what is meant is the relationship between humans and the environment and the animals found in Ubud Monkey. this forest</p>\n</span>\n<span id=\"temple\">\n<h3 class=\"font-small\">Temple at Ubud Monkey Forest</h3>\n<p class=\"text-justify mb-2\">Besides having a very enchanting natural beauty where there is a forest with lush trees and inhabited by hundreds of monkeys who are friendly and sacred by the local people here. Ubud monkey forest also has a very beautiful temple to look at with a Balinese architectural design style that seems to add to its unique and ancient impression. The history of the temple has existed since time immemorial. There are three temples in The&nbsp;Sacred  Monkey Forest namely :</p>\n<ol class=\"text-justify mb-3\">\n<li class=\"text-justify mb-2\"><strong>Pura Dalem Agung Padang Tegal</strong> is a temple located in the village of Padang Tegal which is located in the Ubud monkey forest area, precisely in the southwest part of the monkey forest area of ​Ubud. Pura Dalem Agung Padangtegal Ubud, is intended to worship the god Shiva as part of Kahyangan Tiga which is found in every traditional village in Bali. In its history, it was previously mentioned that Pura Dalem is a worship of Dewi Durga as the main deity of the Bhairawa Sect, so that Pura Dalem is very closely related to Setra and Pura Prajapati as a place of worship of the cosmic nature to neutralize positive and negative forces. The Pura Dalem Agung Padang Tegal is also known as the \"Temple of the Dead\" among foreign tourists.</li>\n<li class=\"text-justify mb-2\"><strong>Pura Beji</strong> is a temple located in the southwest of the monkey forest area of ​​Ubud. Beji Temple is designated as a place of worship for the goddess Ganga. According to Balinese Hindu belief, Pura Beji is a sacred garden located in the temple environment as a place of purification for Ida Bethara before religious ceremonies are held. The people of Padang Tegal village before carrying out religious ceremonies will come to this Beji Temple to ask for holy water which will be designated as one of the important means in the ceremony using holy water from this Beji Temple. Apart from being a place of purification for Ida Bethara, Beji is also often used for melukat as a spiritual cleansing of the mind and soul.</li>\n<li class=\"text-justify mb-2\"><strong>Pura Prajapati</strong> is a temple located in the eastern area of ​​the monkey forest of Ubud, while the function of this Prajapati temple is as a place of worship to Sanghyang Widhi in His prestige as \"Prajapati\" and also Dewi Durga which is located in Hulun setra. According to Balinese Hindu belief, if a person dies and has not been held in the Ngaben ceremony, then that person's spirit has the status of \"Preta\" and must be buried in the Prajapati Temple first, so that the spirit of the deceased person does not wander. if it is ready to carry out the cremation, the family will pray at the Prajapati temple and ask that the preta can be cremated and increase his status to \"Pitra\" which will form the subtle bodies of Teja (light), Vayu (air) and Akasa (ether).</li>\n</ol>\n</span>\n<span id=\"facilities\">\n<h3 class=\"font-small\">Facilities at Ubud Monkey Forest</h3>\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/ubud-monkey-forest.php\" title=\"Ubud Monkey Forest\">Ubud Monkey Forest</a> as the number one tourist destination in Ubud has very complete facilities, where this place is always visited by hundreds of tourists every day and with these complete facilities it will make tourists feel very comfortable to linger in this place. there is a very large parking lot, so you don't need to be confused anymore to find a parking space, have toilet facilities located in every corner of the Ubud Monkey Forest area, so you don't have to worry if you need to pee here, there is a very nice lobby as information center for those of you who need a map of this monkey forest area, in front of Ubud monkey forest across the street, there are a row of shops selling various kinds of handicrafts and souvenirs that you can get at low prices, and there are drink and snack shops and even this restaurant along the Ubud Monkey Forest road. A very adequate facility for tourist satisfaction in spending time in this Ubud village</p>\n</span>\n<span id=\"need-to-know\">\n<h3 class=\"font-small\">What You Need To Know About Ubud Monkey forest</h3>\n<p class=\"text-justify mb-2\">Ubud monkey forest is the most popular tourist destination in Ubud village, with all its uniqueness and natural beauty here making this place very popular among foreign and domestic tourists, Supported by super complete facilities will make tourists very enjoyable and feel at home here for a long time. And if you want to visit Ubud Monkey Forest, there are some things you can do and shouldn't do while you are visiting Ubud Monkey Forest and to avoid unwanted things, so that the situation in visiting Ubud Monkey Forest is more comfortable. What you need to know about Ubud Monkey forest is as follows:</p>\n<ul class=\"text-justify mb-2\">\n<li class=\"text-justify mb-2\">The opening hours of Ubud Monkey Forest are 09.00 am - 18.00 pm, but the opening hours of purchasing entrance tickets are 09.00 - 17.00 pm. So if you want to visit Ubud Monkey Forest, please visit between these hours, so you don't lose if you come here but Ubud Monkey Forest is not open or closed.</li>\n<li class=\"text-justify mb-2\">Do not disturb the monkeys here, especially the sires who take their children, because the sires are very protective of their children. And if there is a problem, you can look for officers who are in every corner of the Ubud Monkey Forest, usually the Ubud Monkey Forest officer is in green</li>\n<li class=\"text-justify mb-2\">Do not bring food and drinks into Ubud Monkey Forest, because the monkeys here when they see food, they think they will be given food and will try to approach you, and if there is an aggressive monkey, they will take your food or drink right away, so if you bring food should put it in your bag</li>\n<li class=\"text-justify mb-2\">When visiting the holy temple here, it is expected to behave politely to respect the holy place that is here. Like in the pool in front of the Beji Temple, don't throw coins in the pool, because it's not our culture to throw coins in the pool and hope for luck and don't play this holy water.</li>\n<li class=\"text-justify mb-2\">If you are afraid of monkeys, please always stay close to the officers in every corner of Ubud monkey forest, because these officers will always be ready to keep tourists from being disturbed by monkeys, the officers here usually wear green clothes and use udeng</li>\n<li class=\"text-justify mb-2\">If you want to take pictures with monkeys, you can ask the staff here for help, he will help you to take photos with the best angles and photos, of course you need to give tips for help, enjoy taking pictures with monkeys in the forest ubud tropics</li>\n</ul>\n<p class=\"text-justify\">Those are some things we can tell you about <strong>Ubud Monkey Forest</strong>, if you want to visit Ubud Monkey Forest, you can contact us, we will be very happy to be able to participate in your trip to spend your vacation time by visiting one of the most famous and most frequent tourist destinations in Bali. visit in this Ubud village. Enjoy the atmosphere of a tropical forest that is still very natural with many lush green trees inhabited by local Balinese monkeys who are very cute and adorable. This will complete your vacation day on the island of Bali, so in the future you will not be curious anymore about this Ubud Monkey Forest. . Visiting here is very suitable to do with family and children, besides being able to interact directly with the monkeys here and also add insight into the behavior of the tame monkeys here. An experience that is very difficult to forget, so what are you waiting for, add Ubud Monkey Forest to your list of tourist destinations when visiting the island of Bali which is very beautiful and full of unique culture, unique tourist destinations and also very enchanting natural scenery.</p>\n</span>\n        </span>"
]