[
  "<h1 class=\"text-uppercase\"><a href=\"https://www.baligoldentour.com/batuan-village.php\" title=\"Batuan Village\">Batuan Village</a></h1>\n<h2 class=\"text-uppercase\"><a href=\"https://www.baligoldentour.com/batuan-village.php\" title=\"Batuan Village is The Center of Painting Art with Unique Batuan Style and Artistic Painting in Bali Islands\">Batuan Village is The Center of Painting Art with Unique Batuan Style and Artistic Painting in Bali Islands</a></h2>\n<a href=\"https://www.baligoldentour.com/batuan-village.php\"><img src=\"images/bali-interest-place/batuan-village-art-gallery-bali-golden-tour.jpg\" alt=\"Batuan Village | Bali Painting Art | Bali Interest Place | Bali Golden Tour\" width=\"1200\" height=\"500\" class=\"auto-width\" title=\"Batuan Village | Bali Painting Art | Bali Interest Place | Bali Golden Tour\"></a>\n<p class=\"text-right mb-3\"><em style=\"font-size:13px\">Source : Dewa Putu Toris</em></p>\n\n<p class=\"text-justify\"><strong><a href=\"https://www.baligoldentour.com/batuan-village.php\" title=\"Bali Batuan Village\">Bali Batuan Village</a></strong> a famous <strong>Balinese Artwork / Balinese paintings</strong> and as such a famous Bali tourism destinations, located about 7 kilometers north of Denpasar about and 10 kilometers south of Ubud, it is popular with center of Bali arts, and now it's known for its dancing, wood panel carving and Bali paintings ubud. We have lots of tours to Batuan and Ubud painters - where you'll see the beautiful paintings and they have Bali paintings for sale too. Batuan has always been a gathering place for painting artists in the village of Ubud, with such beautiful works that make the batuan village the center of painting on the island of Bali, if you like painting, it would be nice to visit the batuan village and stop by one of the artists paint and see his work even buy it if you are interested, A very extraordinary experience, seeing the art of painting in the batuan village with its characteristics that are very thick with Balinese characteristics will be a valuable experience</p>\n\n\n  <h3 class=\"font-small\">Location of Batuan Village</h3>\n  <p class=\"text-justify\">The location of the batuan village is located on Jl. Raya Batu, Batu, Kec. Sukawati, Gianyar Regency, Bali 80582, is located on the main road leading to Ubud Village which is very strategic, so if you want to visit Ubud Village, you can stop by this Batuan Village to see the very beautiful painting art. If you drive from Kuta to Batu Village it will take about 1.5 hours of travel, with the help of Google Maps you will easily reach this location. The location of Batuan Village is close to the <a href=\"https://www.baligoldentour.com/batuan-temple.php\" title=\"Puseh Batuan Temple\">Puseh Batuan Temple</a> which is here, because it is still one village. If you are confused about finding the location, you can contact us <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a> and we will take you to see the very beautiful art of painting from various types of paintings here, by offering comfortable transportation and also an experienced driver will make this trip very enjoyable</p>\n    \n    <h3 class=\"font-small\">Batuan Village History</h3>\n    <p class=\"text-justify\">Batuan Village is one of the oldest villages on the island of Bali, which is part of the Gianyar Regency and is close to the village of Ubud. Batuan village has existed since time immemorial, where this can be proven by the history of Batuan Temple in this batuan village, which is very old, you can read here <a href=\"https://www.baligoldentour.com/batuan-temple.php#history-batuan\" title=\"Batuan Temple History\">Batuan Temple History</a>. From the past until now, the batuan village has still maintained the preservation of the Batuan Temple and also the preservation of the art of painting here with its very unique characteristics with the application of traditional types of painting techniques such as painting with puppet images. It is known that this batuan village has existed since the reign of the Warmadewa Dynasty in Bali, the name of Batuan village was Batuan Village which here is a batuany area so it is called Batuan village, so in everyday language pronunciation, Batuan is more popularly called Batuan. In addition, an inscription was found stating the existence of Batuan Village at the Hyang Tibha Temple which was built by Candrasengkala Idquo in 829 Isaka or 907 AD during the reign of Srie Ajie Darmapangkaja Wira Dalem Kesari. The location of the Hyang Tibha Temple is located in Blahbatuh Hamlet which is also included in the Batuan Village area. Hyang Tibha Temple is a temple whose function was to worship the greatness of Ida Sang Hyang Shiva as a symbol of Maha Pralina. Until now the inscription is still stored in the Puseh Batuan Temple which was built in the year 944 or 1022 AD, to be precise on December 26, 1022 with the leader of a monk named Bhiksu Widiya and a village head named Bhiksu Sukaji and a village clerk named Mamudri Gawan.</p>\n\n    <h3 class=\"font-small\">History Painting Art at Batuan Village</h3>\n    <p class=\"text-justify\">The art of painting has been known from time immemorial about hundreds of years ago, which was previously intended for the benefit of religious ceremonies in this batuan village. The painting is for ceremonial purposes such as drawing gods and placing them in temples and others. At the beginning of tourism entered the village of Ubud in the 1930s, where Tjokorde Gede Agung Sukawati invited foreign artists to visit Bali and study painting in Bali, since then batuan painting began to be glimpsed because of its very unique characteristics with the theme -theme of folklore (Tantri, Rajapala, Calonarang), wayang stories (Mahabharata and Ramayana), daily life, religious activities. The process of working on this batuan style painting is very long and requires very high accuracy. In addition, there are also many batuan paintings that contain the values ​​of character education and various values ​​that can grow human awareness for the better which are absorbed from the themes of the stories of Mahabharata, Ramayana, Tantri, Calonarang, and various other folk tales that make people see them understand about the meaning of the painting he made. Along with the times, not only traditional paintings are available here, there are also various painting arts such as contemporary, abstract, minimalist and others, but the painting techniques still use batuan styles such as nyeket, ngorten, nyawi, nyigar, ngucek and manyuni, where these techniques is the hallmark of batuan style painting, so it makes the painting very different and very artistic</p>\n<h3 class=\"font-small\">Traditional Painting at Batuan Village </h3>\n<p class=\"text-justify\">It is limited to ceremonial aspects such as the religious section, calendar and wayang kulit (Balinese: wayang) which is known as Kamasan or Wayang Style. Wayang itself is a two-dimensional painting that characterizes Hindu-Buddhist epics such as Mahabharata and Ramayana. The paintings were used in temples or palaces as ornaments. They describe many stories about Balinese religion and life. Usually they are pieces of a painting that tell a story. The name of the kamasan style itself is taken from the name of the village where it comes from. The materials used in the kamasan style are also traditional ingredients from minerals and vegetables or plant sources. They also use white bone, soot, or stone. Bamboo is used as a tool for painting and the media (canvas) is usually a traditional canvas made of wood, tree leaves, or cloth. In 1930, there were western artists who visited Bali and had changed the rules on Balinese painting. The introduction of the new canvas from western materials, ink and paint, has transformed the style into modern painting. The year has started a new way of painting Balinese modern art. The increasing number of artists who come to Bali has a traditional style influence that is limited to the ceremonial aspect. Batuan village is not influenced by the west like in Ubud. Rock paintings are often dark, overcrowded representations of legendary scenes or themes from everyday life, strange animal monsters, and witches greeting people. The paintings of Batuan Village are gradations of black to white ink that are spread over most of the surfaces, creating a pitch-dark atmosphere. In later years, the design covered the entire space, which often contributed to the bustling nature of these Balinese paintings.</p>\n\n<h3 class=\"font-small\">Batuan Village is The Center of Painting Art in Bali</h3>\n<p class=\"text-justify\">From time to time, <strong>Batuan Art Painting</strong> has become very popular, and many tourists visit the batuan village to see the art of painting, from high tourist enthusiasm for the art of painting, many painting artists open art galleries along the batuan village, which made the batuan village famous until now as <a href=\"https://www.baligoldentour.com/batuan-village.php\" title=\"The Center of Painting Art in Bali\">The Center of Painting Art in Bali</a>, if you are on vacation in Bali and like painting, then it would be nice if you visit this batuan village and stop by one of the artists' places to see their work and also see painting process. Along with the development of painting and market demand, many types of paintings exist, the batuan village also adapts by providing these paintings, without leaving the characteristics of batuan painting with batuan painting techniques that are phenomenally beautiful, besides that many artists from outside the batuan village entrust His works are here to be sold to foreign and domestic tourists. It is not wrong if Batuan Village is said to be the center of painting in Bali, because it is true that here there are various types of paintings from various styles here, so if you like painting, you are in the right place, namely the village of batuan painting art village</p>\n\n<h3 class=\"font-small\">Facilities at Batuan Village</h3>\n<p class=\"text-justify\">Batuan village is a village, and you can visit one of the art galleries along this batuan village road and on average this art gallery has very complete facilities, from a very large parking lot, and there is also a place where you can see the process of making paintings by local artists here, from start to finish you can see and observe this complex process, besides that here there are also many collections of paintings produced and there are also several painting artists from outside the area who entrusted their paintings here. So enjoy your day by looking at the beautiful paintings of various painting styles here you can see, and even buy them if you are interested and bring them to your country as souvenirs. A very memorable experience on vacation in Bali by seeing world-famous painting from ancient times since the first time tourism in Bali. And they also accept painting orders, for those of you who want to paint according to your order, they can make it, but this will take a long process in making it. Enjoy a holiday in Bali by visiting the batuan village which is the center of painting in Bali</p>"
]