[
  "<h1><a href=\"https://www.baligoldentour.com/ujung-water-palace.php\" title=\"UJUNG WATER PALACE\">UJUNG WATER PALACE</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/ujung-water-palace.php\" title=\"UJUNG WATER PALACE ALSO KNOWN AS TAMAN UJUNG SOEKASADA KARANGASEM IS A BEAUTIFUL GARDEN AND BIG FISH PONDS IN EAST BALI\">UJUNG WATER PALACE ALSO KNOWN AS TAMAN UJUNG SOEKASADA KARANGASEM IS A BEAUTIFUL GARDEN AND BIG FISH PONDS IN EAST BALI</a></h2>\n<a href=\"https://www.baligoldentour.com/ujung-water-palace.php\"><img src=\"images/bali-interest-place/ujung-water-palace-bali-golden-tour.jpg\" alt=\"UJUNG WATER PALACE | TAMAN SUKASADA UJUNG | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"UJUNG WATER PALACE | TAMAN SUKASADA UJUNG | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a> \n\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/ujung-water-palace.php\" title=\"Ujung Water Palace\"><strong>Ujung Water Palace</strong></a>,  which by the local people is called as Taman Soekasada Ujung,  was built in 1919 the launching of this complex of water palace was performed in 1912 and inaugurated  in 1921 by the King of Karangasem which at first used for resting place and for  entertaining important guests such as kings or the Chief Executive foreigners  who visited the kingdom of Karangasem. A park which is one of the leading tourist destinations in Karangasem Regency which is a historic site built by the king of Karangasem a long time ago, with a beautiful garden design and a large fish pond making this place ideal for those who want to feel the cool garden atmosphere. , comfortable, beautiful and very suitable as a place of recreation for families and couples</p>\n  <p class=\"text-justify mb-2\"><strong>If you visit Ujung Water Palace Bali, here all you need to know</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#location\">Location Ujung Water Palace</a></li>\n<li><a href=\"#history\">Ujung Water Palace History</a></li>\n<li><a href=\"#geography\">Ujung Water Palace Geography</a></li>\n<li><a href=\"#mascot\">Mascot East Bali Tourist Destination</a></li>\n</ul>\n<span id=\"location\">\n<h3 class=\"font-small\">Ujung Water Palace Location</h3>\n<p class=\"text-justify\"> Ujung Water Palace is located in Ujung  Countryside lies at Tumbu village, south part of Karangasem regency or about 2, hours from Bali's  International Airport. From Denpasar Town, we have to take the highway of Ida  Bagus Matra's Street and go to the east part of Bali until arrive at Karangasem  town. The journey will take about 2 hours and turn right to the south part of  Karangasem town. Ujung Water Palace is right located in the costal side with  beautiful old building and the right place to visit during your vacation in  Bali. If you don't want to bother driving yourself to this place, you can use our transportation service, namely Bali Car Charter at a very cheap price and very satisfying service and accompanied by a friendly and experienced driver will make the trip to Taman Ujung Water Palace. be so much fun. If you happen to be in the eastern area of ​​Bali, you can take the time to see the beauty of Taman Ujung</p>\n</span>\n<span id=\"history\">\n<h3 class=\"font-small\">Ujung Water Palace History</h3>\n<p class=\"text-justify\">The invasion of the Netherlands in 1908 where the regents status  under the Dutch colonial and the King of karangasem given powers to regulate  regional and wealth. I Gusti Bagus Jelantik then titled Ida Anak Agung Anglurah  Karangasem was the last king who ruled the East Bali from 1909 until1945. The  King of Karangasem on this period was the architect of Ujung Water Palace. The water palace is a beautiful park with big fish pond surrounds the old  Karangasem Empire heritage building which is used by the Karangasem's King for  day relaxation or meeting place in their era. It is located in Ujung  Countryside about 5 Km from Amlapura town. This park is originally met one pool  only which is very Ghostlike and very secret called by Di Dirah and this pool  at the period of I Gusti Gede Putu King (1849-1893) governance with his brother  of Gede Oka (1849-1890) that the around of this pool is functioned as place of  exile for the man who alleged to run the black magic (leak). At the period of I  Gusti Bagus Jelantik governance which start to lead the Karangasem Kingdom in  the year 1909, this pool area is extended and developed by some pools and also  luxury building Bale Gili with European style (modern style), later then it is  given the name called Taman Sukasada / Sukasada Park Ujung Karangasem and known as a Ujung Water Palace, that is  estimate made in the year of twentieth.</p>\n</span>\n<span id=\"geography\">\n<h3 class=\"font-small\">Ujung Water Palace Geography</h3>\n<div class=\"row row-tour\">\n<div class=\"col-lg-8 pad-tour\">\n<p class=\"text-justify\">Ujung Water Palace is strategically located in the  coastal side, south part of Karangasem town and founding a lot of wellspring  around the area. If seen from the history aspect, most of all omissions from  Karangasem Empire both for Lombok Island and also exist in Bali, altogether  area consisted by the pool and Gili building which is exist in the middle of  pool like Mayura and Narmada Park which are existing in west part of Lombok  Island. </p>\n<p class=\"text-justify\">On the most tip of  the highest level of this complex of Ujung Water Palace, we will find a great statue of  \"warak\" (rhinoceros). Beneath the warak there is a Bull statue. From  this high place we will see a marvellous view of sea, hills with lush and green  forest, the beauty of Mount Agung combined with the green terraced rice fields.</p>\n<p class=\"text-justify\">The greatness of Ujung Water Palace had been  destructed by the explotion of Mount Agung in 1963 which was made worst by the  great shake happened in 1979. However, the recovery effort had been performed  to bring back the glory of this complex of water palace by holding a  reconstruction and revitalisation project on it. Although it is not as great as  it was, the amaze of the past still can be seen here this moment.</p>\n\n</div>\n<div class=\"col-lg-4 pad-tour\"><a href=\"https://www.baligoldentour.com/ujung-water-palace.php\"><img src=\"images/bali-interest-place/ujung-water-palace-garden.jpg\" alt=\"GARDEN UJUNG WATER PALACE | TAMAN SUKASADA UJUNG | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"500\" height=\"350\" class=\"full-width mb-3\" title=\"GARDEN UJUNG WATER PALACE | TAMAN SUKASADA UJUNG | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a> </div>\n</div>\n</span>\n<span id=\"mascot\">\n<h3 class=\"font-small\">Mascot East Bali Tourist Destination</h3>\n<p class=\"text-justify\">We can say that this Ujung Water Palace as a mascot of tourist destinations  in east part of Bali because Sukasada Park has been recognized until foreign  countries since twenty's year and more famous again in the year of thirtieth  when all foreign tourist start to pay a visit to Bali. King of Karangasem I  Gusti Bagus Jelantik who is known as Anak Agung Anglurah Ketut Karangasem is a  Statesman, Man of letters as well as an architect. He has created a lot of  building not even in the form of park but he also done some building which are  exist in Puri Agung Karangasem (Karangasem Palace) like gateway which is  looking like pagoda. If you are on vacation on the island of Bali, it would be nice to visit the garden at the end of this water palace, with all the beauty of the garden that is set so amazing that it will complete your adventure while visiting Bali, especially tourist destinations located in the eastern part of the island of Bali.</p>\n</span>"
]