[
  "<h1><a href=\"https://www.baligoldentour.com/ulun-danu-temple.php\" title=\"BALI ULUN DANU BERATAN TEMPLE\">BALI ULUN DANU BERATAN TEMPLE</a></h1>\n<h2><a href=\"https://www.baligoldentour.com/ulun-danu-temple.php\" title=\"BALI ULUN DANU BERATAN TEMPLE IS DEDICATED TO THE GODDESS OF THE LAKE IS IDA BATARI ULUN DANU ON THE EDGE OF A HUGE CRATER\">BALI ULUN DANU BERATAN TEMPLE IS DEDICATED TO THE GODDESS OF THE LAKE IS IDA BATARI ULUN DANU ON THE EDGE OF A HUGE CRATER</a></h2>\n<a href=\"https://www.baligoldentour.com/ulun-danu-temple.php\"><img src=\"images/bali-interest-place/ulun-danu-temple-bali-golden-tour.jpg\" alt=\"ULUN DANU TEMPLE | LAKE TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\" width=\"1250\" height=\"500\" class=\"auto-width mb-3\" title=\"ULUN DANU TEMPLE | LAKE TEMPLE | BALI INTEREST PLACE | BALI GOLDEN TOUR\"></a>\n\n<p class=\"text-justify\"> <strong><a href=\"https://www.baligoldentour.com/ulun-danu-temple.php\" title=\"Bali Ulun Danu Beratan Temple\">Bali Ulun Danu Beratan Temple</a></strong> is a temple dedicated to  the goddess of the lake is Ida Batari Dewi Ulun Danu on the edge of a huge  crater. The dominant shrines are Meru’s (pagodas) dedicated to the lake goddess  and the gods of Mount Batur and Mount Gunung Agung, the largest volcano in Bali. The temple was built in the  17th century in worship of the main Hindu trinity, Brahma-Vishnu-Shiva, as well  as the lake goddess, Dewi Danu. The sight and cool atmosphere of the Bali  uplands have made the lake and this temple a favourite sightseeing and  recreational spot as well as a frequently photographed site. Ulun  Danu Beratan Temple, literally ‘the source temple of Lake Beratan’, is easily the  island’s most iconic sanctuary sharing the scenic qualities with the seaside  temples of <a href=\"https://www.baligoldentour.com/uluwatu-temple.php\" title=\"Uluwatu Temple\" target=\"_blank\">Uluwatu Temple</a> and <a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\" title=\"Tanah Lot Temple\">Tanah Lot Temple</a>. The smooth reflective surface of the lake  surrounding most of the temple’s base creates a unique floating impression,  while the mountain range of the Bedugul region encircling the lake provides the  temple with a scenic backdrop.</p>\n  <p class=\"text-justify mb-2\"><strong>If you visit Ulun Danu Beratan Temple, here's what you need to know</strong></p>\n<ul class=\"mb-4\">\n<li><a href=\"#location\">Location of Ulun Danu Beratan Temple</a></li>\n<li><a href=\"#history\">History Ulun Danu Beratan Temple</a></li>\n<li><a href=\"#ulun-danu\">Ulun Danu Beratan Temple or Ulun Danu Temple ?</a></li>\n<li><a href=\"#complex\">Ulun Danu Beratan Temple Complex</a></li>\n<li><a href=\"#ceremony\">Ulun Danu Beratan Temple Ceremony</a></li>\n<li><a href=\"#iconic\">Iconic Ulun Danu Beratan Temple</a></li>\n<li><a href=\"#function\">Functions of Ulun Danu Beratan Temple</a></li>\n<li><a href=\"#buddhist\">Buddhist Stupa at Ulun Danu Beratan Temple</a></li>\n<li><a href=\"#things-to-do\">Things To Do at Ulun Danu Beratan Temple</a></li>\n<li><a href=\"#facilities\">Facilities of Ulun Danu Beratan Temple</a></li>\n</ul>\n<span id=\"location\">\n<h3 class=\"font-small\">Location Ulun Danu Beratan Temple</h3>\n<p class=\"text-justify\">The location of <a href=\"https://www.baligoldentour.com/ulun-danu-temple.php\" title=\"Ulun Danu Beratan Temple\">Ulun Danu Beratan Temple</a> is located in the village of Bedugul, and it is very easy to find because it is on the main road that leads to Iconic Handara Gate and is also located on the beautiful Beratan Lake. If you depart from Kuta or Seminyak it will take about two hours of travel, which is quite a long time to reach the location, because it is located in the highlands where many famous tourist destinations are nearby. With a very cool atmosphere, this temple has become one of the icons of the Bedugul village, which is most often visited by foreign and domestic tourists. If you want to go here, we from <a href=\"https://www.baligoldentour.com\" title=\"Bali Tour\">Bali Tour</a> are ready to take you by offering a very cheap Hire Car and Driver with very satisfying service and of course an experienced driver will make the trip to Ulun Danu Beratan very enjoyable.</p>\n</span>\n<span id=\"history\">\n<h3 class=\"font-small\">History Ulun Danu Beratan Temple</h3>\n<p class=\"text-justify\">Ulun Danu Beratan Temple can be traced back to the rise of the Mengwi  kingdom. The name of Ulun Danu Beratan Temple is  taken from the lake where the temple is built at&nbsp;Beratan Lake. The name of Beratan Lake is  inseparable with the Beratan Mount as Deity and Goddess as fertility source,  prosperity to keep the prosperity in life and society life. In Papyrus Chronicle of the Mengwi is elaborated by the history  of Ulun Danu Beratan Temple founding together with existence of the Mengwi  Empire. Therefore its status is pertained with the secondhand of Temple Empire  what is usually pertained as Dang Kahyangan. It is the same to the description  in papyrus of Usana Bali and Padma Bhuwana, hence Puncak Mangu Temple where the  Panyawangan (representative place to worship) is the Ulun Danu Beratan Temple. So it is called by entire&nbsp;Balinese residents&nbsp;as Kahyangan Jagat (The  Biggest Group of Hindu Temple in Bali ). The ‘floating’ temple complex is comprised of four groups of shrines,  including the prominent Lingga Petak shrine to its east. There are four gates  facing each of the four points of the compass. </p>\n</span>\n<span id=\"ulun-danu\">\n<h3 class=\"font-small\">Ulun Danu Beratan Temple or Ulun Danu Temple ?</h3>\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/ulun-danu-temple.php\" title=\"Ulun Danu Beratan Temple\">Ulun Danu Beratan Temple</a> mostly called as a Ulun Danu Temple but  not to be confused with <a href=\"https://www.baligoldentour.com/batur-temple.php\" title=\"Ulun Danu Batur Temple\">Ulun Danu Batur Temple</a>, which is  on the rim of the caldera at Batur Lake. It is especially important for the Balinese. Only  here can you get holy water of a particular variety.\nThe water is collected from the lake itself, directly in front of the temple.  Visitors have to wear a sash and not go near. Bathing is forbidden. The lake is  the ultimate source of water for the rivers and springs that irrigate central  Bali. It is therefore of the utmost importance. The temple priests say that the  lake is fed by springs located at each of the wind directions. Each of the  springs is the origin of water for that particular region of central Bali. So,  farmers from North Bali collect their holy water from the northern spring of  the lake and so on. Ulun Danu Temple&nbsp;lies by the western banks of Lake Bratan in the Bedugul Highlands at a level of 1239m, is one of the most picturesque and most photographed temples in Bali. Ulun Danu is inside the caldera of the now extinct volcano Gunung Catur. It is one of the main sources of irrigation in the Balinese highlands, and so the temple is dedicated to Dewi Danu, the lake goddess.</p>\n</span>\n<span id=\"complex\">\n<h3 class=\"font-small mb-2\">Ulun Danu Beratan Temple Complex</h3>\n<p class=\"text-justify\"><a href=\"https://www.baligoldentour.com/ulun-danu-temple.php\" title=\"Ulun Danu Beratan Temple\">Ulun Danu Beratan Temple</a> complex that is very wide and very beautiful, there are four important and sacred temples in the Ulun Danu Beratan area of ​​this temple. Which is often visited by Hindus who on their Tirta Yatra trip, always visit the Ulun Danu Beratan Temple, because it is one of the oldest, sacred and important temples for Hindus in Bali. Some of the temples in the Ulun Danu Beratan Temple area are as follows:</p>\n<ul class=\"text-justify mb-3\">\n<li class=\"text-justify mb-2\">Lingga Petak Temple owns the function to worship the Siwa God, Each door faces the four cardinal directions, where Lingga Petak Temple is the source of Lake Beratan &amp; Fertility in the Lake Beratan area. Inside the Lingga Petak building there is a sacred well that stores the holy water from Ulun Danu Bratan which is located between two large black and red stones. As for this temple which looks very iconic where it is located on Lake Beratan and its uniqueness can be seen when the lake water is large, it looks like this Lingga Petak looks like it is floating on Lake Beratan, a very iconic and very beautiful sight, it is not surprising that Ulun is a tourist destination. Beratan Lake is often visited by foreign and domestic tourists</li>\n<li class=\"text-justify mb-2\">Penataran Pucak Mangu Temple is referred this gate as Parhyangan ri pinggiring rawa Beratan or Danu Beratan Temple is founded by I Gusti Agung Putu to worship the Hyang ing Parwata or Deity which is placed in Pucak Mangu that is Bhatara Hyang Danawa as according to papyrus of Padma Bhuwana and Usana Bali, because Mangu Mount is located in north direction, hence it is called the Bhatara Hyang Danawa or Wisnu God. The temple is devoted to worship Tri Purusha Shiva, those are Shiva, Sadha Shiva, Parama Shiva. This temple facing south, and could be seen after entering the Balinese Gate “Candi Bentar” towards to the lake Beratan.</li>\n<li class=\"text-justify mb-2\">Terate Bang Temple is functioning to worship of Brahma God, this is the palace of Lord Agni which has hot springs with the smell of sulfur. When entering this temple area, you will smell a very strong sulfur smell and a sour taste of water, where the acid signifies and has the energy of prosperity, so it will give an aura of gold and prosperity, especially those who have the soul of an entrepreneur or trader. Located next to the lake and going there we need a speed boat from Lake Beratan to see the beauty of the Lotus Temple from a speed boat</li>\n<li class=\"text-justify mb-2\">Dalem Purwa Temple is functioning to worship of Danu Goddess which is considered to be miraculous of the Bhatara Hyang Danawa or Laksmi Goddess. is as a palace and worship of the goddess \"Dewi Durga\" and the god \"God Ludra\" which serves as a source of prosperity, Mani Murda Temple and the long hall \"Bale Pemaruman\" as a place to hold \"Upakara\" ceremonial equipment. The holy places face east and are located on the south bank of Lake Beratan.</li>\n<li class=\"text-justify mb-2\">Beji Temple is a temple in the Ulun Danu temple complex and is used for the Ngebejiang Ceremony asking for holy water \"Tirta\" to purify the ceremony facilities, besides that Beji Temple is also used as a place for the Melasti Ceremony \"Ahead of Nyepi Day\" by the community. Hindus in Bali. The location of this temple is on the east side of the Enjung Beji Hotel and is not surrounded by walls.</li>\n</ul>\n</span>\n<span id=\"ceremony\">\n<h3 class=\"font-small\">Ulun Danu Beratan Temple Ceremony</h3>\n<p class=\"text-justify mb-2\">What you need to know is that there are certain days for religious ceremonies at the Ulun Danu Beratan Temple, while the ceremony days are calculated based on the Balinese calendar where one month has 35 days, so if by chance you visit the Ulun Danu Beratan Temple to coincide with the holiday. , you will see many Hindus who come here to pray for safety, inner and outer happiness as well as health. It is hoped that if you see Hindus praying here to be polite and not interfere with the ceremony taking place, so that the situation becomes very comfortable and peaceful. The ceremony at the Ulun Danu Beratan Temple is divided into two stages of ceremonies that are often held</p>\n<ol>\n<li class=\"text-justify mb-2\">The temple ceremony which is executed every six-month (210 days) that on Anggara (Tuesday) Kliwon Julungwangi (Base on Balinese Hindu calendar). Every 12 months (420 days) is executed by the bigger ceremony from the ordinary ceremony, so-called Piodalan Agung. On certain days such as full moon, tilem and other major Hindu holidays, many Hindus come to pray together, including the purpose of Melasti and Ngegara Gunung ceremonies as a series of Ngaben.</li>\n<li class=\"text-justify mb-2\">Pakelem ceremony is executed at any times as according to situation and condition. The Pakelem ceremony owns the function to worship the supremacy and also cheapness of the infinite for award of life, fertility, prosperity, as impact of the existence of ecosystem balance so that give the benefit for life and universe life forever and ever, during Beratan Lake and Beratan Mount stand up</li>\n</ol>\n</span>\n<div class=\"row\">\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/ulun-danu-temple.php\"><img src=\"images/bali-interest-place/ulun-danu-beratan-temple-1.jpg\" alt=\"Lingga Petak Tumpang Solas | Tabanan Places of Interest | Bali Golden Tour\" width=\"370\" height=\"250\" class=\"full-width\" title=\"Lingga Petak Tumpang Solas | Tabanan Places of Interest | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Lingga Petak Tumpang Solas</p></div>\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/ulun-danu-temple.php\"><img src=\"images/bali-interest-place/ulun-danu-beratan-temple-2.jpg\" alt=\"Budhist Stupa at Ulun Danu Beratan Temple | Tabanan Places of Interest | Bali Golden Tour\" width=\"370\" height=\"250\" class=\"full-width\" title=\"Budhist Stupa at Ulun Danu Beratan Temple | Tabanan Places of Interest | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Buddhist Stupa</p></div>\n<div class=\"col-md-4\"><a href=\"https://www.baligoldentour.com/ulun-danu-temple.php\"><img src=\"images/bali-interest-place/ulun-danu-beratan-temple-3.jpg\" alt=\"Garden View at Ulun Danu Beratan | Tabanan Places of Interest | Bali Golden Tour\" width=\"370\" height=\"250\" class=\"full-width\" title=\"Garden View at Ulun Danu Beratan | Tabanan Places of Interest | Bali Golden Tour\"></a>\n<p class=\"text-center mb-3\">Garden at Ulun Danu Beratan</p></div>\n</div>\n<span id=\"iconic\">\n<h3 class=\"font-small\">Iconic Ulun Danu Beratan Temple</h3>\n<p class=\"text-justify\">Ulun Danu Beratan Temple is one of the most popular tourist destinations among foreign and domestic tourists, with all the beauty of this temple located on Lake Beratan called Lingga Petak which is the target of photographers, in addition to the beauty that is emitted and located in a good place, namely Lake Beratan, Besides the Lingga Petak Temple, this beautiful lake is also the target of photography. It can be said that Ulun Danu Beratan Temple is an icon of Bedugul village, and is one of the most visited tourist destinations besides <a href=\"https://www.baligoldentour.com/uluwatu-temple.php\" title=\"Uluwatu Temple\" target=\"_blank\">Uluwatu Temple</a>, <a href=\"https://www.baligoldentour.com/tanah-lot-temple.php\" title=\"Tanah Lot Temple\">Tanah Lot Temple</a> and <a href=\"https://www.baligoldentour.com/lempuyang-temple.php\" title=\"Lempuyang Temple\">Lempuyang Temple</a>. If you visit the village of Bedugul, don't forget to stop by here, with a fantastic view that will make the photos very iconic and very instagramable. In the past, if you came to Bali and saw a postcard, surely you would see a photo of this Ulun Danu Beratan temple on a postcard, this indicates that the Ulun Danu Beratan temple has been known since the beginning of tourism in Bali and with this it can be said that the Ulun Danu temple Beratan has become famous in foreign countries thanks to this postcard with a picture of Ulun Danu Beratan temple</p>\n</span>\n<span id=\"function\">\n<h3 class=\"font-small\">Functions of Ulun Danu Beratan Temple</h3>\n<p class=\"text-justify\">As one of the most famous tourist destinations in the world, and becoming one of the icons of the village of Bedugul, where the Lingga Petak Temple overlaps solas and overlaps three, it always offers a very beautiful beauty to the eye, from various angles it still looks so beautiful. and very photographic and it's no wonder that the Ulun Danu Beratan Temple is used as a photo on a postcard and also in a note that displays the beauty of this Ulun Danu Beratan temple. Some of the functions of the Ulun Danu Beratan Temple are as follows:</p>\n<ul class=\"text-justify mb-3\">\n<li class=\"text-justify mb-2\">As a place of worship to Sang Hyang Widhi in his nature as a God Prosperity</li>\n<li class=\"text-justify mb-2\">As a place of worship for the goddess who resides in Lake Beratan, namely Dewi Laksmi who is the goddess of fertility and beauty.</li>\n<li class=\"text-justify mb-2\">The existence of Lake Beratan as a water source for agricultural irrigation for the surrounding area making it hold the status of Pura Kahyangan Jagat, which is a public temple where Hindus pray from across regions, groups, and professions.</li>\n<li class=\"text-justify mb-2\">As a place of worship, it is realized by the existence of several worship buildings/pelinggih. Between the pelinggih, there are two buildings – namely\nThe Palebahan of the Middle Segara Temple and the Palebahan of the Most Lingga Petak/Ulun Danu which position jutting into the middle of the lake. The unique position of these two sacred buildings is rare found in the Ulun Danu temple which was established in other lakes in Bali. This makes the two sacred buildings in the middle of Lake Beratan not only have spiritual value but also high beauty value.</li>\n<li class=\"text-justify mb-2\">Besides functioning as a place of worship for Hindus from many surrounding areas, Ulun Danu Beratan Temple has indeed become a center of attraction for tourism in Bedugul.</li>\n</ul>\n</span>\n<span id=\"buddhist\">\n<h3 class=\"font-small\">Buddhist Stupa at Ulun Danu Beratan Temple</h3>\n<p class=\"text-justify\">What is unique you can see when visiting the <a href=\"https://www.baligoldentour.com/ulun-danu-temple.php\" title=\"Ulun Danu Beratan Temple\">Ulun Danu Beratan Temple</a> is the presence of a Buddhist Stupa located in the Ulun Danu Beratan temple area. Which has the meaning of religious harmony and harmony in ancient times. and this stupha building faces south and is located outside the temple area, precisely in the garden area in Ulun Danu Beratan Temple. It is not known exactly when the Buddha stupha was built, it is possible to say that the construction coincided with the construction of the Ulun Danu Beratan Temple, which can be concluded if long ago there was religious tolerance between Hindus and Buddhists which is evidence of harmony and harmony within the community. religious. Based on the archaeological data found and located on the front page of the Ulun Danu Bedugul Temple, there are historical relics such as a stone sarcophagus and stone boards which are estimated to have existed since the megalithic era, around 500 BC. And if based on the data, then the age of the Ulun Danu Beratan temple is very old, and is one of the oldest rows of temples on the island of Bali.</p>\n</span>\n<span id=\"things-to-do\">\n<h3 class=\"font-small\">Things To Do at Ulun Danu Beratan Temple</h3>\n<p class=\"text-justify\">As for the Ulun Danu Beratan Temple as an icon of this Bedugul village, which is never deserted by the visits of foreign and domestic tourists, it turns out that there are several things you can do here besides visiting the beauty of this Ulun Danu Beratan temple. This will complete your adventure to see the oldest temple on the island of Bali with all its uniqueness that always amazes us. If you visit the Ulun Danu Beratan Temple you can do the following things to fill the time while visiting the Icon of this Bedugul village</p>\n<ul class=\"text-justify mb-3\">\n<li class=\"text-justify mb-2\">Jukung Tour: Jukung is a traditional boat, on Lake Beratan there is a service for renting a jukung that you can use to get around this beautiful Beratan Lake from the middle of the lake, an experience that you probably won't forget, where to go around the lake by using Jukung, an unforgettable sensation to go around Beratan Lake which is so beautiful</li>\n<li class=\"text-justify mb-2\">Take Photo with Animals: Here there are also professional photo services that offer their services to take photos with some very exotic animals such as albino pythons, chameleons, eagles, green hornbills, owls, bats, parrots and other animals that are not inferior pull it. An unforgettable experience where taking pictures with exotic animals in the Ulun Danu Beratan Temple area</li>\n<li class=\"text-justify mb-2\">Children's Playground: Here there is a playground for children placed in the park, very suitable for those of you who travel with family and enjoy time by letting your children play in this playground, there are small swings, slides and others that will make your child feel at home playing on the playground in the Ulun Danu temple garden at this temple</li>\n<li class=\"text-justify mb-2\">Shopping: Here there are small art shops lined up along the parking area, mostly selling various handicrafts and clothes that you can buy as souvenirs for your family and friends, various casual clothes, beach clothes and others can be purchased here with the price is cheap and of course the price can be negotiated, if you are smart to bargain you can get goods at low prices</li>\n</ul>\n<p class=\"text-justify\">An activity that will make your visit to the Ulun Danu Beratan Temple very complete and full of memories, so it's not wrong for you to choose this Ulun Danu Beratan temple as one of the tourist destinations that must be visited on your tour list. With beautiful views, very cool air, seeing historical buildings will complete your adventure on this beloved island of Bali</p>\n</span>\n<span id=\"facilities\">\n<h3 class=\"font-small\">Facilities of Ulun Danu Beratan Temple</h3>\n<p class=\"text-justify\">As for a very popular tourist destination on the island of Bali, the facilities at the Ulun Danu Beratan Temple are very complete, from a very large parking lot so that it can accommodate dozens of large buses here, with a large parking capacity, it is hoped that guests will feel comfortable inside. parking the vehicle to be safe and quiet. If you visit here, you don't have to worry about parking, there are also toilet facilities near the parking lot and also inside, with this toilet facility you don't need to hesitate anymore if you want to go to the restroom, there are restaurant facilities near the ulun area Danu, with fast Indonesian food that will add to your excitement in visiting the Ulun Danu Beratan temple, there is an art shop in the parking area that sells handicrafts and souvenirs from this Ulun Danu Beratan temple, so you can buy it and give it as a gift for your family or friends. A very complete facility and will make tourists feel at home to linger at this very iconic Ulun Danu Beratan Temple.</p>\n        </span>"
]